[Survived] Regex
scripts/lib/brief-shape.mjs:70:9
-       if (/^\s*(```|~~~)/.test(text)) {
+       if (/\s*(```|~~~)/.test(text)) {

[Survived] Regex
scripts/lib/brief-shape.mjs:70:9
-       if (/^\s*(```|~~~)/.test(text)) {
+       if (/^\S*(```|~~~)/.test(text)) {

[Survived] Regex
scripts/lib/brief-shape.mjs:128:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d+[.)])\s+(.*)/.exec(text);

[Survived] Regex
scripts/lib/brief-shape.mjs:128:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d+[.)])\s(.*)$/.exec(text);

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:137:30
-       else strays.push({ text: text.trim(), line });
+       else strays.push({ text: text, line });
