[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:76:12
-     bypass = [],
+     bypass = ["Stryker was here"],

[Survived] ObjectLiteral
scripts/lib/vault-write-notice.mjs:78:62
-     const nothing = { updatedInput: null, context: null, said: { universes: [], corrections: [] }, bypassUsed: false };
+     const nothing = { updatedInput: null, context: null, said: {}, bypassUsed: false };

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:78:75
-     const nothing = { updatedInput: null, context: null, said: { universes: [], corrections: [] }, bypassUsed: false };
+     const nothing = { updatedInput: null, context: null, said: { universes: ["Stryker was here"], corrections: [] }, bypassUsed: false };

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:78:92
-     const nothing = { updatedInput: null, context: null, said: { universes: [], corrections: [] }, bypassUsed: false };
+     const nothing = { updatedInput: null, context: null, said: { universes: [], corrections: ["Stryker was here"] }, bypassUsed: false };

[Survived] BooleanLiteral
scripts/lib/vault-write-notice.mjs:78:110
-     const nothing = { updatedInput: null, context: null, said: { universes: [], corrections: [] }, bypassUsed: false };
+     const nothing = { updatedInput: null, context: null, said: { universes: [], corrections: [] }, bypassUsed: true };

[Survived] BooleanLiteral
scripts/lib/vault-write-notice.mjs:110:87
-     const quiet = { updatedInput: null, corrections: [], protectedHits: [], bypassUsed: false };
+     const quiet = { updatedInput: null, corrections: [], protectedHits: [], bypassUsed: true };

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:123:7
-     if (entries.length === 0) return { ...quiet, bypassUsed };
+     if (false) return { ...quiet, bypassUsed };

[Survived] StringLiteral
scripts/vault-write-notice.mjs:43:32
-   export const BYPASS_REL = join(".cache", "spelling-bypass.json");
+   export const BYPASS_REL = join("", "spelling-bypass.json");

[Survived] ArrayDeclaration
scripts/vault-write-notice.mjs:60:80
-     readBypass: (brainDir) => readJson(join(brainDir, BYPASS_REL))?.spellings ?? [],
+     readBypass: (brainDir) => readJson(join(brainDir, BYPASS_REL))?.spellings ?? ["Stryker was here"],

[Survived] ObjectLiteral
scripts/vault-write-notice.mjs:61:65
-     clearBypass: (brainDir) => rmSync(join(brainDir, BYPASS_REL), { force: true }),
+     clearBypass: (brainDir) => rmSync(join(brainDir, BYPASS_REL), {}),

[Survived] BooleanLiteral
scripts/vault-write-notice.mjs:61:74
-     clearBypass: (brainDir) => rmSync(join(brainDir, BYPASS_REL), { force: true }),
+     clearBypass: (brainDir) => rmSync(join(brainDir, BYPASS_REL), { force: false }),
