[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:194:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] OptionalChaining
scripts/lib/vault-write-guard.mjs:197:48
-     const verdict = briefShapeVerdict({ content: parsed?.content ?? "", type: parsed?.data?.type });
+     const verdict = briefShapeVerdict({ content: parsed.content ?? "", type: parsed?.data?.type });

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:197:67
-     const verdict = briefShapeVerdict({ content: parsed?.content ?? "", type: parsed?.data?.type });
+     const verdict = briefShapeVerdict({ content: parsed?.content ?? "Stryker was here!", type: parsed?.data?.type });

[Survived] OptionalChaining
scripts/lib/vault-write-guard.mjs:197:77
-     const verdict = briefShapeVerdict({ content: parsed?.content ?? "", type: parsed?.data?.type });
+     const verdict = briefShapeVerdict({ content: parsed?.content ?? "", type: parsed?.data.type });

[Survived] OptionalChaining
scripts/lib/vault-write-guard.mjs:197:77
-     const verdict = briefShapeVerdict({ content: parsed?.content ?? "", type: parsed?.data?.type });
+     const verdict = briefShapeVerdict({ content: parsed?.content ?? "", type: parsed.data?.type });

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:204:56
-         `${verdict.violations.map((v) => v.message).join(" ")} ` +
+         `${verdict.violations.map((v) => v.message).join("")} ` +
