[Survived] Regex
scripts/lib/brief-shape.mjs:134:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d+[.)])\s+(.*)/.exec(text);

[Survived] Regex
scripts/lib/brief-shape.mjs:134:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d+[.)])\s(.*)$/.exec(text);
