[Survived] StringLiteral
scripts/lib/brief-shape.mjs:64:35
-     const lines = String(content ?? "").split("\n");
+     const lines = String(content ?? "Stryker was here!").split("\n");

[Survived] ArithmeticOperator
scripts/lib/brief-shape.mjs:72:33
-         screen.push({ text, line: i + 1 });
+         screen.push({ text, line: i - 1 });

[Survived] Regex
scripts/lib/brief-shape.mjs:75:45
-       const level = inFence ? 0 : (text.match(/^#+/)?.[0].length ?? 0);
+       const level = inFence ? 0 : (text.match(/#+/)?.[0].length ?? 0);

[Survived] ArrowFunction
scripts/lib/brief-shape.mjs:82:37
-       if (level === 1 && !screen.some((l) => l.text.trim() !== "")) {
+       if (level === 1 && !screen.some(() => undefined)) {

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:82:44
-       if (level === 1 && !screen.some((l) => l.text.trim() !== "")) {
+       if (level === 1 && !screen.some((l) => false)) {

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:82:44
-       if (level === 1 && !screen.some((l) => l.text.trim() !== "")) {
+       if (level === 1 && !screen.some((l) => l.text !== "")) {

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:110:9
-       if (text.trim() === "") {
+       if (false) {

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:110:9
-       if (text.trim() === "") {
+       if (text === "") {

[Survived] BlockStatement
scripts/lib/brief-shape.mjs:110:29
-       if (text.trim() === "") {
-         current = null; // a blank line ends the bullet, so the next prose line is prose
-         continue;
-       }
+       if (text.trim() === "") {}

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:110:25
-       if (text.trim() === "") {
+       if (text.trim() === "Stryker was here!") {

[Survived] Regex
scripts/lib/brief-shape.mjs:117:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /([-*+]|\d+[.)])\s+(.*)$/.exec(text);

[Survived] Regex
scripts/lib/brief-shape.mjs:117:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d+[.)])\s+(.*)/.exec(text);

[Survived] Regex
scripts/lib/brief-shape.mjs:117:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d[.)])\s+(.*)$/.exec(text);

[Survived] Regex
scripts/lib/brief-shape.mjs:117:20
-       const marker = /^([-*+]|\d+[.)])\s+(.*)$/.exec(text);
+       const marker = /^([-*+]|\d+[.)])\s(.*)$/.exec(text);

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:119:25
-         current = { text: marker[2].trim(), line };
+         current = { text: marker[2], line };

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:123:33
-       if (current) current.text = `${current.text} ${text.trim()}`.trim();
+       if (current) current.text = `${current.text} ${text.trim()}`;

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:130:44
-   const characters = (n) => `${n} character${n === 1 ? "" : "s"}`;
+   const characters = (n) => `${n} character${true ? "" : "s"}`;

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:130:44
-   const characters = (n) => `${n} character${n === 1 ? "" : "s"}`;
+   const characters = (n) => `${n} character${false ? "" : "s"}`;

[Survived] EqualityOperator
scripts/lib/brief-shape.mjs:130:44
-   const characters = (n) => `${n} character${n === 1 ? "" : "s"}`;
+   const characters = (n) => `${n} character${n !== 1 ? "" : "s"}`;

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:130:54
-   const characters = (n) => `${n} character${n === 1 ? "" : "s"}`;
+   const characters = (n) => `${n} character${n === 1 ? "Stryker was here!" : "s"}`;

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:130:59
-   const characters = (n) => `${n} character${n === 1 ? "" : "s"}`;
+   const characters = (n) => `${n} character${n === 1 ? "" : ""}`;

[Survived] BooleanLiteral
scripts/lib/brief-shape.mjs:147:20
-     let openBullet = false;
+     let openBullet = true;

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:149:9
-       if (text.trim() === "") {
+       if (text === "") {

[Survived] Regex
scripts/lib/brief-shape.mjs:153:9
-       if (/^([-*+]|\d+[.)])\s+/.test(text)) {
+       if (/([-*+]|\d+[.)])\s+/.test(text)) {

[Survived] Regex
scripts/lib/brief-shape.mjs:153:9
-       if (/^([-*+]|\d+[.)])\s+/.test(text)) {
+       if (/^([-*+]|\d[.)])\s+/.test(text)) {

[Survived] Regex
scripts/lib/brief-shape.mjs:153:9
-       if (/^([-*+]|\d+[.)])\s+/.test(text)) {
+       if (/^([-*+]|\D+[.)])\s+/.test(text)) {

[Survived] Regex
scripts/lib/brief-shape.mjs:153:9
-       if (/^([-*+]|\d+[.)])\s+/.test(text)) {
+       if (/^([-*+]|\d+[^.)])\s+/.test(text)) {

[Survived] Regex
scripts/lib/brief-shape.mjs:153:9
-       if (/^([-*+]|\d+[.)])\s+/.test(text)) {
+       if (/^([-*+]|\d+[.)])\s/.test(text)) {

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:161:66
-           `line ${line} above the first \`##\` is not a bullet: "${text.trim()}". The first screen ` +
+           `line ${line} above the first \`##\` is not a bullet: "${text}". The first screen ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:162:9
-           `carries bullets and nothing else — no preamble, no sub-heading, no table, no link to go ` +
+           `` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:163:9
-           `and open. Make it one of the things you will say, or move it below the first \`##\`.`,
+           ``,

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:175:9
-           `everything between the title and that heading, and it carries at least one bullet — even ` +
+           `` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:176:9
-           `when the vault is thin, and then it is the one naming what is not documented.`,
+           ``,

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:187:9
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `` +

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:187:29
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${true ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:187:29
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${false ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +

[Survived] EqualityOperator
scripts/lib/brief-shape.mjs:187:29
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over !== 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:187:47
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "" : ""} less, or move ${over === 1 ? "it" : "them"} below ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:187:42
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "Stryker was here!" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:187:68
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${true ? "it" : "them"} below ` +

[Survived] ConditionalExpression
scripts/lib/brief-shape.mjs:187:68
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${false ? "it" : "them"} below ` +

[Survived] EqualityOperator
scripts/lib/brief-shape.mjs:187:68
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over !== 1 ? "it" : "them"} below ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:187:81
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "" : "them"} below ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:187:88
-           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : "them"} below ` +
+           `Say ${over} thing${over === 1 ? "" : "s"} less, or move ${over === 1 ? "it" : ""} below ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:188:9
-           `the first \`##\` as ammunition, where nothing is counted.`,
+           ``,

[Survived] MethodExpression
scripts/lib/brief-shape.mjs:198:57
-           `over the ceiling of ${BULLET_CHAR_CEILING}: "${text.slice(0, 60)}…". One bullet is one sentence ` +
+           `over the ceiling of ${BULLET_CHAR_CEILING}: "${text}…". One bullet is one sentence ` +

[Survived] StringLiteral
scripts/lib/brief-shape.mjs:199:9
-           `said aloud; the detail behind it belongs below the first \`##\`.`,
+           ``,
