[Survived] ConditionalExpression
scripts/refresh-note.mjs:98:5
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
+   if (false) {

[Survived] BlockStatement
scripts/refresh-note.mjs:98:53
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
-     process.exit(runRefresh(process.argv.slice(2)));
-   }
+   if (isEntrypoint(import.meta.url, process.argv[1])) {}

[Survived] MethodExpression
scripts/refresh-note.mjs:99:27
-     process.exit(runRefresh(process.argv.slice(2)));
+     process.exit(runRefresh(process.argv));
