[Survived] Regex
scripts/lib/reconcile-brain.mjs:106:40
-       const skillDir = skillGlob.replace(/\/\*\*?$/, ""); // ".../local-mirror/**" → ".../local-mirror"
+       const skillDir = skillGlob.replace(/\/\*\*?/, ""); // ".../local-mirror/**" → ".../local-mirror"

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:109:105
-         if (copyInto(sourceDir, brainDir, rel)) installedFileMap[rel] = readFileSync(join(brainDir, rel), "utf8");
+         if (copyInto(sourceDir, brainDir, rel)) installedFileMap[rel] = readFileSync(join(brainDir, rel), "");

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:159:60
-       const brainMcp = JSON.parse(readFileSync(brainMcpPath, "utf8"));
+       const brainMcp = JSON.parse(readFileSync(brainMcpPath, ""));

[Survived] BooleanLiteral
scripts/lib/reconcile-brain.mjs:188:30
-     let statusLineWasRemoved = false;
+     let statusLineWasRemoved = true;

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:193:70
-       const brainSettings = JSON.parse(readFileSync(brainSettingsPath, "utf8"));
+       const brainSettings = JSON.parse(readFileSync(brainSettingsPath, ""));

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:194:76
-       const templateSettings = JSON.parse(readFileSync(settingsTemplatePath, "utf8"));
+       const templateSettings = JSON.parse(readFileSync(settingsTemplatePath, ""));

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:312:58
-     const manifest = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const manifest = JSON.parse(readFileSync(manifestPath, ""));
