[Survived] ConditionalExpression
scripts/lib/engine-merge-apply.mjs:155:27
-         noteOnce(preserved, sidecar === undefined ? { name, reason } : { name, reason, newVersionPath: sidecarPath(rel) });
+         noteOnce(preserved, false ? { name, reason } : { name, reason, newVersionPath: sidecarPath(rel) });

[Survived] ObjectLiteral
scripts/lib/engine-merge-apply.mjs:155:51
-         noteOnce(preserved, sidecar === undefined ? { name, reason } : { name, reason, newVersionPath: sidecarPath(rel) });
+         noteOnce(preserved, sidecar === undefined ? {} : { name, reason, newVersionPath: sidecarPath(rel) });
