[Survived] Regex
scripts/lib/engine-adopt.mjs:73:36
-   const isMarkedMerge = (content) => /^<<<<<<</m.test(content) && /^>>>>>>>/m.test(content);
+   const isMarkedMerge = (content) => /<<<<<<</m.test(content) && /^>>>>>>>/m.test(content);

[Survived] LogicalOperator
scripts/lib/engine-adopt.mjs:73:36
-   const isMarkedMerge = (content) => /^<<<<<<</m.test(content) && /^>>>>>>>/m.test(content);
+   const isMarkedMerge = (content) => /^<<<<<<</m.test(content) || /^>>>>>>>/m.test(content);

[Survived] Regex
scripts/lib/engine-adopt.mjs:73:65
-   const isMarkedMerge = (content) => /^<<<<<<</m.test(content) && /^>>>>>>>/m.test(content);
+   const isMarkedMerge = (content) => /^<<<<<<</m.test(content) && />>>>>>>/m.test(content);

[Survived] StringLiteral
scripts/lib/engine-adopt.mjs:83:43
-     const candidate = readFileSync(sidecar, "utf8");
+     const candidate = readFileSync(sidecar, "");

[Survived] LogicalOperator
scripts/lib/engine-adopt.mjs:91:8
-     if ((write !== undefined || deliver !== undefined) && isMarkedMerge(candidate)) {
+     if ((write !== undefined && deliver !== undefined) && isMarkedMerge(candidate)) {

[Survived] ConditionalExpression
scripts/lib/engine-adopt.mjs:91:31
-     if ((write !== undefined || deliver !== undefined) && isMarkedMerge(candidate)) {
+     if ((write !== undefined || false) && isMarkedMerge(candidate)) {

[Survived] ArrayDeclaration
scripts/lib/engine-base-fs.mjs:69:86
-     const onDisk = listFilesUnderRoots(brainDir, globRoots(manifest?.regimes?.merge ?? [])).filter(
+     const onDisk = listFilesUnderRoots(brainDir, globRoots(manifest?.regimes?.merge ?? ["Stryker was here"])).filter(

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:51:3
-     ` so what is waiting beside it is a marked-up merge of both, not a version anyone should` +
+     `` +
