[Survived] StringLiteral
scripts/adopt-engine-file.mjs:38:3
-     "  take-theirs   the engine's newer version replaces yours (your current one is saved first)\n" +
+     "" +

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:40:3
-     "  combine       adopt the combination written in --from, keeping the engine's version as the ancestor";
+     "";

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:39:3
-     "  keep-mine     your version stands, and the engine stops asking about it until the next release\n" +
+     "" +

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:48:3
-     ` brain never received an engine version of that file to compare against.`;
+     ``;

[Survived] ArrowFunction
scripts/adopt-engine-file.mjs:53:16
-     "keep-mine": (rel) =>
-       `Done: ${rel} stays exactly as you wrote it. The engine will not raise it again until its next release.`,
+     "keep-mine": () => undefined,

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:54:5
-       `Done: ${rel} stays exactly as you wrote it. The engine will not raise it again until its next release.`,
+       ``,

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:56:5
-       `Done: ${rel} now holds the combination, and the engine's version is recorded as its ancestor` +
+       `` +

[Survived] ArrowFunction
scripts/adopt-engine-file.mjs:55:12
-     combine: (rel) =>
-       `Done: ${rel} now holds the combination, and the engine's version is recorded as its ancestor` +
-       ` — so your next update merges from there instead of asking again.`,
+     combine: () => undefined,

[Survived] StringLiteral
scripts/adopt-engine-file.mjs:57:5
-       ` — so your next update merges from there instead of asking again.`,
+       ``,

[Survived] ConditionalExpression
scripts/adopt-engine-file.mjs:63:7
-     if (at === -1) return { path: undefined };
+     if (false) return { path: undefined };

[Survived] UnaryOperator
scripts/adopt-engine-file.mjs:63:14
-     if (at === -1) return { path: undefined };
+     if (at === +1) return { path: undefined };

[Survived] ObjectLiteral
scripts/adopt-engine-file.mjs:63:25
-     if (at === -1) return { path: undefined };
+     if (at === -1) return {};

[Survived] ArrowFunction
scripts/adopt-engine-file.mjs:73:12
-       adopt: (args) => adoptCandidate({ ...args, git: buildGit(brainDir) }),
+       adopt: () => undefined,

[Survived] ObjectLiteral
scripts/adopt-engine-file.mjs:73:37
-       adopt: (args) => adoptCandidate({ ...args, git: buildGit(brainDir) }),
+       adopt: (args) => adoptCandidate({}),

[Survived] ArrowFunction
scripts/adopt-engine-file.mjs:74:10
-       log: (m) => console.log(m),
+       log: () => undefined,

[Survived] ConditionalExpression
scripts/adopt-engine-file.mjs:81:7
-     if (!rel || !decision) {
+     if (false) {

[Survived] LogicalOperator
scripts/adopt-engine-file.mjs:81:7
-     if (!rel || !decision) {
+     if (!rel && !decision) {

[Survived] BlockStatement
scripts/adopt-engine-file.mjs:81:26
-     if (!rel || !decision) {
-       deps.error(USAGE);
-       return 2;
-     }
+     if (!rel || !decision) {}
