[Survived] OptionalChaining
scripts/lib/author-identities.mjs:194:47
-   const endorsersOf = (entry) => (Array.isArray(entry?.confirmedBy) ? entry.confirmedBy : []);
+   const endorsersOf = (entry) => (Array.isArray(entry.confirmedBy) ? entry.confirmedBy : []);

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:228:76
-     const identities = Array.isArray(state?.identities) ? state.identities : [];
+     const identities = Array.isArray(state?.identities) ? state.identities : ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:262:57
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:70:56
-       const aka = Array.isArray(entry.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry.aka) ? entry.aka : ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:172:43
-       (Array.isArray(distinct) ? distinct : []).map((name) => (typeof name === "string" ? slugSafe(name) : null)),
+       (Array.isArray(distinct) ? distinct : ["Stryker was here"]).map((name) => (typeof name === "string" ? slugSafe(name) : null)),

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:231:56
-   export function fusionElsewhereQuestion({ identities = [], me } = {}) {
+   export function fusionElsewhereQuestion({ identities = ["Stryker was here"], me } = {}) {

[Survived] OptionalChaining
scripts/lib/brain-author.mjs:255:16
-     const raw = [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])];
+     const raw = [entry.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])];

[Survived] OptionalChaining
scripts/lib/brain-author.mjs:255:47
-     const raw = [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])];
+     const raw = [entry?.name, ...(Array.isArray(entry.aka) ? entry.aka : [])];

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:255:73
-     const raw = [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])];
+     const raw = [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"])];
