[Survived] MethodExpression
scripts/lib/brain-author.mjs:52:17
-       people.push(raw.trim().replace(/\s+/g, " "));
+       people.push(raw.replace(/\s+/g, " "));

[Survived] Regex
scripts/lib/brain-author.mjs:52:36
-       people.push(raw.trim().replace(/\s+/g, " "));
+       people.push(raw.trim().replace(/\s/g, " "));

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:61:55
-     return distinctAuthors([...authors, ...(me ? [me] : [])]);
+     return distinctAuthors([...authors, ...(me ? [me] : ["Stryker was here"])]);

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:73:22
-     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.trim().replace(/\s+/g, " ")}.` : "";
+     const here = me && true ? ` At this keyboard: ${me.trim().replace(/\s+/g, " ")}.` : "";

[Survived] Regex
scripts/lib/brain-author.mjs:73:86
-     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.trim().replace(/\s+/g, " ")}.` : "";
+     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.trim().replace(/\s/g, " ")}.` : "";

[Survived] MethodExpression
scripts/lib/brain-author.mjs:73:68
-     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.trim().replace(/\s+/g, " ")}.` : "";
+     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.replace(/\s+/g, " ")}.` : "";

[Survived] StringLiteral
scripts/lib/brain-author.mjs:73:104
-     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.trim().replace(/\s+/g, " ")}.` : "";
+     const here = me && slugSafe(me) !== null ? ` At this keyboard: ${me.trim().replace(/\s+/g, " ")}.` : "Stryker was here!";

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:80:61
-       `More than one person writes here (${named.join(", ")}${rest > 0 ? ` +${rest}` : ""}).${here} ` +
+       `More than one person writes here (${named.join(", ")}${true ? ` +${rest}` : ""}).${here} ` +

[Survived] EqualityOperator
scripts/lib/brain-author.mjs:80:61
-       `More than one person writes here (${named.join(", ")}${rest > 0 ? ` +${rest}` : ""}).${here} ` +
+       `More than one person writes here (${named.join(", ")}${rest >= 0 ? ` +${rest}` : ""}).${here} ` +

[Survived] StringLiteral
scripts/lib/brain-author.mjs:80:86
-       `More than one person writes here (${named.join(", ")}${rest > 0 ? ` +${rest}` : ""}).${here} ` +
+       `More than one person writes here (${named.join(", ")}${rest > 0 ? ` +${rest}` : "Stryker was here!"}).${here} ` +

[Survived] StringLiteral
scripts/lib/brain-author.mjs:82:5
-       `never compose it. Silent background.`
+       ``

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:110:17
-     const parts = [];
+     const parts = ["Stryker was here"];

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:111:7
-     if (reminder) parts.push(`[authors] ${reminder}`);
+     if (true) parts.push(`[authors] ${reminder}`);

[Survived] StringLiteral
scripts/lib/brain-author.mjs:114:88
-       hookSpecificOutput: { hookEventName: "SessionStart", additionalContext: parts.join("\n\n") },
+       hookSpecificOutput: { hookEventName: "SessionStart", additionalContext: parts.join("") },

[Survived] MethodExpression
scripts/lib/brain-author.mjs:115:20
-       systemMessage: [reminder, announcement].filter(Boolean).join("\n"),
+       systemMessage: [reminder, announcement].join("\n"),

[Survived] StringLiteral
scripts/lib/brain-author.mjs:115:66
-       systemMessage: [reminder, announcement].filter(Boolean).join("\n"),
+       systemMessage: [reminder, announcement].filter(Boolean).join(""),

[Survived] StringLiteral
scripts/lib/dated-note-path.mjs:57:35
-     const mine = slugSafe(author ?? "");
+     const mine = slugSafe(author ?? "Stryker was here!");

[Survived] Regex
scripts/dated-note-path.mjs:38:17
-   const ISO_DAY = /^\d{4}-\d{2}-\d{2}$/;
+   const ISO_DAY = /\d{4}-\d{2}-\d{2}$/;

[Survived] Regex
scripts/dated-note-path.mjs:38:17
-   const ISO_DAY = /^\d{4}-\d{2}-\d{2}$/;
+   const ISO_DAY = /^\d{4}-\d{2}-\d{2}/;

[Survived] StringLiteral
scripts/dated-note-path.mjs:36:3
-     `       --folder may carry a universe (acme/daily); --author defaults to git config user.name.`;
+     ``;

[Survived] StringLiteral
scripts/dated-note-path.mjs:35:3
-     `usage: dated-note-path.mjs --folder <daily|briefings|…> --date <YYYY-MM-DD> [--author "<name>"]\n` +
+     `` +

[Survived] ArrowFunction
scripts/dated-note-path.mjs:46:11
-     author: () => localAuthorName((args) => defaultGit(["-C", process.cwd(), ...args])),
+     author: () => undefined,

[Survived] ArrowFunction
scripts/dated-note-path.mjs:46:33
-     author: () => localAuthorName((args) => defaultGit(["-C", process.cwd(), ...args])),
+     author: () => localAuthorName(() => undefined),

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:46:54
-     author: () => localAuthorName((args) => defaultGit(["-C", process.cwd(), ...args])),
+     author: () => localAuthorName((args) => defaultGit([])),

[Survived] StringLiteral
scripts/dated-note-path.mjs:46:55
-     author: () => localAuthorName((args) => defaultGit(["-C", process.cwd(), ...args])),
+     author: () => localAuthorName((args) => defaultGit(["", process.cwd(), ...args])),

[Survived] ArrowFunction
scripts/dated-note-path.mjs:48:10
-     error: (...a) => console.error(...a),
+     error: () => undefined,

[Survived] ConditionalExpression
scripts/dated-note-path.mjs:55:9
-       if (!name) throw new Error(`unexpected argument ${JSON.stringify(argv[i])}.\n${USAGE}`);
+       if (false) throw new Error(`unexpected argument ${JSON.stringify(argv[i])}.\n${USAGE}`);

[Survived] StringLiteral
scripts/dated-note-path.mjs:55:32
-       if (!name) throw new Error(`unexpected argument ${JSON.stringify(argv[i])}.\n${USAGE}`);
+       if (!name) throw new Error(``);

[Survived] ConditionalExpression
scripts/dated-note-path.mjs:56:9
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (false) throw new Error(`--${name} needs a value.\n${USAGE}`);

[Survived] EqualityOperator
scripts/dated-note-path.mjs:56:9
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (i + 1 > argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);

[Survived] ArithmeticOperator
scripts/dated-note-path.mjs:56:9
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (i - 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);

[Survived] StringLiteral
scripts/dated-note-path.mjs:56:47
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (i + 1 >= argv.length) throw new Error(``);

[Survived] StringLiteral
scripts/dated-note-path.mjs:59:38
-     if (!flags.folder) throw new Error(`--folder is required.\n${USAGE}`);
+     if (!flags.folder) throw new Error(``);

[Survived] ConditionalExpression
scripts/dated-note-path.mjs:60:7
-     if (!flags.date) throw new Error(`--date is required.\n${USAGE}`);
+     if (false) throw new Error(`--date is required.\n${USAGE}`);

[Survived] StringLiteral
scripts/dated-note-path.mjs:60:36
-     if (!flags.date) throw new Error(`--date is required.\n${USAGE}`);
+     if (!flags.date) throw new Error(``);

[Survived] StringLiteral
scripts/dated-note-path.mjs:62:21
-       throw new Error(`--date must be a day, spelled YYYY-MM-DD (got ${JSON.stringify(flags.date)}).\n${USAGE}`);
+       throw new Error(``);

[Survived] StringLiteral
scripts/dated-note-path.mjs:73:16
-       deps.error(`✗ ${err.message}`);
+       deps.error(``);

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:80:15
-     let notes = [];
+     let notes = ["Stryker was here"];

[Survived] BlockStatement
scripts/dated-note-path.mjs:83:11
-     } catch {
-       notes = [];
-     }
+     } catch {}

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:84:13
-       notes = [];
+       notes = ["Stryker was here"];

[Survived] StringLiteral
scripts/dated-note-path.mjs:90:7
-         `note: this machine's git has no user.name, so there is no author to stamp and no file of ` +
+         `` +

[Survived] StringLiteral
scripts/dated-note-path.mjs:91:9
-           `your own to give you. Set it (git config user.name "…") if two people write in this brain.`,
+           ``,

[Survived] ConditionalExpression
scripts/dated-note-path.mjs:100:36
-       const base = notes.find((n) => n.path === `${flags.folder}/${flags.date}.md`);
+       const base = notes.find((n) => true);

[Survived] StringLiteral
scripts/dated-note-path.mjs:103:9
-           `one is yours — both are kept, and neither is merged into the other.`,
+           ``,

[Survived] BlockStatement
scripts/session-authors.mjs:65:11
-     } catch {
-       return 0; // fail-open: session start belongs to the owner, not to this hook.
-     }
+     } catch {}

[Survived] StringLiteral
scripts/session-authors.mjs:76:69
-     const brainDir = resolve(dirname(fileURLToPath(import.meta.url)), "..");
+     const brainDir = resolve(dirname(fileURLToPath(import.meta.url)), "");

[Survived] StringLiteral
scripts/session-authors.mjs:85:36
-         if (!log.ok) throw new Error("no git history");
+         if (!log.ok) throw new Error("");

[Survived] ArrowFunction
scripts/session-authors.mjs:88:9
-       me: () => localAuthorName(git),
+       me: () => undefined,

[Survived] MethodExpression
scripts/session-authors.mjs:91:16
-           return readFileSync(marker, "utf8").trim() !== "";
+           return readFileSync(marker, "utf8") !== "";

[Survived] StringLiteral
scripts/session-authors.mjs:91:56
-           return readFileSync(marker, "utf8").trim() !== "";
+           return readFileSync(marker, "utf8").trim() !== "Stryker was here!";

[Survived] BlockStatement
scripts/session-authors.mjs:92:15
-         } catch {
-           return false; // never announced, or unreadable → say it (at worst, twice).
-         }
+         } catch {}

[Survived] BooleanLiteral
scripts/session-authors.mjs:97:47
-         mkdirSync(dirname(marker), { recursive: true });
+         mkdirSync(dirname(marker), { recursive: false });

[Survived] ObjectLiteral
scripts/session-authors.mjs:97:34
-         mkdirSync(dirname(marker), { recursive: true });
+         mkdirSync(dirname(marker), {});
