[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:86:13
-       notes = [];
+       notes = ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/file-back-note.mjs:156:21
-     let heldSources = [];
+     let heldSources = ["Stryker was here"];

[Survived] BlockStatement
scripts/file-back-note.mjs:162:11
-     } catch {
-       heldSources = [];
-     }
+     } catch {}

[Survived] Regex
scripts/file-back-note.mjs:182:57
-         const firstName = String(spec.title).trim().split(/\s+/)[0];
+         const firstName = String(spec.title).trim().split(/\s/)[0];

[Survived] StringLiteral
scripts/session-authors.mjs:88:36
-         if (!log.ok) throw new Error("no git history");
+         if (!log.ok) throw new Error("");

[Survived] BlockStatement
scripts/session-authors.mjs:98:15
-         } catch {
-           return false; // never announced, or unreadable → say it (at worst, twice).
-         }
+         } catch {}
