[Survived] Regex
scripts/lib/declared-spellings.mjs:129:3
-     /^>.*$/gm, //                      a blockquote is someone else's words
+     /^>.*/gm, //                      a blockquote is someone else's words

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:136:17
-     const spans = [];
+     const spans = ["Stryker was here"];
