[Survived] OptionalChaining
scripts/lib/delivered-links.mjs:115:67
-         dead.push({ file, target: null, resolved: null, unreadable: e?.message ?? String(e) });
+         dead.push({ file, target: null, resolved: null, unreadable: e.message ?? String(e) });

[Survived] ConditionalExpression
scripts/lib/delivered-links.mjs:120:11
-         if (resolved === null) continue;
+         if (false) continue;
