[Survived] Regex
scripts/lib/delivered-links.mjs:88:29
-       target = target.replace(/\s+("[^"]*"|'[^']*')\s*$/, "").trim();
+       target = target.replace(/\s("[^"]*"|'[^']*')\s*$/, "").trim();

[Survived] Regex
scripts/lib/delivered-links.mjs:88:29
-       target = target.replace(/\s+("[^"]*"|'[^']*')\s*$/, "").trim();
+       target = target.replace(/\s+("[^"]*"|'[^']*')\s*/, "").trim();
