[Survived] LogicalOperator
scripts/lib/engine-adopt.mjs:95:55
-         provenance: reseedProvenance({ priorProvenance: manifest.provenance ?? {}, manifest, deliveredFileMap }),
+         provenance: reseedProvenance({ priorProvenance: manifest.provenance && {}, manifest, deliveredFileMap }),

[Survived] LogicalOperator
scripts/lib/engine-adopt.mjs:97:24
-           priorBaseRefs: manifest.baseRefs ?? {},
+           priorBaseRefs: manifest.baseRefs && {},
