[Survived] StringLiteral
scripts/lib/engine-adopt.mjs:66:47
-     const candidate = readFileSync(sidecarPath, "utf8");
+     const candidate = readFileSync(sidecarPath, "");

[Survived] StringLiteral
scripts/lib/engine-adopt.mjs:86:58
-     const manifest = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const manifest = JSON.parse(readFileSync(manifestPath, ""));
