[Survived] ConditionalExpression
scripts/lib/engine-ancestor.mjs:45:11
-         if (!recorded) return null;
+         if (false) return null;

[Survived] EqualityOperator
scripts/lib/engine-ancestor.mjs:68:22
-       .sort((a, b) => (a.rel < b.rel ? -1 : 1));
+       .sort((a, b) => (a.rel <= b.rel ? -1 : 1));
