[Survived] LogicalOperator
scripts/lib/engine-answers.mjs:35:3
-     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length > 0;
+     typeof entry === "object" || entry !== null && typeof entry.at === "string" && entry.at.length > 0;

[Survived] ConditionalExpression
scripts/lib/engine-answers.mjs:35:3
-     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length > 0;
+     true && entry !== null && typeof entry.at === "string" && entry.at.length > 0;

[Survived] ConditionalExpression
scripts/lib/engine-answers.mjs:35:3
-     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length > 0;
+     true && typeof entry.at === "string" && entry.at.length > 0;

[Survived] ConditionalExpression
scripts/lib/engine-answers.mjs:35:32
-     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length > 0;
+     typeof entry === "object" && true && typeof entry.at === "string" && entry.at.length > 0;

[Survived] EqualityOperator
scripts/lib/engine-answers.mjs:35:82
-     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length > 0;
+     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length >= 0;

[Survived] ConditionalExpression
scripts/lib/engine-answers.mjs:35:82
-     typeof entry === "object" && entry !== null && typeof entry.at === "string" && entry.at.length > 0;
+     typeof entry === "object" && entry !== null && typeof entry.at === "string" && true;

[Survived] BlockStatement
scripts/lib/engine-answers.mjs:43:11
-     } catch {
-       return {};
-     }
+     } catch {}

[Survived] StringLiteral
scripts/lib/engine-answers.mjs:42:36
-       parsed = JSON.parse(content ?? "");
+       parsed = JSON.parse(content ?? "Stryker was here!");

[Survived] ConditionalExpression
scripts/lib/engine-answers.mjs:46:7
-     if (typeof parsed !== "object" || parsed === null || Array.isArray(parsed)) return {};
+     if (false || parsed === null || Array.isArray(parsed)) return {};

[Survived] OptionalChaining
scripts/lib/engine-answers.mjs:53:10
-     return answers?.[rel]?.at === ref;
+     return answers[rel]?.at === ref;

[Survived] ConditionalExpression
scripts/lib/engine-answers.mjs:71:7
-     if (!existsSync(path)) return {};
+     if (false) return {};

[Survived] StringLiteral
scripts/lib/engine-answers.mjs:73:44
-       return parseAnswers(readFileSync(path, "utf8"));
+       return parseAnswers(readFileSync(path, ""));

[Survived] BlockStatement
scripts/lib/engine-answers.mjs:74:11
-     } catch {
-       return {};
-     }
+     } catch {}
