[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:139:52
-     const retireSkills = (targetManifest?.retired ?? []).filter((entry) => ENGINE_SKILL.test(entry));
+     const retireSkills = (targetManifest?.retired ?? ["Stryker was here"]).filter((entry) => ENGINE_SKILL.test(entry));

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:149:38
-       mergeDoctrine: (regimes.merge ?? []).filter((entry) => ENGINE_DOCTRINE.test(entry)),
+       mergeDoctrine: (regimes.merge ?? ["Stryker was here"]).filter((entry) => ENGINE_DOCTRINE.test(entry)),
