[Survived] Regex
scripts/lib/engine-apply-plan.mjs:108:24
-     return entry.replace(/\/\*\*?$/, "");
+     return entry.replace(/\/\*\*?/, "");

[Survived] Regex
scripts/lib/engine-apply-plan.mjs:108:24
-     return entry.replace(/\/\*\*?$/, "");
+     return entry.replace(/\/\*\*$/, "");

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:135:43
-       mergeScripts: scrub((regimes.merge ?? []).filter((entry) => ENGINE_SCRIPT.test(entry))),
+       mergeScripts: scrub((regimes.merge ?? ["Stryker was here"]).filter((entry) => ENGINE_SCRIPT.test(entry))),

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:140:38
-       mergeDoctrine: (regimes.merge ?? []).filter((entry) => ENGINE_DOCTRINE.test(entry)),
+       mergeDoctrine: (regimes.merge ?? ["Stryker was here"]).filter((entry) => ENGINE_DOCTRINE.test(entry)),

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:151:47
-       retireSkills: (targetManifest?.retired ?? []).filter((entry) => ENGINE_SKILL.test(entry)),
+       retireSkills: (targetManifest?.retired ?? ["Stryker was here"]).filter((entry) => ENGINE_SKILL.test(entry)),
