[Survived] Regex
scripts/lib/engine-apply-plan.mjs:64:24
-     return entry.replace(/\/\*\*?$/, "");
+     return entry.replace(/\/\*\*?/, "");

[Survived] Regex
scripts/lib/engine-apply-plan.mjs:64:24
-     return entry.replace(/\/\*\*?$/, "");
+     return entry.replace(/\/\*\*$/, "");

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:85:43
-       mergeScripts: scrub((regimes.merge ?? []).filter((entry) => ENGINE_SCRIPT.test(entry))),
+       mergeScripts: scrub((regimes.merge ?? ["Stryker was here"]).filter((entry) => ENGINE_SCRIPT.test(entry))),

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:90:38
-       mergeDoctrine: (regimes.merge ?? []).filter((entry) => ENGINE_DOCTRINE.test(entry)),
+       mergeDoctrine: (regimes.merge ?? ["Stryker was here"]).filter((entry) => ENGINE_DOCTRINE.test(entry)),

[Survived] ArrayDeclaration
scripts/lib/engine-apply-plan.mjs:91:38
-       installSkills: (regimes.merge ?? []).filter((entry) => ENGINE_SKILL.test(entry)),
+       installSkills: (regimes.merge ?? ["Stryker was here"]).filter((entry) => ENGINE_SKILL.test(entry)),
