[Survived] MethodExpression
scripts/lib/engine-base-fs.mjs:95:13
-       seeded: seeds.map((seed) => seed.rel).sort(),
+       seeded: seeds.map(seed => seed.rel),

[Survived] ArrayDeclaration
scripts/lib/engine-base-fs.mjs:113:12
-       return [];
+       return ["Stryker was here"];
