[Survived] EqualityOperator
scripts/lib/engine-base-fs.mjs:92:29
-     const byPath = (a, b) => (a.rel < b.rel ? -1 : 1);
+     const byPath = (a, b) => (a.rel <= b.rel ? -1 : 1);

[Survived] StringLiteral
scripts/lib/engine-base-fs.mjs:111:80
-       manifest = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
+       manifest = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), ""));

[Survived] BlockStatement
scripts/lib/engine-base-fs.mjs:112:11
-     } catch {
-       return [];
-     }
+     } catch {}
