[Survived] ArrayDeclaration
scripts/lib/engine-base-fs.mjs:65:111
-     const rels = selectMergeFiles(manifest, listFilesUnderRoots(brainDir, globRoots(manifest?.regimes?.merge ?? [])));
+     const rels = selectMergeFiles(manifest, listFilesUnderRoots(brainDir, globRoots(manifest?.regimes?.merge ?? ["Stryker was here"])));

[Survived] EqualityOperator
scripts/lib/engine-base-fs.mjs:118:29
-     const byPath = (a, b) => (a.rel < b.rel ? -1 : 1);
+     const byPath = (a, b) => (a.rel <= b.rel ? -1 : 1);

[Survived] StringLiteral
scripts/lib/engine-base-fs.mjs:137:80
-       manifest = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
+       manifest = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), ""));
