[Survived] OptionalChaining
scripts/lib/engine-divergence.mjs:36:22
-     const provenance = manifest?.provenance ?? {};
+     const provenance = manifest.provenance ?? {};

[Survived] OptionalChaining
scripts/lib/engine-divergence.mjs:37:20
-     const baseRefs = manifest?.baseRefs ?? {};
+     const baseRefs = manifest.baseRefs ?? {};

[Survived] ConditionalExpression
scripts/lib/engine-divergence.mjs:52:31
-     return held.sort((a, b) => (a.rel < b.rel ? -1 : 1));
+     return held.sort((a, b) => (true ? -1 : 1));

[Survived] EqualityOperator
scripts/lib/engine-divergence.mjs:52:31
-     return held.sort((a, b) => (a.rel < b.rel ? -1 : 1));
+     return held.sort((a, b) => (a.rel <= b.rel ? -1 : 1));
