[Survived] Regex
scripts/lib/engine-fingerprint-table.mjs:34:19
-   const LOCALIZED = /^templates\/([^/]+)\/(.+)$/;
+   const LOCALIZED = /^templates\/([^/]+)\/(.+)/;

[Survived] EqualityOperator
scripts/lib/engine-heal.mjs:53:22
-       .sort((a, b) => (a.rel < b.rel ? -1 : 1));
+       .sort((a, b) => (a.rel <= b.rel ? -1 : 1));

[Survived] ArrayDeclaration
scripts/lib/engine-source.mjs:48:44
-     const tombstones = (manifest?.retired ?? []).map(globToRegExp);
+     const tombstones = (manifest?.retired ?? ["Stryker was here"]).map(globToRegExp);

[Survived] ObjectLiteral
scripts/lib/reconcile-brain.mjs:256:64
-     const { removed: workflowsRetired } = retireShippedWorkflows({ brainDir, sourceDir });
+     const { removed: workflowsRetired } = retireShippedWorkflows({});

[Survived] Regex
scripts/lib/reconcile-brain.mjs:280:40
-       const skillDir = skillGlob.replace(/\/\*\*?$/, ""); // ".../local-mirror/**" → ".../local-mirror"
+       const skillDir = skillGlob.replace(/\/\*\*?/, ""); // ".../local-mirror/**" → ".../local-mirror"

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:285:67
-           installedFileMap[rel] = readFileSync(join(brainDir, rel), "utf8");
+           installedFileMap[rel] = readFileSync(join(brainDir, rel), "");

[Survived] StringLiteral
scripts/lib/staged-skills.mjs:44:102
-       base[SKILLS_PREFIX + rel] = fingerprint(readFileSync(join(stagingDir, rel.split("/").join(sep)), "utf8"));
+       base[SKILLS_PREFIX + rel] = fingerprint(readFileSync(join(stagingDir, rel.split("/").join(sep)), ""));
