[Survived] Regex
scripts/lib/engine-fingerprint-table.mjs:31:19
-   const LOCALIZED = /^templates\/([^/]+)\/(.+)$/;
+   const LOCALIZED = /^templates\/([^/]+)\/(.+)/;

[Survived] EqualityOperator
scripts/lib/engine-fingerprint-table.mjs:61:24
-   const cmp = (a, b) => (a < b ? -1 : 1);
+   const cmp = (a, b) => (a <= b ? -1 : 1);
