[Survived] Regex
scripts/lib/engine-script-coupling.mjs:27:22
-   const IS_SPECIFIER = /(?:^|[^\w$])(?:from|import\()$/;
+   const IS_SPECIFIER = /(?:[^\w$])(?:from|import\()$/;

[Survived] Regex
scripts/lib/engine-script-coupling.mjs:35:56
-       const before = clean.slice(0, match.index).replace(/\s+$/, "");
+       const before = clean.slice(0, match.index).replace(/\s$/, "");
