[Survived] StringLiteral
scripts/lib/engine-source.mjs:118:58
-     const manifest = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const manifest = JSON.parse(readFileSync(manifestPath, ""));

[Survived] StringLiteral
scripts/lib/engine-source.mjs:122:69
-       mergeFiles.map((rel) => [rel, readFileSync(join(brainDir, rel), "utf8")]),
+       mergeFiles.map((rel) => [rel, readFileSync(join(brainDir, rel), "")]),
