[Survived] ArrayDeclaration
scripts/lib/engine-source.mjs:34:49
-     const matchers = (manifest?.regimes?.merge ?? []).map(globToRegExp);
+     const matchers = (manifest?.regimes?.merge ?? ["Stryker was here"]).map(globToRegExp);

[Survived] ArrayDeclaration
scripts/lib/engine-source.mjs:35:44
-     const tombstones = (manifest?.retired ?? []).map(globToRegExp);
+     const tombstones = (manifest?.retired ?? ["Stryker was here"]).map(globToRegExp);

[Survived] OptionalChaining
scripts/lib/engine-source.mjs:134:14
-       regimes: target?.regimes ?? local?.regimes,
+       regimes: target.regimes ?? local?.regimes,

[Survived] OptionalChaining
scripts/lib/engine-source.mjs:134:33
-       regimes: target?.regimes ?? local?.regimes,
+       regimes: target?.regimes ?? local.regimes,

[Survived] OptionalChaining
scripts/lib/engine-source.mjs:135:33
-       retired: target?.retired ?? local?.retired,
+       retired: target?.retired ?? local.retired,

[Survived] OptionalChaining
scripts/lib/engine-source.mjs:135:14
-       retired: target?.retired ?? local?.retired,
+       retired: target.retired ?? local?.retired,

[Survived] StringLiteral
scripts/lib/engine-source.mjs:147:58
-     const manifest = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const manifest = JSON.parse(readFileSync(manifestPath, ""));

[Survived] StringLiteral
scripts/lib/engine-source.mjs:151:69
-       mergeFiles.map((rel) => [rel, readFileSync(join(brainDir, rel), "utf8")]),
+       mergeFiles.map((rel) => [rel, readFileSync(join(brainDir, rel), "")]),
