[Survived] ConditionalExpression
scripts/lib/engine-write-guard.mjs:57:7
-     if (rel === "" || rel.startsWith("..") || isAbsolute(rel)) return null;
+     if (false || rel.startsWith("..") || isAbsolute(rel)) return null;

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:57:15
-     if (rel === "" || rel.startsWith("..") || isAbsolute(rel)) return null;
+     if (rel === "Stryker was here!" || rel.startsWith("..") || isAbsolute(rel)) return null;

[Survived] ArrayDeclaration
scripts/lib/engine-write-guard.mjs:65:42
-       const matchers = (regimes[regime] ?? []).map(globToRegExp);
+       const matchers = (regimes[regime] ?? ["Stryker was here"]).map(globToRegExp);

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:78:5
-       `update three-way-merges it with the new version — a clash is reported to you, never written. ` +
+       `` +

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:80:5
-       `and a skill of your own costs nothing to carry.`,
+       ``,

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:83:5
-       `with the new version, without a word, and your change will be gone. If you mean to change how ` +
+       `` +

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:85:5
-       `update touches them.`,
+       ``,

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:89:5
-       `is the layer built for that — a launcher is machinery, not doctrine.`,
+       ``,

[Survived] StringLiteral
scripts/lib/engine-write-guard.mjs:123:9
-           `replaced by the engine's version, with this record as the evidence that nothing was wrong.`,
+           ``,
