[Survived] StringLiteral
scripts/file-back-note.mjs:83:58
-         { existsSync, readFileSync: (p) => readFileSync(p, "utf-8") },
+         { existsSync, readFileSync: (p) => readFileSync(p, "") },

[Survived] StringLiteral
scripts/file-back-note.mjs:86:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] Regex
scripts/file-back-note.mjs:184:57
-         const firstName = String(spec.title).trim().split(/\s+/)[0];
+         const firstName = String(spec.title).trim().split(/\s/)[0];
