[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:199:25
-     const step = undone ? "redo the merge" : "finish the merge";
+     const step = undone ? "" : "finish the merge";

[Survived] ArrowFunction
scripts/lib/remote-arrivals.mjs:217:63
-   export function remoteArrivalsDirective(trace, readUniverse = () => null) {
+   export function remoteArrivalsDirective(trace, readUniverse = () => undefined) {

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:244:46
-           return JSON.parse(readFileSync(path, "utf8"));
+           return JSON.parse(readFileSync(path, ""));

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:253:69
-         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "utf8");
+         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "");

[Survived] ObjectLiteral
scripts/lib/remote-arrivals.mjs:257:25
-           rmSync(staging, { force: true });
+           rmSync(staging, {});

[Survived] BooleanLiteral
scripts/lib/remote-arrivals.mjs:257:34
-           rmSync(staging, { force: true });
+           rmSync(staging, { force: false });

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:58:31
-     const ref = (upstreamRef ?? "").trim();
+     const ref = (upstreamRef ?? "Stryker was here!").trim();

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:83:35
-     for (const line of lines(out ?? "")) {
+     for (const line of lines(out ?? "Stryker was here!")) {

[Survived] ConditionalExpression
scripts/lib/remote-sync.mjs:85:9
-       if (cut > 0 && line.slice(cut).trim() === wanted) return line.slice(0, cut);
+       if (true && line.slice(cut).trim() === wanted) return line.slice(0, cut);

[Survived] EqualityOperator
scripts/lib/remote-sync.mjs:85:9
-       if (cut > 0 && line.slice(cut).trim() === wanted) return line.slice(0, cut);
+       if (cut >= 0 && line.slice(cut).trim() === wanted) return line.slice(0, cut);

[Survived] LogicalOperator
scripts/lib/remote-sync.mjs:158:7
-     if (!start.ok || base === "") return "failed";
+     if (!start.ok && base === "") return "failed";

[Survived] ConditionalExpression
scripts/lib/remote-sync.mjs:158:20
-     if (!start.ok || base === "") return "failed";
+     if (!start.ok || false) return "failed";

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:158:29
-     if (!start.ok || base === "") return "failed";
+     if (!start.ok || base === "Stryker was here!") return "failed";

[Survived] BlockStatement
scripts/lib/remote-sync.mjs:204:11
-     } catch {
-       // A registry that cannot be read costs the fusion, never the tick: one banner too
-       // many is a nuisance, a sync that stops is a brain out of step.
-       confirmed = [];
-     }
+     } catch {}

[Survived] ArrayDeclaration
scripts/lib/remote-sync.mjs:207:17
-       confirmed = [];
+       confirmed = ["Stryker was here"];

[Survived] Regex
scripts/lib/yaml-scalar.mjs:32:21
-   const IS_NOT_TEXT = /^(?:null|~|true|false|yes|no|on|off)$/i;
+   const IS_NOT_TEXT = /(?:null|~|true|false|yes|no|on|off)$/i;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[^-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\D+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][^-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d)?$|^0[xob][0-9a-fA-F_]+$/;

[Survived] Regex
scripts/lib/yaml-scalar.mjs:33:21
-   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+$/;
+   const IS_A_NUMBER = /^[-+]?(?:\d+(?:\.\d*)?|\.\d+)(?:[eE][-+]?\d+)?$|^0[xob][0-9a-fA-F_]+/;

[Survived] StringLiteral
scripts/dated-note-path.mjs:54:73
-       readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(process.cwd()))
+       readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "") }, vaultRagDir(process.cwd()))

[Survived] BlockStatement
scripts/dated-note-path.mjs:94:11
-     } catch {
-       identities = [];
-     }
+     } catch {}

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:95:18
-       identities = [];
+       identities = ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:109:13
-       notes = [];
+       notes = ["Stryker was here"];
