[Survived] StringLiteral
scripts/lib/ignore-base-settings.mjs:31:3
-     "# The engine's copy of settings.json (same reason as the line above: absolute paths" +
+     "" +

[Survived] MethodExpression
scripts/lib/ignore-base-settings.mjs:55:40
-     const prefix = text === "" ? "" : `${text.endsWith("\n") ? "" : eol}${eol}`;
+     const prefix = text === "" ? "" : `${text.startsWith("\n") ? "" : eol}${eol}`;

[Survived] StringLiteral
scripts/lib/ignore-base-settings.mjs:55:54
-     const prefix = text === "" ? "" : `${text.endsWith("\n") ? "" : eol}${eol}`;
+     const prefix = text === "" ? "" : `${text.endsWith("") ? "" : eol}${eol}`;

[Survived] StringLiteral
scripts/lib/ignore-base-settings.mjs:55:62
-     const prefix = text === "" ? "" : `${text.endsWith("\n") ? "" : eol}${eol}`;
+     const prefix = text === "" ? "" : `${text.endsWith("\n") ? "Stryker was here!" : eol}${eol}`;

[Survived] ConditionalExpression
scripts/lib/ignore-base-settings.mjs:77:7
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (false) return false;

[Survived] LogicalOperator
scripts/lib/ignore-base-settings.mjs:77:7
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if ((entry === "" || entry.startsWith("#")) && entry.startsWith("!")) return false;

[Survived] ConditionalExpression
scripts/lib/ignore-base-settings.mjs:77:7
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (false || entry.startsWith("!")) return false;

[Survived] LogicalOperator
scripts/lib/ignore-base-settings.mjs:77:7
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (entry === "" && entry.startsWith("#") || entry.startsWith("!")) return false;

[Survived] ConditionalExpression
scripts/lib/ignore-base-settings.mjs:77:7
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (false || entry.startsWith("#") || entry.startsWith("!")) return false;

[Survived] StringLiteral
scripts/lib/ignore-base-settings.mjs:77:17
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (entry === "Stryker was here!" || entry.startsWith("#") || entry.startsWith("!")) return false;

[Survived] MethodExpression
scripts/lib/ignore-base-settings.mjs:77:23
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (entry === "" || entry.endsWith("#") || entry.startsWith("!")) return false;

[Survived] MethodExpression
scripts/lib/ignore-base-settings.mjs:77:48
-     if (entry === "" || entry.startsWith("#") || entry.startsWith("!")) return false;
+     if (entry === "" || entry.startsWith("#") || entry.endsWith("!")) return false;

[Survived] Regex
scripts/lib/ignore-base-settings.mjs:81:50
-     const named = entry.replace(/^\//, "").replace(/\/+$/, "");
+     const named = entry.replace(/^\//, "").replace(/\/$/, "");
