[Survived] StringLiteral
scripts/lint-vault.mjs:21:43
-   const toPosix = (p) => p.split("\\").join("/");
+   const toPosix = (p) => p.split("\\").join("");

[Survived] ArrowFunction
scripts/lint-vault.mjs:25:8
-     cwd: () => process.cwd(),
+     cwd: () => undefined,

[Survived] ArrowFunction
scripts/lint-vault.mjs:28:10
-     error: (...a) => console.error(...a),
+     error: () => undefined,
