[Survived] Regex
scripts/lib/note-parse.mjs:23:27
-     const match = raw.match(/^---\r?\n([\s\S]*?)\r?\n---\r?\n?([\s\S]*)$/);
+     const match = raw.match(/^---\r?\n([\s\S]*?)\r?\n---\r?\n?([\s\S]*)/);

[Survived] Regex
scripts/lib/note-parse.mjs:23:27
-     const match = raw.match(/^---\r?\n([\s\S]*?)\r?\n---\r?\n?([\s\S]*)$/);
+     const match = raw.match(/---\r?\n([\s\S]*?)\r?\n---\r?\n?([\s\S]*)$/);

[Survived] Regex
scripts/lib/note-parse.mjs:23:27
-     const match = raw.match(/^---\r?\n([\s\S]*?)\r?\n---\r?\n?([\s\S]*)$/);
+     const match = raw.match(/^---\r?\n([\s\S]*?)\r?\n---\r?\n([\s\S]*)$/);

[Survived] Regex
scripts/lib/note-parse.mjs:27:27
-       const kv = line.match(/^([A-Za-z0-9_-]+):\s*(.*)$/);
+       const kv = line.match(/^([A-Za-z0-9_-]+):\s*(.*)/);

[Survived] Regex
scripts/lib/note-parse.mjs:27:27
-       const kv = line.match(/^([A-Za-z0-9_-]+):\s*(.*)$/);
+       const kv = line.match(/^([A-Za-z0-9_-]+):\s(.*)$/);

[Survived] Regex
scripts/lib/note-parse.mjs:30:39
-       const inlineList = rawValue.match(/^\[(.*)\]$/);
+       const inlineList = rawValue.match(/\[(.*)\]$/);

[Survived] Regex
scripts/lib/note-parse.mjs:30:39
-       const inlineList = rawValue.match(/^\[(.*)\]$/);
+       const inlineList = rawValue.match(/^\[(.*)\]/);

[Survived] MethodExpression
scripts/lib/note-parse.mjs:32:9
-         ? inlineList[1].split(",").map((v) => v.trim()).filter((v) => v !== "")
+         ? inlineList[1].split(",").map(v => v.trim())

[Survived] ConditionalExpression
scripts/lib/note-parse.mjs:32:69
-         ? inlineList[1].split(",").map((v) => v.trim()).filter((v) => v !== "")
+         ? inlineList[1].split(",").map((v) => v.trim()).filter((v) => true)

[Survived] StringLiteral
scripts/lib/note-parse.mjs:32:75
-         ? inlineList[1].split(",").map((v) => v.trim()).filter((v) => v !== "")
+         ? inlineList[1].split(",").map((v) => v.trim()).filter((v) => v !== "Stryker was here!")

[Survived] MethodExpression
scripts/lib/note-parse.mjs:33:9
-         : rawValue.trim();
+         : rawValue;

[Survived] StringLiteral
scripts/lib/note-persistence.mjs:53:7
-         `Finish the merge first, then commit.`
+         ``
