[Survived] StringLiteral
scripts/lib/owner-facing.mjs:71:3
-     "CLI",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:73:3
-     "YAML",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:72:3
-     "API",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:74:3
-     "URL",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:75:3
-     "OK",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:76:3
-     "ID",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:78:3
-     "PR",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:77:3
-     "AI",
+     "",

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:79:3
-     "UTC",
+     "",

[Survived] Regex
scripts/lib/owner-facing.mjs:85:22
-   const COMMAND_LINE = /\bnode\s+(scripts|rag)\//;
+   const COMMAND_LINE = /\bnode\s(scripts|rag)\//;

[Survived] Regex
scripts/lib/owner-facing.mjs:108:19
-   const PATH_LIKE = /\S*(?:\/|\.[a-z]{2,5}\b)\S*/g;
+   const PATH_LIKE = /\S*(?:\/|\.[a-z]{2,5}\b)\s*/g;

[Survived] ConditionalExpression
scripts/lib/owner-facing.mjs:118:35
-     if (typeof text !== "string" || text === "") return [];
+     if (typeof text !== "string" || false) return [];

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:118:44
-     if (typeof text !== "string" || text === "") return [];
+     if (typeof text !== "string" || text === "Stryker was here!") return [];

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:127:41
-     const prose = text.replace(PATH_LIKE, " ");
+     const prose = text.replace(PATH_LIKE, "");

[Survived] LogicalOperator
scripts/lib/owner-facing.mjs:172:7
-     if (typeof text !== "string" || text === "") return [];
+     if (typeof text !== "string" && text === "") return [];

[Survived] ConditionalExpression
scripts/lib/owner-facing.mjs:172:7
-     if (typeof text !== "string" || text === "") return [];
+     if (false) return [];

[Survived] ConditionalExpression
scripts/lib/owner-facing.mjs:172:7
-     if (typeof text !== "string" || text === "") return [];
+     if (false || text === "") return [];

[Survived] ConditionalExpression
scripts/lib/owner-facing.mjs:172:35
-     if (typeof text !== "string" || text === "") return [];
+     if (typeof text !== "string" || false) return [];

[Survived] StringLiteral
scripts/lib/owner-facing.mjs:172:44
-     if (typeof text !== "string" || text === "") return [];
+     if (typeof text !== "string" || text === "Stryker was here!") return [];
