[Survived] StringLiteral
scripts/lib/owner-facing.mjs:131:41
-     const prose = text.replace(PATH_LIKE, " ");
+     const prose = text.replace(PATH_LIKE, "");

[Survived] ConditionalExpression
scripts/lib/owner-facing.mjs:176:7
-     if (typeof text !== "string") return [];
+     if (false) return [];
