[Survived] Regex
scripts/lib/reconcile-brain.mjs:114:40
-       const skillDir = skillGlob.replace(/\/\*\*?$/, ""); // ".../local-mirror/**" → ".../local-mirror"
+       const skillDir = skillGlob.replace(/\/\*\*?/, ""); // ".../local-mirror/**" → ".../local-mirror"

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:117:105
-         if (copyInto(sourceDir, brainDir, rel)) installedFileMap[rel] = readFileSync(join(brainDir, rel), "utf8");
+         if (copyInto(sourceDir, brainDir, rel)) installedFileMap[rel] = readFileSync(join(brainDir, rel), "");

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:193:60
-       const brainMcp = JSON.parse(readFileSync(brainMcpPath, "utf8"));
+       const brainMcp = JSON.parse(readFileSync(brainMcpPath, ""));

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:227:70
-       const brainSettings = JSON.parse(readFileSync(brainSettingsPath, "utf8"));
+       const brainSettings = JSON.parse(readFileSync(brainSettingsPath, ""));

[Survived] ConditionalExpression
scripts/lib/reconcile-brain.mjs:279:9
-       if (changed) writeFileSync(gitignorePath, text);
+       if (true) writeFileSync(gitignorePath, text);

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:383:58
-     const manifest = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const manifest = JSON.parse(readFileSync(manifestPath, ""));
