[Survived] Regex
scripts/lib/reconcile-brain.mjs:130:40
-       const skillDir = skillGlob.replace(/\/\*\*?$/, ""); // ".../local-mirror/**" → ".../local-mirror"
+       const skillDir = skillGlob.replace(/\/\*\*?/, ""); // ".../local-mirror/**" → ".../local-mirror"

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:133:105
-         if (copyInto(sourceDir, brainDir, rel)) installedFileMap[rel] = readFileSync(join(brainDir, rel), "utf8");
+         if (copyInto(sourceDir, brainDir, rel)) installedFileMap[rel] = readFileSync(join(brainDir, rel), "");

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:236:60
-       const brainMcp = JSON.parse(readFileSync(brainMcpPath, "utf8"));
+       const brainMcp = JSON.parse(readFileSync(brainMcpPath, ""));

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:270:70
-       const brainSettings = JSON.parse(readFileSync(brainSettingsPath, "utf8"));
+       const brainSettings = JSON.parse(readFileSync(brainSettingsPath, ""));

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:271:76
-       const templateSettings = JSON.parse(readFileSync(settingsTemplatePath, "utf8"));
+       const templateSettings = JSON.parse(readFileSync(settingsTemplatePath, ""));

[Survived] ConditionalExpression
scripts/lib/reconcile-brain.mjs:322:9
-       if (changed) writeFileSync(gitignorePath, text);
+       if (true) writeFileSync(gitignorePath, text);

[Survived] StringLiteral
scripts/lib/reconcile-brain.mjs:440:58
-     const manifest = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const manifest = JSON.parse(readFileSync(manifestPath, ""));
