[Survived] ArithmeticOperator
scripts/lib/remote-arrivals.mjs:98:20
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST + 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:98:70
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && true; limit--) {

[Survived] ArrayDeclaration
scripts/lib/remote-arrivals.mjs:154:25
-     if (!(trace?.files ?? []).some(isUniversePointer)) return null;
+     if (!(trace?.files ?? ["Stryker was here"]).some(isUniversePointer)) return null;

[Survived] ArrowFunction
scripts/lib/remote-arrivals.mjs:209:63
-   export function remoteArrivalsDirective(trace, readUniverse = () => null) {
+   export function remoteArrivalsDirective(trace, readUniverse = () => undefined) {

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:236:46
-           return JSON.parse(readFileSync(path, "utf8"));
+           return JSON.parse(readFileSync(path, ""));

[Survived] ObjectLiteral
scripts/lib/remote-arrivals.mjs:249:25
-           rmSync(staging, { force: true });
+           rmSync(staging, {});

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:245:69
-         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "utf8");
+         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "");

[Survived] BooleanLiteral
scripts/lib/remote-arrivals.mjs:249:34
-           rmSync(staging, { force: true });
+           rmSync(staging, { force: false });

[Survived] StringLiteral
scripts/prompt-restart-nudge.mjs:47:75
-       readActiveUniverse({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(repo)),
+       readActiveUniverse({ existsSync, readFileSync: (p) => readFileSync(p, "") }, vaultRagDir(repo)),
