[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:53:13
-     } finally {
-       closeSync(fd);
-     }
+     } finally {}

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:61:42
-       return JSON.parse(readFileSync(path, "utf8"));
+       return JSON.parse(readFileSync(path, ""));

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:62:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:75:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:131:11
-         if (error.code === "EEXIST") return false;
+         if (false) return false;

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:131:26
-         if (error.code === "EEXIST") return false;
+         if (error.code === "") return false;

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:135:25
-           rmSync(staging, { force: true });
+           rmSync(staging, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:135:34
-           rmSync(staging, { force: true });
+           rmSync(staging, { force: false });

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:147:11
-         if (last !== null && at - last < minGapMs) return false;
+         if (true && at - last < minGapMs) return false;

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:154:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:154:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:155:15
-         } catch {
-           return false;
-         }
+         } catch {}

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:156:16
-           return false;
+           return true;

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:162:54
-           writeFileSync(lastPath, now().toISOString(), "utf8");
+           writeFileSync(lastPath, now().toISOString(), "");

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:167:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:167:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });
