[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:43:40
-   function exclusiveCreate(path, record) {
-     let fd;
-     try {
-       fd = openSync(path, "wx");
-     } catch (error) {
-       if (error.code === "EEXIST") return false;
-       throw error;
-     }
-     try {
-       writeSync(fd, record);
-     } finally {
-       closeSync(fd);
-     }
-     return true;
-   }
+   function exclusiveCreate(path, record) {}

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:45:7
-     try {
-       fd = openSync(path, "wx");
-     } catch (error) {
+     try {} catch (error) {

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:46:25
-       fd = openSync(path, "wx");
+       fd = openSync(path, "");

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:47:19
-     } catch (error) {
-       if (error.code === "EEXIST") return false;
-       throw error;
-     }
+     } catch (error) {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:48:9
-       if (error.code === "EEXIST") return false;
+       if (false) return false;

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:48:9
-       if (error.code === "EEXIST") return false;
+       if (true) return false;

[Survived] EqualityOperator
scripts/lib/remote-sync-gate.mjs:48:9
-       if (error.code === "EEXIST") return false;
+       if (error.code !== "EEXIST") return false;

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:48:24
-       if (error.code === "EEXIST") return false;
+       if (error.code === "") return false;

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:48:41
-       if (error.code === "EEXIST") return false;
+       if (error.code === "EEXIST") return true;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:51:7
-     try {
-       writeSync(fd, record);
-     } finally {
+     try {} finally {

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:56:10
-     return true;
+     return false;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:120:21
-       } catch (error) {
-         if (error.code === "EEXIST") return false;
-         return exclusiveCreate(lockPath, record);
-       } finally {
+       } catch (error) {} finally {

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:121:11
-         if (error.code === "EEXIST") return false;
+         if (true) return false;

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:121:11
-         if (error.code === "EEXIST") return false;
+         if (false) return false;

[Survived] EqualityOperator
scripts/lib/remote-sync-gate.mjs:121:11
-         if (error.code === "EEXIST") return false;
+         if (error.code !== "EEXIST") return false;

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:121:26
-         if (error.code === "EEXIST") return false;
+         if (error.code === "") return false;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:123:15
-       } finally {
-         try {
-           rmSync(staging, { force: true });
-         } catch {
-           // best-effort: a leftover staging file is inert, and the next tick overwrites it
-         }
-       }
+       } finally {}

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:124:11
-         try {
-           rmSync(staging, { force: true });
-         } catch {
+         try {} catch {

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:125:25
-           rmSync(staging, { force: true });
+           rmSync(staging, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:125:34
-           rmSync(staging, { force: true });
+           rmSync(staging, { force: false });

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:137:11
-         if (last !== null && at - last < minGapMs) return false;
+         if (true && at - last < minGapMs) return false;

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:138:11
-         if (tryCreate(at)) return true;
+         if (false) return true;

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:144:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:144:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:145:15
-         } catch {
-           return false;
-         }
+         } catch {}

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:146:16
-           return false;
+           return true;

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:152:54
-           writeFileSync(lastPath, now().toISOString(), "utf8");
+           writeFileSync(lastPath, now().toISOString(), "");

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:157:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:157:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });
