[Survived] EqualityOperator
maintainers/mutation/mutate-one.mjs:194:24
-       .filter((cells) => cells.length >= 8);
+       .filter((cells) => cells.length > 8);

[Survived] StringLiteral
maintainers/mutation/mutate-one.mjs:346:62
-         const done = spawnSync(command, args, { cwd, encoding: "utf8", maxBuffer: 64 * 1024 * 1024 });
+         const done = spawnSync(command, args, { cwd, encoding: "", maxBuffer: 64 * 1024 * 1024 });

[Survived] ArrowFunction
maintainers/mutation/mutate-one.mjs:356:48
-   runAsEntrypoint(import.meta.url, process.argv, async (argv) => runMutateOne(argv, await defaultDeps()));
+   runAsEntrypoint(import.meta.url, process.argv, () => undefined);
