[Survived] ObjectLiteral
scripts/session-authors.mjs:44:20
-   const NO_ANSWERS = { identities: [], distinct: [] };
+   const NO_ANSWERS = {};

[Survived] ArrayDeclaration
scripts/session-authors.mjs:44:34
-   const NO_ANSWERS = { identities: [], distinct: [] };
+   const NO_ANSWERS = { identities: ["Stryker was here"], distinct: [] };

[Survived] ArrayDeclaration
scripts/session-authors.mjs:44:48
-   const NO_ANSWERS = { identities: [], distinct: [] };
+   const NO_ANSWERS = { identities: [], distinct: ["Stryker was here"] };

[Survived] StringLiteral
scripts/session-authors.mjs:104:36
-         if (!log.ok) throw new Error("no git history");
+         if (!log.ok) throw new Error("");

[Survived] StringLiteral
scripts/session-authors.mjs:111:75
-         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(brainDir)),
+         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "") }, vaultRagDir(brainDir)),
