[Survived] ArrayDeclaration
scripts/session-wiki-health.mjs:36:72
-   export function sessionWikiHealth({ readNotes, readAttachments = () => [], vaultDir, emit }) {
+   export function sessionWikiHealth({ readNotes, readAttachments = () => ["Stryker was here"], vaultDir, emit }) {

[Survived] ArrowFunction
scripts/session-wiki-health.mjs:36:66
-   export function sessionWikiHealth({ readNotes, readAttachments = () => [], vaultDir, emit }) {
+   export function sessionWikiHealth({ readNotes, readAttachments = () => undefined, vaultDir, emit }) {
