[Survived] ObjectLiteral
scripts/session-wiki-health.mjs:49:14
-         return { reported: true };
+         return {};

[Survived] BooleanLiteral
scripts/session-wiki-health.mjs:49:26
-         return { reported: true };
+         return { reported: false };
