[Survived] MethodExpression
scripts/lib/source-key.mjs:79:16
-     const text = String(raw ?? "").trim();
+     const text = String(raw ?? "");

[Survived] Regex
scripts/lib/source-key.mjs:96:66
-     return new Date(ms).toISOString().replace(/[-:]/g, "").replace(/\.\d+Z$/, "Z");
+     return new Date(ms).toISOString().replace(/[-:]/g, "").replace(/\.\d+Z/, "Z");

[Survived] StringLiteral
scripts/lib/source-key.mjs:194:11
-             `compose it with sourceKey({ type, … }) — a key nothing can match is worse than none.`,
+             ``,
