[Survived] Regex
scripts/lib/source-key.mjs:24:23
-   const SAFE_IN_FIELD = /[^A-Za-z0-9_.@+-]+/g;
+   const SAFE_IN_FIELD = /[^A-Za-z0-9_.@+-]/g;

[Survived] StringLiteral
scripts/lib/source-key.mjs:30:23
-     slack: [["channel", "id"], ["ts", "id"]],
+     slack: [["channel", ""], ["ts", "id"]],

[Survived] StringLiteral
scripts/lib/source-key.mjs:30:37
-     slack: [["channel", "id"], ["ts", "id"]],
+     slack: [["channel", "id"], ["ts", ""]],

[Survived] StringLiteral
scripts/lib/source-key.mjs:31:24
-     calendar: [["event", "id"]],
+     calendar: [["event", ""]],

[Survived] StringLiteral
scripts/lib/source-key.mjs:32:20
-     drive: [["file", "id"]],
+     drive: [["file", ""]],

[Survived] StringLiteral
scripts/lib/source-key.mjs:33:21
-     notion: [["page", "id"]],
+     notion: [["page", ""]],

[Survived] MethodExpression
scripts/lib/source-key.mjs:45:10
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");

[Survived] StringLiteral
scripts/lib/source-key.mjs:45:52
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).trim().replace(SAFE_IN_FIELD, "").replace(/^-+|-+$/g, "");

[Survived] Regex
scripts/lib/source-key.mjs:45:65
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-|-+$/g, "");

[Survived] Regex
scripts/lib/source-key.mjs:45:65
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+/g, "");

[Survived] Regex
scripts/lib/source-key.mjs:45:65
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/-+|-+$/g, "");

[Survived] Regex
scripts/lib/source-key.mjs:45:65
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-$/g, "");

[Survived] StringLiteral
scripts/lib/source-key.mjs:45:77
-     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "");
+     return String(raw).trim().replace(SAFE_IN_FIELD, "-").replace(/^-+|-+$/g, "Stryker was here!");

[Survived] MethodExpression
scripts/lib/source-key.mjs:52:16
-     const text = String(raw).trim();
+     const text = String(raw);

[Survived] StringLiteral
scripts/lib/source-key.mjs:63:24
-       .replace(/[̀-ͯ]/g, "")
+       .replace(/[̀-ͯ]/g, "Stryker was here!")

[Survived] Regex
scripts/lib/source-key.mjs:66:14
-       .replace(/^-+|-+$/g, "");
+       .replace(/^-|-+$/g, "");

[Survived] Regex
scripts/lib/source-key.mjs:66:14
-       .replace(/^-+|-+$/g, "");
+       .replace(/^-+|-$/g, "");

[Survived] MethodExpression
scripts/lib/source-key.mjs:75:16
-     const text = String(raw).trim();
+     const text = String(raw);

[Survived] Regex
scripts/lib/source-key.mjs:80:7
-       : /^\d{13}$/.test(text)
+       : /\d{13}$/.test(text)

[Survived] Regex
scripts/lib/source-key.mjs:80:7
-       : /^\d{13}$/.test(text)
+       : /^\d{13}/.test(text)

[Survived] StringLiteral
scripts/lib/source-key.mjs:86:9
-           `Give the sent time as ISO 8601 (2026-09-02T16:19:32Z) or as an epoch in seconds or milliseconds.`,
+           ``,

[Survived] Regex
scripts/lib/source-key.mjs:89:66
-     return new Date(ms).toISOString().replace(/[-:]/g, "").replace(/\.\d+Z$/, "Z");
+     return new Date(ms).toISOString().replace(/[-:]/g, "").replace(/\.\d+Z/, "Z");

[Survived] OptionalChaining
scripts/lib/source-key.mjs:103:23
-     const type = String(descriptor?.type ?? "").trim().toLowerCase();
+     const type = String(descriptor.type ?? "").trim().toLowerCase();

[Survived] StringLiteral
scripts/lib/source-key.mjs:103:43
-     const type = String(descriptor?.type ?? "").trim().toLowerCase();
+     const type = String(descriptor?.type ?? "Stryker was here!").trim().toLowerCase();

[Survived] OptionalChaining
scripts/lib/source-key.mjs:107:52
-         `unknown source type ${JSON.stringify(String(descriptor?.type ?? ""))}: ` +
+         `unknown source type ${JSON.stringify(String(descriptor.type ?? ""))}: ` +

[Survived] StringLiteral
scripts/lib/source-key.mjs:107:72
-         `unknown source type ${JSON.stringify(String(descriptor?.type ?? ""))}: ` +
+         `unknown source type ${JSON.stringify(String(descriptor?.type ?? "Stryker was here!"))}: ` +

[Survived] StringLiteral
scripts/lib/source-key.mjs:108:69
-           `the sources that carry an identity are ${SOURCE_TYPES.join(", ")}.`,
+           `the sources that carry an identity are ${SOURCE_TYPES.join("")}.`,

[Survived] MethodExpression
scripts/lib/source-key.mjs:129:24
-     if (value == null || String(value).trim() === "") {
+     if (value == null || String(value) === "") {

[Survived] StringLiteral
scripts/lib/source-key.mjs:132:9
-           `A source you cannot identify is UNKNOWN: write no key rather than a partial one.`,
+           ``,

[Survived] ConditionalExpression
scripts/lib/source-key.mjs:139:10
-     return typeof value === "string" && /^[a-z]+(\|[A-Za-z0-9_.@+-]+)+$/.test(value);
+     return true && /^[a-z]+(\|[A-Za-z0-9_.@+-]+)+$/.test(value);

[Survived] OptionalChaining
scripts/lib/source-key.mjs:161:15
-     const raw = frontmatter?.[SOURCES_FIELD];
+     const raw = frontmatter[SOURCES_FIELD];

[Survived] StringLiteral
scripts/known-source.mjs:40:3
-     `        mail: --from --date --subject)`;
+     ``;

[Survived] StringLiteral
scripts/known-source.mjs:37:3
-     `usage: known-source.mjs --key "<source key>"\n` +
+     `` +

[Survived] StringLiteral
scripts/known-source.mjs:39:3
-     `       (slack: --channel --ts · calendar: --event · drive: --file · notion: --page\n` +
+     `` +

[Survived] StringLiteral
scripts/known-source.mjs:38:3
-     `   or: known-source.mjs --type <slack|calendar|drive|notion|mail> --<field> <value> …\n` +
+     `` +

[Survived] StringLiteral
scripts/known-source.mjs:45:51
-     notes: () => readVaultNotes(join(process.cwd(), "vault")),
+     notes: () => readVaultNotes(join(process.cwd(), "")),

[Survived] ArrowFunction
scripts/known-source.mjs:47:10
-     error: (...a) => console.error(...a),
+     error: () => undefined,

[Survived] StringLiteral
scripts/known-source.mjs:54:37
-       const name = argv[i].startsWith("--") ? argv[i].slice(2) : null;
+       const name = argv[i].startsWith("") ? argv[i].slice(2) : null;

[Survived] StringLiteral
scripts/known-source.mjs:55:32
-       if (!name) throw new Error(`unexpected argument ${JSON.stringify(argv[i])}.\n${USAGE}`);
+       if (!name) throw new Error(``);

[Survived] ConditionalExpression
scripts/known-source.mjs:55:9
-       if (!name) throw new Error(`unexpected argument ${JSON.stringify(argv[i])}.\n${USAGE}`);
+       if (false) throw new Error(`unexpected argument ${JSON.stringify(argv[i])}.\n${USAGE}`);

[Survived] ConditionalExpression
scripts/known-source.mjs:56:9
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (false) throw new Error(`--${name} needs a value.\n${USAGE}`);

[Survived] EqualityOperator
scripts/known-source.mjs:56:9
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (i + 1 > argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);

[Survived] ArithmeticOperator
scripts/known-source.mjs:56:9
-       if (i + 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);
+       if (i - 1 >= argv.length) throw new Error(`--${name} needs a value.\n${USAGE}`);

[Survived] StringLiteral
scripts/known-source.mjs:69:9
-           `${JSON.stringify(flags.key)} is not a source key. Compose one from the connector's own ` +
+           `` +

[Survived] StringLiteral
scripts/known-source.mjs:70:11
-             `fields instead: --type <…> --<field> <value> … — a key nothing can match is worse than none.`,
+             ``,

[Survived] StringLiteral
scripts/known-source.mjs:105:83
-       `✗ already held — ${key} is listed by ${holders.map((p) => `vault/${p}`).join(", ")}. ` +
+       `✗ already held — ${key} is listed by ${holders.map((p) => `vault/${p}`).join("")}. ` +

[Survived] StringLiteral
scripts/known-source.mjs:106:7
-         `Read that note and enrich it if your question needs more; do not capture it a second time.`,
+         ``,
