[Survived] EqualityOperator
scripts/lib/tracked-files.mjs:38:9
-       if (tab < 0) continue;
+       if (tab <= 0) continue;

[Survived] MethodExpression
scripts/lib/tracked-files.mjs:40:31
-       const [index, worktree] = fields.trim().split(/\s+/);
+       const [index, worktree] = fields.split(/\s+/);

[Survived] ConditionalExpression
scripts/lib/tracked-files.mjs:45:13
-         attr: attrAt < 0 ? "" : fields.slice(attrAt + "attr/".length).trim(),
+         attr: false ? "" : fields.slice(attrAt + "attr/".length).trim(),

[Survived] EqualityOperator
scripts/lib/tracked-files.mjs:45:13
-         attr: attrAt < 0 ? "" : fields.slice(attrAt + "attr/".length).trim(),
+         attr: attrAt <= 0 ? "" : fields.slice(attrAt + "attr/".length).trim(),

[Survived] StringLiteral
scripts/lib/tracked-files.mjs:45:26
-         attr: attrAt < 0 ? "" : fields.slice(attrAt + "attr/".length).trim(),
+         attr: attrAt < 0 ? "Stryker was here!" : fields.slice(attrAt + "attr/".length).trim(),

[Survived] Regex
scripts/lib/tracked-files.mjs:69:11
-     return !/(^|\s)eol=crlf(\s|$)/.test(info.attr);
+     return !/(^|\s)eol=crlf(\S|$)/.test(info.attr);
