[Survived] Regex
scripts/lib/tracked-files.mjs:36:20
-   const EOL_FIELDS = /^(i\/\S+)\s+(w\/\S+)\s+attr\/(.*)$/;
+   const EOL_FIELDS = /^(i\/\S+)\s+(w\/\S+)\s+attr\/(.*)/;

[Survived] Regex
scripts/lib/tracked-files.mjs:36:20
-   const EOL_FIELDS = /^(i\/\S+)\s+(w\/\S+)\s+attr\/(.*)$/;
+   const EOL_FIELDS = /(i\/\S+)\s+(w\/\S+)\s+attr\/(.*)$/;

[Survived] EqualityOperator
scripts/lib/tracked-files.mjs:44:9
-       if (tab < 0) continue;
+       if (tab <= 0) continue;
