[Survived] Regex
scripts/lib/unwrap-markdown.mjs:20:25
-   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_{3,})$/;
+   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_{3,})/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:20:25
-   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_{3,})$/;
+   const HORIZONTAL_RULE = /(-{3,}|\*{3,}|_{3,})$/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:20:25
-   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_{3,})$/;
+   const HORIZONTAL_RULE = /^(-|\*{3,}|_{3,})$/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:20:25
-   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_{3,})$/;
+   const HORIZONTAL_RULE = /^(-{3,}|\*|_{3,})$/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:20:25
-   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_{3,})$/;
+   const HORIZONTAL_RULE = /^(-{3,}|\*{3,}|_)$/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:21:15
-   const FENCE = /^\s*(```|~~~)/;
+   const FENCE = /\s*(```|~~~)/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:22:19
-   const TABLE_ROW = /^\s*\|/;
+   const TABLE_ROW = /^\S*\|/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:22:19
-   const TABLE_ROW = /^\s*\|/;
+   const TABLE_ROW = /\s*\|/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:21:15
-   const FENCE = /^\s*(```|~~~)/;
+   const FENCE = /^\S*(```|~~~)/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:23:20
-   const HTML_BLOCK = /^\s*</;
+   const HTML_BLOCK = /\s*</;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:24:25
-   const LIST_ITEM_START = /^([-*+]|\d+[.)])\s/;
+   const LIST_ITEM_START = /^([-*+]|\d[.)])\s/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:24:25
-   const LIST_ITEM_START = /^([-*+]|\d+[.)])\s/;
+   const LIST_ITEM_START = /([-*+]|\d+[.)])\s/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:23:20
-   const HTML_BLOCK = /^\s*</;
+   const HTML_BLOCK = /^\S*</;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:29:29
-   const EXPLICIT_HARD_BREAK = /(\s{2}|\\)$/;
+   const EXPLICIT_HARD_BREAK = /(\s{2}|\\)/;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:29:29
-   const EXPLICIT_HARD_BREAK = /(\s{2}|\\)$/;
+   const EXPLICIT_HARD_BREAK = /(\s|\\)$/;

[Survived] UpdateOperator
scripts/lib/unwrap-markdown.mjs:40:5
-       depth++;
+       depth--;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:41:31
-       content = content.replace(/^\s*>\s?/, "");
+       content = content.replace(/\s*>\s?/, "");

[Survived] MethodExpression
scripts/lib/unwrap-markdown.mjs:49:19
-     const trimmed = content.trim();
+     const trimmed = content;

[Survived] MethodExpression
scripts/lib/unwrap-markdown.mjs:57:62
-     return !opensItsOwnBlock(content) && !LIST_ITEM_START.test(content.trim());
+     return !opensItsOwnBlock(content) && !LIST_ITEM_START.test(content);

[Survived] MethodExpression
scripts/lib/unwrap-markdown.mjs:89:20
-       if (i === 0 && line.trim() === FRONTMATTER_DELIMITER) {
+       if (i === 0 && line === FRONTMATTER_DELIMITER) {

[Survived] MethodExpression
scripts/lib/unwrap-markdown.mjs:95:11
-         if (line.trim() === FRONTMATTER_DELIMITER) inFrontmatter = false;
+         if (line === FRONTMATTER_DELIMITER) inFrontmatter = false;

[Survived] Regex
scripts/lib/unwrap-markdown.mjs:118:48
-           out[openLine.index] = previous.replace(/\s+$/, "") + " " + content.trim();
+           out[openLine.index] = previous.replace(/\s$/, "") + " " + content.trim();

[Survived] StringLiteral
scripts/lib/unwrap-markdown.mjs:118:56
-           out[openLine.index] = previous.replace(/\s+$/, "") + " " + content.trim();
+           out[openLine.index] = previous.replace(/\s+$/, "Stryker was here!") + " " + content.trim();
