[Survived] StringLiteral
scripts/update-engine.mjs:410:55
-     const local = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const local = JSON.parse(readFileSync(manifestPath, ""));

[Survived] StringLiteral
scripts/update-engine.mjs:635:86
-     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
+     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), ""));
