[Survived] ConditionalExpression
scripts/update-engine.mjs:160:9
-       if (aside === undefined) continue;
+       if (false) continue;

[Survived] StringLiteral
scripts/update-engine.mjs:396:55
-     const local = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const local = JSON.parse(readFileSync(manifestPath, ""));

[Survived] StringLiteral
scripts/update-engine.mjs:610:86
-     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
+     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), ""));
