[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;

[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s+[—–-]\s(?:never|not)\s*:?\s+(.+)$/i;

[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:\s+(.+)$/i;

[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\S+(.+)$/i;

[Survived] MethodExpression
scripts/lib/declared-spellings.mjs:48:18
-         canonical: canonical.trim(),
+         canonical: canonical,

[Survived] MethodExpression
scripts/lib/declared-spellings.mjs:49:14
-         wrong: wrong
-           .split(",")
-           .map((one) => one.trim())
-           .filter(Boolean),
+         wrong: wrong.split(",").map(one => one.trim()),

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:66:29
-     if (rules.length === 0 || typeof text !== "string") {
+     if (rules.length === 0 || false) {

[Survived] EqualityOperator
scripts/lib/declared-spellings.mjs:72:42
-       protectedRanges.some(([from, to]) => at < to && end > from);
+       protectedRanges.some(([from, to]) => at <= to && end > from);

[Survived] EqualityOperator
scripts/lib/declared-spellings.mjs:72:53
-       protectedRanges.some(([from, to]) => at < to && end > from);
+       protectedRanges.some(([from, to]) => at < to && end >= from);

[Survived] MethodExpression
scripts/lib/declared-spellings.mjs:100:10
-     return (Array.isArray(entries) ? entries : [])
-       .flatMap(({ canonical, wrong }) => (wrong ?? []).map((from) => ({ from, to: canonical })))
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+     return (Array.isArray(entries) ? entries : []).flatMap(({
+     canonical,
+     wrong
+   }) => (wrong ?? []).map(from => ({
+     from,
+     to: canonical
+   })))

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:100:46
-     return (Array.isArray(entries) ? entries : [])
+     return (Array.isArray(entries) ? entries : ["Stryker was here"])

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:101:50
-       .flatMap(({ canonical, wrong }) => (wrong ?? []).map((from) => ({ from, to: canonical })))
+       .flatMap(({ canonical, wrong }) => (wrong ?? ["Stryker was here"]).map((from) => ({ from, to: canonical })))

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:102:31
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => true)

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:102:31
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => true && typeof to === "string")

[Survived] LogicalOperator
scripts/lib/declared-spellings.mjs:102:31
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && from.length > 0 || typeof to === "string")

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:102:31
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => true && from.length > 0 && typeof to === "string")

[Survived] LogicalOperator
scripts/lib/declared-spellings.mjs:102:31
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" || from.length > 0 && typeof to === "string")

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:102:59
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && true && typeof to === "string")

[Survived] EqualityOperator
scripts/lib/declared-spellings.mjs:102:59
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && from.length >= 0 && typeof to === "string")

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:102:78
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && true)

[Survived] StringLiteral
scripts/lib/declared-spellings.mjs:106:66
-   const escapeRegExp = (raw) => raw.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
+   const escapeRegExp = (raw) => raw.replace(/[.*+?^${}()|[\]\\]/g, "");

[Survived] Regex
scripts/lib/declared-spellings.mjs:112:3
-     /^---\n[\s\S]*?\n---/, //          frontmatter: machine-read (a universe slug, tags,
+     /---\n[\s\S]*?\n---/, //          frontmatter: machine-read (a universe slug, tags,

[Survived] Regex
scripts/lib/declared-spellings.mjs:118:3
-     /<[^>\s]+>/g, //                   …and so is an autolink
+     /<[^>\s]>/g, //                   …and so is an autolink

[Survived] Regex
scripts/lib/declared-spellings.mjs:118:3
-     /<[^>\s]+>/g, //                   …and so is an autolink
+     /<[>\s]+>/g, //                   …and so is an autolink

[Survived] Regex
scripts/lib/declared-spellings.mjs:118:3
-     /<[^>\s]+>/g, //                   …and so is an autolink
+     /<[^>\S]+>/g, //                   …and so is an autolink

[Survived] Regex
scripts/lib/declared-spellings.mjs:119:3
-     /^>.*$/gm, //                      a blockquote is someone else's words
+     />.*$/gm, //                      a blockquote is someone else's words

[Survived] Regex
scripts/lib/declared-spellings.mjs:119:3
-     /^>.*$/gm, //                      a blockquote is someone else's words
+     /^>.*/gm, //                      a blockquote is someone else's words

[Survived] Regex
scripts/lib/declared-spellings.mjs:121:3
-     /“[^”\n]*”/g, //                   "Marie wrote: …" is what Marie wrote, and the
+     /“[^”\n]”/g, //                   "Marie wrote: …" is what Marie wrote, and the

[Survived] Regex
scripts/lib/declared-spellings.mjs:121:3
-     /“[^”\n]*”/g, //                   "Marie wrote: …" is what Marie wrote, and the
+     /“[”\n]*”/g, //                   "Marie wrote: …" is what Marie wrote, and the

[Survived] Regex
scripts/lib/declared-spellings.mjs:122:3
-     /«[^»\n]*»/g, //                   guard reports it rather than rewriting her.
+     /«[^»\n]»/g, //                   guard reports it rather than rewriting her.

[Survived] Regex
scripts/lib/declared-spellings.mjs:122:3
-     /«[^»\n]*»/g, //                   guard reports it rather than rewriting her.
+     /«[»\n]*»/g, //                   guard reports it rather than rewriting her.

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:126:17
-     const spans = [];
+     const spans = ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/universe-drift.mjs:37:69
-   export function universeDriftNotice({ notePath, pointer, registry = [], alreadySaid = [] }) {
+   export function universeDriftNotice({ notePath, pointer, registry = ["Stryker was here"], alreadySaid = [] }) {

[Survived] ArrayDeclaration
scripts/lib/universe-drift.mjs:37:87
-   export function universeDriftNotice({ notePath, pointer, registry = [], alreadySaid = [] }) {
+   export function universeDriftNotice({ notePath, pointer, registry = [], alreadySaid = ["Stryker was here"] }) {

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:100:10
-     return typeof verdict.target === "string" && verdict.target !== "" ? verdict.target : null;
+     return true ? verdict.target : null;

[Survived] LogicalOperator
scripts/lib/update-offer.mjs:100:10
-     return typeof verdict.target === "string" && verdict.target !== "" ? verdict.target : null;
+     return typeof verdict.target === "string" || verdict.target !== "" ? verdict.target : null;

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:100:10
-     return typeof verdict.target === "string" && verdict.target !== "" ? verdict.target : null;
+     return true && verdict.target !== "" ? verdict.target : null;

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:100:48
-     return typeof verdict.target === "string" && verdict.target !== "" ? verdict.target : null;
+     return typeof verdict.target === "string" && true ? verdict.target : null;

[Survived] StringLiteral
scripts/lib/update-offer.mjs:100:67
-     return typeof verdict.target === "string" && verdict.target !== "" ? verdict.target : null;
+     return typeof verdict.target === "string" && verdict.target !== "Stryker was here!" ? verdict.target : null;

[Survived] StringLiteral
scripts/lib/update-offer.mjs:168:5
-       `past: "Install now" · "Remind me later" · "No thanks". Where no such control exists, ask the same ` +
+       `` +

[Survived] StringLiteral
scripts/lib/update-offer.mjs:172:5
-       `Unanswered means nothing runs, and the offer comes back tomorrow.`
+       ``

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:186:60
-     const release = (verdict.releases ?? []).find((entry) => entry?.version === version);
+     const release = (verdict.releases ?? []).find((entry) => true);

[Survived] OptionalChaining
scripts/lib/update-offer.mjs:186:60
-     const release = (verdict.releases ?? []).find((entry) => entry?.version === version);
+     const release = (verdict.releases ?? []).find((entry) => entry.version === version);

[Survived] OptionalChaining
scripts/lib/update-offer.mjs:187:23
-     const body = typeof release?.whatYouGet === "string" ? release.whatYouGet.trim() : "";
+     const body = typeof release.whatYouGet === "string" ? release.whatYouGet.trim() : "";

[Survived] MethodExpression
scripts/lib/update-offer.mjs:187:58
-     const body = typeof release?.whatYouGet === "string" ? release.whatYouGet.trim() : "";
+     const body = typeof release?.whatYouGet === "string" ? release.whatYouGet : "";

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:196:18
-     const quoted = body.length <= QUOTE_MAX ? body : `${cutAtLine(body, QUOTE_MAX)}\n…`;
+     const quoted = false ? body : `${cutAtLine(body, QUOTE_MAX)}\n…`;

[Survived] EqualityOperator
scripts/lib/update-offer.mjs:196:18
-     const quoted = body.length <= QUOTE_MAX ? body : `${cutAtLine(body, QUOTE_MAX)}\n…`;
+     const quoted = body.length < QUOTE_MAX ? body : `${cutAtLine(body, QUOTE_MAX)}\n…`;

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:197:17
-     const where = body.length <= QUOTE_MAX ? "" : ` ${full}`;
+     const where = false ? "" : ` ${full}`;

[Survived] EqualityOperator
scripts/lib/update-offer.mjs:197:17
-     const where = body.length <= QUOTE_MAX ? "" : ` ${full}`;
+     const where = body.length < QUOTE_MAX ? "" : ` ${full}`;

[Survived] StringLiteral
scripts/lib/update-offer.mjs:197:44
-     const where = body.length <= QUOTE_MAX ? "" : ` ${full}`;
+     const where = body.length <= QUOTE_MAX ? "Stryker was here!" : ` ${full}`;

[Survived] EqualityOperator
scripts/lib/update-offer.mjs:207:9
-       if (size + line.length + 1 > budget) break;
+       if (size + line.length + 1 >= budget) break;

[Survived] ArithmeticOperator
scripts/lib/update-offer.mjs:207:9
-       if (size + line.length + 1 > budget) break;
+       if (size + line.length - 1 > budget) break;

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:211:10
-     return kept.length > 0 ? kept.join("\n") : body.slice(0, budget);
+     return true ? kept.join("\n") : body.slice(0, budget);

[Survived] EqualityOperator
scripts/lib/update-offer.mjs:211:10
-     return kept.length > 0 ? kept.join("\n") : body.slice(0, budget);
+     return kept.length >= 0 ? kept.join("\n") : body.slice(0, budget);

[Survived] StringLiteral
scripts/lib/update-offer.mjs:211:38
-     return kept.length > 0 ? kept.join("\n") : body.slice(0, budget);
+     return kept.length > 0 ? kept.join("") : body.slice(0, budget);

[Survived] MethodExpression
scripts/lib/update-offer.mjs:211:46
-     return kept.length > 0 ? kept.join("\n") : body.slice(0, budget);
+     return kept.length > 0 ? kept.join("\n") : body;

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:224:12
-       return parsed !== null && typeof parsed === "object" ? parsed : null;
+       return true ? parsed : null;

[Survived] LogicalOperator
scripts/lib/update-offer.mjs:224:12
-       return parsed !== null && typeof parsed === "object" ? parsed : null;
+       return parsed !== null || typeof parsed === "object" ? parsed : null;

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:224:31
-       return parsed !== null && typeof parsed === "object" ? parsed : null;
+       return parsed !== null && true ? parsed : null;

[Survived] ArrayDeclaration
scripts/lib/vault-paths.mjs:39:53
-   export function noteUniverse({ notePath, registry = [] }) {
+   export function noteUniverse({ notePath, registry = ["Stryker was here"] }) {

[Survived] ConditionalExpression
scripts/lib/vault-paths.mjs:41:10
-     return segment !== undefined && registry.includes(segment) ? segment : DEFAULT_UNIVERSE;
+     return true && registry.includes(segment) ? segment : DEFAULT_UNIVERSE;

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:72:14
-     registry = [],
+     registry = ["Stryker was here"],

[Survived] ObjectLiteral
scripts/lib/vault-write-notice.mjs:75:10
-     said = { universes: [], corrections: [] },
+     said = {},

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:75:23
-     said = { universes: [], corrections: [] },
+     said = { universes: ["Stryker was here"], corrections: [] },

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:75:40
-     said = { universes: [], corrections: [] },
+     said = { universes: [], corrections: ["Stryker was here"] },

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:81:7
-     if (notePath === null) return nothing;
+     if (false) return nothing;

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:83:99
-     const drift = universeDriftNotice({ notePath, pointer, registry, alreadySaid: said.universes ?? [] });
+     const drift = universeDriftNotice({ notePath, pointer, registry, alreadySaid: said.universes ?? ["Stryker was here"] });

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:86:76
-     const fresh = spelling.corrections.filter((one) => !(said.corrections ?? []).includes(correctionKey(one)));
+     const fresh = spelling.corrections.filter((one) => !(said.corrections ?? ["Stryker was here"]).includes(correctionKey(one)));

[Survived] OptionalChaining
scripts/lib/vault-write-notice.mjs:112:19
-     const written = toolInput?.[field];
+     const written = toolInput[field];

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:113:7
-     if (typeof written !== "string") return quiet;
+     if (false) return quiet;

[Survived] MethodExpression
scripts/lib/vault-write-notice.mjs:148:10
-     return entries
-       .map((entry) => ({ ...entry, wrong: entry.wrong.filter((one) => !spared.has(one.toLowerCase())) }))
-       .filter((entry) => entry.wrong.length > 0);
+     return entries.map(entry => ({
+     ...entry,
+     wrong: entry.wrong.filter(one => !spared.has(one.toLowerCase()))
+   }));

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:150:24
-       .filter((entry) => entry.wrong.length > 0);
+       .filter((entry) => true);

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:150:24
-       .filter((entry) => entry.wrong.length > 0);
+       .filter((entry) => entry.wrong.length >= 0);

[Survived] MethodExpression
scripts/lib/vault-write-notice.mjs:159:10
-     return declared.some((entry) =>
-       entry.wrong.some((one) => spared.has(one.toLowerCase()) && haystack.includes(one.toLowerCase())),
-     );
+     return declared.every(entry => entry.wrong.some(one => spared.has(one.toLowerCase()) && haystack.includes(one.toLowerCase())));

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:170:10
-     while (kept.length > 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();
+     while (true && kept.join("\n").length > NOTICE_MAX) kept.pop();

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:170:10
-     while (kept.length > 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();
+     while (kept.length >= 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:170:29
-     while (kept.length > 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();
+     while (kept.length > 1 && kept.join("\n").length >= NOTICE_MAX) kept.pop();

[Survived] StringLiteral
scripts/lib/vault-write-notice.mjs:170:39
-     while (kept.length > 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();
+     while (kept.length > 1 && kept.join("").length > NOTICE_MAX) kept.pop();

[Survived] StringLiteral
scripts/lib/vault-write-notice.mjs:171:26
-     const text = kept.join("\n");
+     const text = kept.join("");

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:173:10
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return true ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:173:10
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return false ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:173:10
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return text.length < NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;

[Survived] StringLiteral
scripts/lib/vault-write-notice.mjs:173:45
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return text.length <= NOTICE_MAX ? text : ``;

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:173:10
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return text.length > NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;

[Survived] MethodExpression
scripts/lib/vault-write-notice.mjs:173:48
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return text.length <= NOTICE_MAX ? text : `${text}…`;

[Survived] ArithmeticOperator
scripts/lib/vault-write-notice.mjs:173:62
-     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX - 1)}…`;
+     return text.length <= NOTICE_MAX ? text : `${text.slice(0, NOTICE_MAX + 1)}…`;

[Survived] ConditionalExpression
scripts/lib/vault-write-notice.mjs:192:7
-     if (items.length <= NAMED_AT_MOST) return items.join(", ");
+     if (false) return items.join(", ");

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:192:7
-     if (items.length <= NAMED_AT_MOST) return items.join(", ");
+     if (items.length < NAMED_AT_MOST) return items.join(", ");

[Survived] StringLiteral
scripts/lib/vault-write-notice.mjs:192:56
-     if (items.length <= NAMED_AT_MOST) return items.join(", ");
+     if (items.length <= NAMED_AT_MOST) return items.join("");

[Survived] StringLiteral
scripts/lib/vault-write-notice.mjs:194:24
-     return `${named.join(", ")} and ${items.length - named.length} more`;
+     return `${named.join("")} and ${items.length - named.length} more`;

[Survived] StringLiteral
scripts/update-offer-answer.mjs:38:3
-     "  later       ask me again tomorrow (repeatable for as long as you like)\n" +
+     "" +

[Survived] StringLiteral
scripts/update-offer-answer.mjs:39:3
-     "  no-thanks   not this version: +3 days, then +5 days, +3 weeks, +2 months, then no more for it\n" +
+     "" +

[Survived] StringLiteral
scripts/update-offer-answer.mjs:40:3
-     "  install     the update is being run now, so the offer stands aside while it does";
+     "";

[Survived] StringLiteral
scripts/update-offer-answer.mjs:52:74
-         return JSON.parse(readFileSync(join(brainDir, UPSTREAM_CACHE_REL), "utf8"));
+         return JSON.parse(readFileSync(join(brainDir, UPSTREAM_CACHE_REL), ""));

[Survived] BlockStatement
scripts/update-offer-answer.mjs:53:13
-       } catch {
-         return null;
-       }
+       } catch {}

[Survived] ArrowFunction
scripts/update-offer-answer.mjs:57:14
-     readState: (brainDir) => readOfferState({ brainDir }),
+     readState: () => undefined,

[Survived] ObjectLiteral
scripts/update-offer-answer.mjs:57:43
-     readState: (brainDir) => readOfferState({ brainDir }),
+     readState: (brainDir) => readOfferState({}),

[Survived] StringLiteral
scripts/update-offer-answer.mjs:76:14
-       deps.log("There is no update on offer right now, so there was nothing to record.");
+       deps.log("");

[Survived] StringLiteral
scripts/update-offer-answer.mjs:91:7
-         `I could not write your answer down, so nothing remembers it: the offer for ${verdict.target} will come ` +
+         `` +

[Survived] ConditionalExpression
scripts/update-offer-answer.mjs:103:7
-     if (state.silenced) return `Noted: ${version} will not be brought up again.`;
+     if (true) return `Noted: ${version} will not be brought up again.`;

[Survived] MethodExpression
scripts/update-offer-answer.mjs:104:16
-     const when = new Date(Date.parse(state.nextAskAt)).toISOString().slice(0, 10);
+     const when = new Date(Date.parse(state.nextAskAt)).toISOString();

[Survived] StringLiteral
scripts/vault-write-notice.mjs:38:38
-   export const NOTICE_STATE_REL = join(".cache", "write-notices.json");
+   export const NOTICE_STATE_REL = join("", "write-notices.json");

[Survived] StringLiteral
scripts/vault-write-notice.mjs:38:48
-   export const NOTICE_STATE_REL = join(".cache", "write-notices.json");
+   export const NOTICE_STATE_REL = join(".cache", "");

[Survived] StringLiteral
scripts/vault-write-notice.mjs:45:71
-   const fsIo = { existsSync, readFileSync: (path) => readFileSync(path, "utf8") };
+   const fsIo = { existsSync, readFileSync: (path) => readFileSync(path, "") };

[Survived] StringLiteral
scripts/vault-write-notice.mjs:48:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] ArrowFunction
scripts/vault-write-notice.mjs:58:14
-     readState: (brainDir) => readJson(join(brainDir, NOTICE_STATE_REL)),
+     readState: () => undefined,

[Survived] StringLiteral
scripts/vault-write-notice.mjs:69:61
-       return existsSync(path) ? JSON.parse(readFileSync(path, "utf8")) : null;
+       return existsSync(path) ? JSON.parse(readFileSync(path, "")) : null;

[Survived] BlockStatement
scripts/vault-write-notice.mjs:70:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] ObjectLiteral
scripts/vault-write-notice.mjs:77:30
-       mkdirSync(dirname(path), { recursive: true });
+       mkdirSync(dirname(path), {});

[Survived] BooleanLiteral
scripts/vault-write-notice.mjs:77:43
-       mkdirSync(dirname(path), { recursive: true });
+       mkdirSync(dirname(path), { recursive: false });

[Survived] StringLiteral
scripts/vault-write-notice.mjs:78:58
-       writeFileSync(path, JSON.stringify(value, null, 2) + "\n");
+       writeFileSync(path, JSON.stringify(value, null, 2) + "");

[Survived] ConditionalExpression
scripts/vault-write-notice.mjs:137:9
-       if (notice.updatedInput) payload.updatedInput = notice.updatedInput;
+       if (true) payload.updatedInput = notice.updatedInput;
