[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:106:59
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && true && typeof to === "string")

[Survived] EqualityOperator
scripts/lib/declared-spellings.mjs:106:59
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && from.length >= 0 && typeof to === "string")

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:86:99
-     const drift = universeDriftNotice({ notePath, pointer, registry, alreadySaid: said.universes ?? [] });
+     const drift = universeDriftNotice({ notePath, pointer, registry, alreadySaid: said.universes ?? ["Stryker was here"] });

[Survived] ArrayDeclaration
scripts/lib/vault-write-notice.mjs:89:76
-     const fresh = spelling.corrections.filter((one) => !(said.corrections ?? []).includes(correctionKey(one)));
+     const fresh = spelling.corrections.filter((one) => !(said.corrections ?? ["Stryker was here"]).includes(correctionKey(one)));

[Survived] EqualityOperator
scripts/lib/vault-write-notice.mjs:179:29
-     while (kept.length > 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();
+     while (kept.length > 1 && kept.join("\n").length >= NOTICE_MAX) kept.pop();

[Survived] StringLiteral
scripts/lib/vault-write-notice.mjs:179:39
-     while (kept.length > 1 && kept.join("\n").length > NOTICE_MAX) kept.pop();
+     while (kept.length > 1 && kept.join("").length > NOTICE_MAX) kept.pop();
