[Survived] ArrayDeclaration
scripts/lib/wiki-lint.mjs:66:52
-   export function buildResolver(notes, attachments = []) {
+   export function buildResolver(notes, attachments = ["Stryker was here"]) {

[Survived] Regex
scripts/lib/wiki-lint.mjs:74:31
-         register(suffix.replace(/\.md$/, ""), note.path); // folder/note, note
+         register(suffix.replace(/\.md/, ""), note.path); // folder/note, note
