[Survived] ConditionalExpression
scripts/lib/engine-fetch.mjs:43:7
-     if (!ok) return null;
+     if (false) return null;

[Survived] MethodExpression
scripts/lib/engine-fetch.mjs:52:10
-     return (out ?? "")
-       .split("\n")
-       .map((line) => {
-         const m = /\srefs\/tags\/(.+)$/.exec(line);
-         return m ? m[1].trim() : null;
-       })
-       .filter(Boolean);
+     return (out ?? "").split("\n").map(line => {
+     const m = /\srefs\/tags\/(.+)$/.exec(line);
+     return m ? m[1].trim() : null;
+   });

[Survived] Regex
scripts/lib/engine-fetch.mjs:55:17
-         const m = /\srefs\/tags\/(.+)$/.exec(line);
+         const m = /\srefs\/tags\/(.+)/.exec(line);

[Survived] MethodExpression
scripts/lib/engine-fetch.mjs:56:18
-         return m ? m[1].trim() : null;
+         return m ? m[1] : null;

[Survived] ArrowFunction
scripts/lib/engine-fetch.mjs:68:17
-     makeTempDir = () => mkdtempSync(join(tmpdir(), "sbg-engine-src-")),
+     makeTempDir = () => undefined,

[Survived] StringLiteral
scripts/lib/engine-fetch.mjs:68:50
-     makeTempDir = () => mkdtempSync(join(tmpdir(), "sbg-engine-src-")),
+     makeTempDir = () => mkdtempSync(join(tmpdir(), "")),

[Survived] ArrowFunction
scripts/lib/engine-fetch.mjs:69:15
-     removeDir = (d) => rmSync(d, { recursive: true, force: true }),
+     removeDir = () => undefined,

[Survived] ObjectLiteral
scripts/lib/engine-fetch.mjs:69:32
-     removeDir = (d) => rmSync(d, { recursive: true, force: true }),
+     removeDir = (d) => rmSync(d, {}),

[Survived] BooleanLiteral
scripts/lib/engine-fetch.mjs:69:45
-     removeDir = (d) => rmSync(d, { recursive: true, force: true }),
+     removeDir = (d) => rmSync(d, { recursive: false, force: true }),

[Survived] BooleanLiteral
scripts/lib/engine-fetch.mjs:69:58
-     removeDir = (d) => rmSync(d, { recursive: true, force: true }),
+     removeDir = (d) => rmSync(d, { recursive: true, force: false }),

[Survived] StringLiteral
scripts/lib/engine-fetch.mjs:87:9
-           `otherwise check your internet connection and try again.`,
+           ``,

[Survived] StringLiteral
scripts/lib/engine-fetch.mjs:96:71
-   export function readTargetManifest(dir, read = (p) => readFileSync(p, "utf8")) {
+   export function readTargetManifest(dir, read = (p) => readFileSync(p, "")) {

[Survived] ArrayDeclaration
scripts/lib/entrypoint-discipline.mjs:93:16
-     const args = [];
+     const args = ["Stryker was here"];

[Survived] EqualityOperator
scripts/lib/entrypoint-discipline.mjs:105:27
-         if (!(ch === ")" && nesting === 1)) args.push({ first: ch });
+         if (!(ch === ")" && nesting !== 1)) args.push({ first: ch });

[Survived] ConditionalExpression
scripts/lib/entrypoint-discipline.mjs:132:11
-         if (ch === "\\") out += source[++i] ?? "";
+         if (true) out += source[++i] ?? "";

[Survived] EqualityOperator
scripts/lib/entrypoint-discipline.mjs:132:11
-         if (ch === "\\") out += source[++i] ?? "";
+         if (ch !== "\\") out += source[++i] ?? "";

[Survived] ConditionalExpression
scripts/lib/entrypoint-discipline.mjs:133:16
-         else if (ch === quote) quote = null;
+         else if (false) quote = null;

[Survived] ConditionalExpression
scripts/lib/entrypoint-discipline.mjs:142:14
-         while (i < source.length && source[i] !== "\n") i++;
+         while (true && source[i] !== "\n") i++;
