[Survived] BlockStatement
scripts/session-status.mjs:138:44
-   function realOpenDatabase(dbPath, options) {
-     const require = createRequire(join(REPO, "rag", "package.json"));
-     const Database = require("better-sqlite3");
-     return new Database(dbPath, options);
-   }
+   function realOpenDatabase(dbPath, options) {}

[Survived] StringLiteral
scripts/session-status.mjs:139:44
-     const require = createRequire(join(REPO, "rag", "package.json"));
+     const require = createRequire(join(REPO, "", "package.json"));

[Survived] StringLiteral
scripts/session-status.mjs:139:51
-     const require = createRequire(join(REPO, "rag", "package.json"));
+     const require = createRequire(join(REPO, "rag", ""));

[Survived] ArrowFunction
scripts/session-status.mjs:234:48
-     const markerIo = { existsSync, readFileSync: (p) => readFileSync(p, "utf8"), writeFileSync, mkdirSync };
+     const markerIo = { existsSync, readFileSync: () => undefined, writeFileSync, mkdirSync };

[Survived] StringLiteral
scripts/session-status.mjs:234:71
-     const markerIo = { existsSync, readFileSync: (p) => readFileSync(p, "utf8"), writeFileSync, mkdirSync };
+     const markerIo = { existsSync, readFileSync: (p) => readFileSync(p, ""), writeFileSync, mkdirSync };

[Survived] ArrayDeclaration
scripts/session-status.mjs:250:9
-         : [];
+         : ["Stryker was here"];
