[Survived] Regex
scripts/lib/filed-note.mjs:37:14
-       .replace(/^-+|-+$/g, ""); // trim leading/trailing hyphens
+       .replace(/^-|-+$/g, ""); // trim leading/trailing hyphens

[Survived] Regex
scripts/lib/filed-note.mjs:37:14
-       .replace(/^-+|-+$/g, ""); // trim leading/trailing hyphens
+       .replace(/^-+|-$/g, ""); // trim leading/trailing hyphens

[Survived] EqualityOperator
scripts/lib/filed-note.mjs:114:31
-       .reduce((worst, tier) => (rank.indexOf(tier) > rank.indexOf(worst) ? tier : worst));
+       .reduce((worst, tier) => (rank.indexOf(tier) >= rank.indexOf(worst) ? tier : worst));

[Survived] Regex
scripts/lib/filed-note.mjs:257:44
-     return cardPath.split("/").pop().replace(/\.md$/, "").split("-")[0];
+     return cardPath.split("/").pop().replace(/\.md/, "").split("-")[0];

[Survived] StringLiteral
scripts/file-back-note.mjs:85:58
-         { existsSync, readFileSync: (p) => readFileSync(p, "utf-8") },
+         { existsSync, readFileSync: (p) => readFileSync(p, "") },

[Survived] StringLiteral
scripts/file-back-note.mjs:88:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] Regex
scripts/file-back-note.mjs:193:57
-         const firstName = String(spec.title).trim().split(/\s+/)[0];
+         const firstName = String(spec.title).trim().split(/\s/)[0];
