[Survived] LogicalOperator
scripts/lib/os-banner.mjs:36:25
-   const isNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith(".md");
+   const isNote = (rel) => rel.startsWith("vault/") || rel.toLowerCase().endsWith(".md");

[Survived] StringLiteral
scripts/lib/os-banner.mjs:36:40
-   const isNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith(".md");
+   const isNote = (rel) => rel.startsWith("") && rel.toLowerCase().endsWith(".md");

[Survived] StringLiteral
scripts/lib/os-banner.mjs:36:80
-   const isNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith(".md");
+   const isNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith("");

[Survived] StringLiteral
scripts/lib/os-banner.mjs:46:49
-   const escapePowerShell = (s) => s.replace(/`/g, "``").replace(/"/g, '`"').replace(/\$/g, "`$");
+   const escapePowerShell = (s) => s.replace(/`/g, "").replace(/"/g, '`"').replace(/\$/g, "`$");

[Survived] StringLiteral
scripts/lib/os-banner.mjs:88:7
-         `Add-Type -AssemblyName System.Windows.Forms; ` +
+         `` +

[Survived] StringLiteral
scripts/lib/os-banner.mjs:89:7
-         `$n = New-Object System.Windows.Forms.NotifyIcon; ` +
+         `` +

[Survived] StringLiteral
scripts/lib/os-banner.mjs:90:7
-         `$n.Icon = [System.Drawing.SystemIcons]::Information; ` +
+         `` +

[Survived] StringLiteral
scripts/lib/os-banner.mjs:91:7
-         `$n.Visible = $true; ` +
+         `` +

[Survived] StringLiteral
scripts/lib/os-banner.mjs:93:7
-         `[System.Windows.Forms.ToolTipIcon]::Info)`;
+         ``;

[Survived] StringLiteral
scripts/lib/os-banner.mjs:105:34
-     if ((env.REMOTE_SYNC_BANNER ?? "").trim() === "0") return false;
+     if ((env.REMOTE_SYNC_BANNER ?? "Stryker was here!").trim() === "0") return false;

[Survived] ConditionalExpression
scripts/lib/os-banner.mjs:121:11
-         if (body === null) return;
+         if (false) return;

[Survived] ConditionalExpression
scripts/lib/os-banner.mjs:123:11
-         if (request === null) return;
+         if (false) return;

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:45:80
-   const isNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith(".md");
+   const isNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith("");

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:56:45
-     if (names.length <= 1) return names[0] ?? "";
+     if (names.length <= 1) return names[0] ?? "Stryker was here!";

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:70:7
-     if (named.length === 0) return `${rest} of them`;
+     if (false) return `${rest} of them`;

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:70:34
-     if (named.length === 0) return `${rest} of them`;
+     if (named.length === 0) return ``;

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:71:72
-     return rest > 0 ? `${named.join(", ")} (+${rest} more)` : named.join(", ");
+     return rest > 0 ? `${named.join(", ")} (+${rest} more)` : named.join("");

[Survived] ArithmeticOperator
scripts/lib/remote-arrivals.mjs:81:20
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST + 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {

[Survived] EqualityOperator
scripts/lib/remote-arrivals.mjs:81:39
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST - 1; text.length >= DIRECTIVE_MAX && limit >= 0; limit--) {

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:81:70
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && true; limit--) {

[Survived] EqualityOperator
scripts/lib/remote-arrivals.mjs:81:70
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit > 0; limit--) {

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:106:16
-     const from = trace.authors?.length > 0 ? ` from ${joinNames(trace.authors)}` : "";
+     const from = true ? ` from ${joinNames(trace.authors)}` : "";

[Survived] EqualityOperator
scripts/lib/remote-arrivals.mjs:106:16
-     const from = trace.authors?.length > 0 ? ` from ${joinNames(trace.authors)}` : "";
+     const from = trace.authors?.length >= 0 ? ` from ${joinNames(trace.authors)}` : "";

[Survived] OptionalChaining
scripts/lib/remote-arrivals.mjs:106:16
-     const from = trace.authors?.length > 0 ? ` from ${joinNames(trace.authors)}` : "";
+     const from = trace.authors.length > 0 ? ` from ${joinNames(trace.authors)}` : "";

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:106:82
-     const from = trace.authors?.length > 0 ? ` from ${joinNames(trace.authors)}` : "";
+     const from = trace.authors?.length > 0 ? ` from ${joinNames(trace.authors)}` : "Stryker was here!";

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:109:51
-         ? `${countOf(notes.length, "note")}${from}${others.length > 0 ? ` and ${countOf(others.length, "other file")}` : ""}`
+         ? `${countOf(notes.length, "note")}${from}${true ? ` and ${countOf(others.length, "other file")}` : ""}`

[Survived] EqualityOperator
scripts/lib/remote-arrivals.mjs:109:51
-         ? `${countOf(notes.length, "note")}${from}${others.length > 0 ? ` and ${countOf(others.length, "other file")}` : ""}`
+         ? `${countOf(notes.length, "note")}${from}${others.length >= 0 ? ` and ${countOf(others.length, "other file")}` : ""}`

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:109:120
-         ? `${countOf(notes.length, "note")}${from}${others.length > 0 ? ` and ${countOf(others.length, "other file")}` : ""}`
+         ? `${countOf(notes.length, "note")}${from}${others.length > 0 ? ` and ${countOf(others.length, "other file")}` : "Stryker was here!"}`

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:113:88
-     const reRead = notes.length > 0 ? " Re-read any of those notes before editing it." : "";
+     const reRead = notes.length > 0 ? " Re-read any of those notes before editing it." : "Stryker was here!";

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:130:19
-     if (!blocked || (blocked.files ?? []).length === 0) return null;
+     if (!blocked || false) return null;

[Survived] ArrayDeclaration
scripts/lib/remote-arrivals.mjs:130:37
-     if (!blocked || (blocked.files ?? []).length === 0) return null;
+     if (!blocked || (blocked.files ?? ["Stryker was here"]).length === 0) return null;

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:131:19
-     const because = blocked.reason && blocked.reason !== "conflict" ? ` (${blocked.reason})` : "";
+     const because = true ? ` (${blocked.reason})` : "";

[Survived] LogicalOperator
scripts/lib/remote-arrivals.mjs:131:19
-     const because = blocked.reason && blocked.reason !== "conflict" ? ` (${blocked.reason})` : "";
+     const because = blocked.reason || blocked.reason !== "conflict" ? ` (${blocked.reason})` : "";

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:131:37
-     const because = blocked.reason && blocked.reason !== "conflict" ? ` (${blocked.reason})` : "";
+     const because = blocked.reason && true ? ` (${blocked.reason})` : "";

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:131:56
-     const because = blocked.reason && blocked.reason !== "conflict" ? ` (${blocked.reason})` : "";
+     const because = blocked.reason && blocked.reason !== "" ? ` (${blocked.reason})` : "";

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:131:94
-     const because = blocked.reason && blocked.reason !== "conflict" ? ` (${blocked.reason})` : "";
+     const because = blocked.reason && blocked.reason !== "conflict" ? ` (${blocked.reason})` : "Stryker was here!";

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:150:10
-     return parts.length > 0 ? parts.join(" ") : null;
+     return true ? parts.join(" ") : null;

[Survived] EqualityOperator
scripts/lib/remote-arrivals.mjs:150:10
-     return parts.length > 0 ? parts.join(" ") : null;
+     return parts.length >= 0 ? parts.join(" ") : null;

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:150:40
-     return parts.length > 0 ? parts.join(" ") : null;
+     return parts.length > 0 ? parts.join("") : null;

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:170:46
-           return JSON.parse(readFileSync(path, "utf8"));
+           return JSON.parse(readFileSync(path, ""));

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:179:69
-         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "utf8");
+         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "");

[Survived] BlockStatement
scripts/lib/remote-arrivals.mjs:182:23
-         } catch (error) {
-           rmSync(staging, { force: true });
-           throw error;
-         }
+         } catch (error) {}

[Survived] ObjectLiteral
scripts/lib/remote-arrivals.mjs:183:25
-           rmSync(staging, { force: true });
+           rmSync(staging, {});

[Survived] BooleanLiteral
scripts/lib/remote-arrivals.mjs:183:34
-           rmSync(staging, { force: true });
+           rmSync(staging, { force: false });

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:30:33
-   const defaultIsAlive = (pid) => {
-     try {
-       process.kill(pid, 0);
-       return true;
-     } catch (error) {
-       // EPERM: the process exists but is not ours — alive nonetheless.
-       return error?.code === "EPERM";
-     }
-   };
+   const defaultIsAlive = (pid) => {};

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:33:12
-       return true;
+       return false;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:31:7
-     try {
-       process.kill(pid, 0);
-       return true;
-     } catch (error) {
+     try {} catch (error) {

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:34:19
-     } catch (error) {
-       // EPERM: the process exists but is not ours — alive nonetheless.
-       return error?.code === "EPERM";
-     }
+     } catch (error) {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:36:12
-       return error?.code === "EPERM";
+       return true;

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:36:12
-       return error?.code === "EPERM";
+       return false;

[Survived] EqualityOperator
scripts/lib/remote-sync-gate.mjs:36:12
-       return error?.code === "EPERM";
+       return error?.code !== "EPERM";

[Survived] OptionalChaining
scripts/lib/remote-sync-gate.mjs:36:12
-       return error?.code === "EPERM";
+       return error.code === "EPERM";

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:36:28
-       return error?.code === "EPERM";
+       return error?.code === "";

[Survived] MethodExpression
scripts/lib/remote-sync-gate.mjs:50:26
-       const t = Date.parse(readFileSync(path, "utf8").trim());
+       const t = Date.parse(readFileSync(path, "utf8"));

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:52:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:71:20
-       if (!record || typeof record.pid !== "number") return false;
+       if (!record || false) return false;

[Survived] EqualityOperator
scripts/lib/remote-sync-gate.mjs:73:36
-       if (!Number.isFinite(since) || at - since > staleAfterMs) return false;
+       if (!Number.isFinite(since) || at - since >= staleAfterMs) return false;

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:82:11
-         if (error?.code === "EEXIST") return false;
+         if (true) return false;

[Survived] OptionalChaining
scripts/lib/remote-sync-gate.mjs:82:11
-         if (error?.code === "EEXIST") return false;
+         if (error.code === "EEXIST") return false;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:87:15
-       } finally {
-         closeSync(fd);
-       }
+       } finally {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:98:11
-         if (last !== null && at - last < minGapMs) return false;
+         if (true && at - last < minGapMs) return false;

[Survived] EqualityOperator
scripts/lib/remote-sync-gate.mjs:98:28
-         if (last !== null && at - last < minGapMs) return false;
+         if (last !== null && at - last <= minGapMs) return false;

[Survived] EqualityOperator
scripts/lib/remote-sync-gate.mjs:100:29
-         for (let attempt = 0; attempt < 2; attempt++) {
+         for (let attempt = 0; attempt <= 2; attempt++) {

[Survived] UpdateOperator
scripts/lib/remote-sync-gate.mjs:100:42
-         for (let attempt = 0; attempt < 2; attempt++) {
+         for (let attempt = 0; attempt < 2; attempt--) {

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:104:28
-             rmSync(lockPath, { force: true });
+             rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:104:37
-             rmSync(lockPath, { force: true });
+             rmSync(lockPath, { force: false });

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:105:17
-           } catch {
-             return false;
-           }
+           } catch {}

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:106:18
-             return false;
+             return true;

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:109:14
-         return false;
+         return true;

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:113:54
-           writeFileSync(lastPath, now().toISOString(), "utf8");
+           writeFileSync(lastPath, now().toISOString(), "");

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:118:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:118:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:45:3
-     "# What the live sync between machines just pulled in, kept for the next message to announce" +
+     "" +

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:46:3
-     " (this machine's own business — never commit it).";
+     "";

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:56:31
-     const ref = (upstreamRef ?? "").trim();
+     const ref = (upstreamRef ?? "Stryker was here!").trim();

[Survived] EqualityOperator
scripts/lib/remote-sync.mjs:58:7
-     if (slash <= 0 || slash === ref.length - 1) return null;
+     if (slash < 0 || slash === ref.length - 1) return null;

[Survived] ConditionalExpression
scripts/lib/remote-sync.mjs:58:21
-     if (slash <= 0 || slash === ref.length - 1) return null;
+     if (slash <= 0 || false) return null;

[Survived] ArithmeticOperator
scripts/lib/remote-sync.mjs:58:31
-     if (slash <= 0 || slash === ref.length - 1) return null;
+     if (slash <= 0 || slash === ref.length + 1) return null;

[Survived] MethodExpression
scripts/lib/remote-sync.mjs:62:51
-   const lines = (out) => out.split("\n").map((l) => l.trim()).filter(Boolean);
+   const lines = (out) => out.split("\n").map((l) => l).filter(Boolean);

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:64:85
-   const isVaultNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith(".md");
+   const isVaultNote = (rel) => rel.startsWith("vault/") && rel.toLowerCase().endsWith("");

[Survived] MethodExpression
scripts/lib/remote-sync.mjs:88:7
-     if (git(["remote"]).out.trim() === "") return "no-remote";
+     if (git(["remote"]).out === "") return "no-remote";

[Survived] MethodExpression
scripts/lib/remote-sync.mjs:115:21
-     const remoteSha = probe.out.trim().split(/\s+/)[0] ?? "";
+     const remoteSha = probe.out.split(/\s+/)[0] ?? "";

[Survived] Regex
scripts/lib/remote-sync.mjs:115:44
-     const remoteSha = probe.out.trim().split(/\s+/)[0] ?? "";
+     const remoteSha = probe.out.trim().split(/\s/)[0] ?? "";

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:115:57
-     const remoteSha = probe.out.trim().split(/\s+/)[0] ?? "";
+     const remoteSha = probe.out.trim().split(/\s+/)[0] ?? "Stryker was here!";

[Survived] ConditionalExpression
scripts/lib/remote-sync.mjs:116:7
-     if (remoteSha === "" || remoteSha === known) return "up-to-date";
+     if (false || remoteSha === known) return "up-to-date";

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:116:21
-     if (remoteSha === "" || remoteSha === known) return "up-to-date";
+     if (remoteSha === "Stryker was here!" || remoteSha === known) return "up-to-date";

[Survived] ArrayDeclaration
scripts/lib/remote-sync.mjs:124:72
-       return record({ readTrace, writeTrace }, { arrivedAt: null, files: [], authors: [], blocked: { files: conflicting, reason: "conflict" } });
+       return record({ readTrace, writeTrace }, { arrivedAt: null, files: ["Stryker was here"], authors: [], blocked: { files: conflicting, reason: "conflict" } });

[Survived] ArrayDeclaration
scripts/lib/remote-sync.mjs:124:85
-       return record({ readTrace, writeTrace }, { arrivedAt: null, files: [], authors: [], blocked: { files: conflicting, reason: "conflict" } });
+       return record({ readTrace, writeTrace }, { arrivedAt: null, files: [], authors: ["Stryker was here"], blocked: { files: conflicting, reason: "conflict" } });

[Survived] MethodExpression
scripts/lib/remote-sync.mjs:152:7
-     if (authors.some((a) => a !== me)) notify({ files, authors });
+     if (authors.every(a => a !== me)) notify({ files, authors });

[Survived] MethodExpression
scripts/remote-sync.mjs:114:15
-     const raw = (env?.REMOTE_SYNC_INTERVAL ?? "").trim();
+     const raw = env?.REMOTE_SYNC_INTERVAL ?? "";

[Survived] OptionalChaining
scripts/remote-sync.mjs:114:16
-     const raw = (env?.REMOTE_SYNC_INTERVAL ?? "").trim();
+     const raw = (env.REMOTE_SYNC_INTERVAL ?? "").trim();

[Survived] ConditionalExpression
scripts/remote-sync.mjs:115:7
-     if (!/^\d+$/.test(raw)) return DEFAULT_INTERVAL_MS;
+     if (false) return DEFAULT_INTERVAL_MS;

[Survived] Regex
scripts/remote-sync.mjs:115:8
-     if (!/^\d+$/.test(raw)) return DEFAULT_INTERVAL_MS;
+     if (!/\d+$/.test(raw)) return DEFAULT_INTERVAL_MS;

[Survived] Regex
scripts/remote-sync.mjs:115:8
-     if (!/^\d+$/.test(raw)) return DEFAULT_INTERVAL_MS;
+     if (!/^\d+/.test(raw)) return DEFAULT_INTERVAL_MS;

[Survived] MethodExpression
scripts/remote-sync.mjs:152:23
-       const hasRemote = git(["remote"]).out.trim().length > 0;
+       const hasRemote = git(["remote"]).out.length > 0;

[Survived] ObjectLiteral
scripts/remote-sync.mjs:174:27
-       notify: buildNotifier({ platform: process.platform, env, spawn }),
+       notify: buildNotifier({}),
