[Survived] StringLiteral
scripts/lib/os-banner.mjs:103:34
-     if ((env.REMOTE_SYNC_BANNER ?? "").trim() === "0") return false;
+     if ((env.REMOTE_SYNC_BANNER ?? "Stryker was here!").trim() === "0") return false;

[Survived] ConditionalExpression
scripts/lib/os-banner.mjs:130:9
-       if (request === null) return;
+       if (false) return;

[Survived] ArithmeticOperator
scripts/lib/remote-arrivals.mjs:88:20
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST + 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {

[Survived] EqualityOperator
scripts/lib/remote-arrivals.mjs:88:39
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST - 1; text.length >= DIRECTIVE_MAX && limit >= 0; limit--) {

[Survived] ConditionalExpression
scripts/lib/remote-arrivals.mjs:88:70
-     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && limit >= 0; limit--) {
+     for (let limit = NAMED_AT_MOST - 1; text.length > DIRECTIVE_MAX && true; limit--) {

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:177:46
-           return JSON.parse(readFileSync(path, "utf8"));
+           return JSON.parse(readFileSync(path, ""));

[Survived] StringLiteral
scripts/lib/remote-arrivals.mjs:186:69
-         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "utf8");
+         writeFileSync(staging, `${JSON.stringify(trace, null, 2)}\n`, "");

[Survived] BlockStatement
scripts/lib/remote-arrivals.mjs:189:23
-         } catch (error) {
-           rmSync(staging, { force: true });
-           throw error;
-         }
+         } catch (error) {}

[Survived] ObjectLiteral
scripts/lib/remote-arrivals.mjs:190:25
-           rmSync(staging, { force: true });
+           rmSync(staging, {});

[Survived] BooleanLiteral
scripts/lib/remote-arrivals.mjs:190:34
-           rmSync(staging, { force: true });
+           rmSync(staging, { force: false });

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:42:42
-       return JSON.parse(readFileSync(path, "utf8"));
+       return JSON.parse(readFileSync(path, ""));

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:43:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:56:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:86:11
-         if (error.code === "EEXIST") return false;
+         if (true) return false;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:91:15
-       } finally {
-         closeSync(fd);
-       }
+       } finally {}

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:102:11
-         if (last !== null && at - last < minGapMs) return false;
+         if (true && at - last < minGapMs) return false;

[Survived] ConditionalExpression
scripts/lib/remote-sync-gate.mjs:103:11
-         if (tryCreate(at)) return true;
+         if (false) return true;

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:109:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:109:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:111:16
-           return false;
+           return true;

[Survived] BlockStatement
scripts/lib/remote-sync-gate.mjs:110:15
-         } catch {
-           return false;
-         }
+         } catch {}

[Survived] StringLiteral
scripts/lib/remote-sync-gate.mjs:117:54
-           writeFileSync(lastPath, now().toISOString(), "utf8");
+           writeFileSync(lastPath, now().toISOString(), "");

[Survived] ObjectLiteral
scripts/lib/remote-sync-gate.mjs:122:26
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, {});

[Survived] BooleanLiteral
scripts/lib/remote-sync-gate.mjs:122:35
-           rmSync(lockPath, { force: true });
+           rmSync(lockPath, { force: false });

[Survived] StringLiteral
scripts/lib/remote-sync.mjs:57:31
-     const ref = (upstreamRef ?? "").trim();
+     const ref = (upstreamRef ?? "Stryker was here!").trim();

[Survived] Regex
scripts/lib/remote-sync.mjs:117:44
-     const remoteSha = probe.out.trim().split(/\s+/)[0];
+     const remoteSha = probe.out.trim().split(/\s/)[0];

[Survived] StringLiteral
scripts/remote-sync.mjs:114:45
-     const raw = (env?.REMOTE_SYNC_INTERVAL ?? "").trim();
+     const raw = (env?.REMOTE_SYNC_INTERVAL ?? "Stryker was here!").trim();

[Survived] MethodExpression
scripts/remote-sync.mjs:155:48
-       const unpushedCount = hasUpstream ? Number(git(["rev-list", "--count", "@{u}..HEAD"]).out.trim()) || 0 : 0;
+       const unpushedCount = hasUpstream ? Number(git(["rev-list", "--count", "@{u}..HEAD"]).out) || 0 : 0;
