[Survived] ConditionalExpression
scripts/verify-index.mjs:78:5
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
+   if (false) {

[Survived] BlockStatement
scripts/verify-index.mjs:78:53
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
-     process.exit(runVerifyIndex(process.argv.slice(2)));
-   }
+   if (isEntrypoint(import.meta.url, process.argv[1])) {}

[Survived] MethodExpression
scripts/verify-index.mjs:79:31
-     process.exit(runVerifyIndex(process.argv.slice(2)));
+     process.exit(runVerifyIndex(process.argv));
