[Survived] ConditionalExpression
rag/src/lib/frontmatter-parser.ts:53:5
-       universe !== DEFAULT_UNIVERSE && relativePath.startsWith(`${universe}/`)
+       true && relativePath.startsWith(`${universe}/`)

[Survived] Regex
rag/src/lib/frontmatter-parser.ts:70:31
-     const match = content.match(/^#\s+(.+)$/m);
+     const match = content.match(/^#\s+(.+)/m);

[Survived] Regex
rag/src/lib/frontmatter-parser.ts:70:31
-     const match = content.match(/^#\s+(.+)$/m);
+     const match = content.match(/^#\s(.+)$/m);

[Survived] StringLiteral
rag/src/lib/health-check.ts:86:24
-     depth: HealthDepth = "full",
+     depth: HealthDepth = "",

[Survived] UnaryOperator
rag/src/lib/health-check.ts:88:19
-     let indexRows = -1;
+     let indexRows = +1;

[Survived] BlockStatement
rag/src/lib/health-check.ts:91:11
-     } catch {
-       indexRows = -1;
-     }
+     } catch {}

[Survived] BooleanLiteral
rag/src/lib/health-check.ts:95:23
-     let embedderReady = false;
+     let embedderReady = true;

[Survived] BlockStatement
rag/src/lib/health-check.ts:104:13
-       } catch {
-         embedderReady = false;
-       }
+       } catch {}

[Survived] BlockStatement
rag/src/lib/health-check.ts:111:13
-       } catch {
-         embedderReady = false;
-         canaryHits = 0;
-       }
+       } catch {}

[Survived] BooleanLiteral
rag/src/lib/health-check.ts:117:27
-     let canaryNotePresent = false;
+     let canaryNotePresent = true;

[Survived] BlockStatement
rag/src/lib/health-check.ts:120:11
-     } catch {
-       canaryNotePresent = false;
-     }
+     } catch {}

[Survived] ConditionalExpression
rag/src/lib/health-check.ts:127:7
-     if (seams.crosscheck) {
+     if (true) {

[Survived] BlockStatement
rag/src/lib/health-check.ts:130:13
-       } catch {
-         outOfStepNotes = null;
-       }
+       } catch {}

[Survived] StringLiteral
rag/src/lib/health-check.ts:156:24
-     depth: HealthDepth = "full",
+     depth: HealthDepth = "",

[Survived] ConditionalExpression
rag/src/lib/health-check.ts:228:40
-             : `${outOfStep.length} note${outOfStep.length === 1 ? "" : "s"} the engine cannot ` +
+             : `${outOfStep.length} note${false ? "" : "s"} the engine cannot ` +

[Survived] StringLiteral
rag/src/lib/health-check.ts:228:65
-             : `${outOfStep.length} note${outOfStep.length === 1 ? "" : "s"} the engine cannot ` +
+             : `${outOfStep.length} note${outOfStep.length === 1 ? "Stryker was here!" : "s"} the engine cannot ` +

[Survived] ConditionalExpression
rag/src/lib/health-check.ts:229:32
-               `bring in step — ${outOfStep.length === 1 ? "" : "e.g. "}` +
+               `bring in step — ${false ? "" : "e.g. "}` +

[Survived] StringLiteral
rag/src/lib/health-check.ts:229:57
-               `bring in step — ${outOfStep.length === 1 ? "" : "e.g. "}` +
+               `bring in step — ${outOfStep.length === 1 ? "Stryker was here!" : "e.g. "}` +

[Survived] ConditionalExpression
rag/src/lib/index-crosscheck.ts:133:9
-       if (items.length === 0) return;
+       if (false) return;

[Survived] BlockStatement
rag/src/lib/vector-store.ts:19:28
-   function ragRoot(): string {
-     return resolve(dirname(fileURLToPath(import.meta.url)), "..", "..");
-   }
+   function ragRoot(): string {}

[Survived] StringLiteral
rag/src/lib/vector-store.ts:20:59
-     return resolve(dirname(fileURLToPath(import.meta.url)), "..", "..");
+     return resolve(dirname(fileURLToPath(import.meta.url)), "", "..");

[Survived] StringLiteral
rag/src/lib/vector-store.ts:20:65
-     return resolve(dirname(fileURLToPath(import.meta.url)), "..", "..");
+     return resolve(dirname(fileURLToPath(import.meta.url)), "..", "");

[Survived] BlockStatement
rag/src/lib/vector-store.ts:28:38
-   function rebuildBetterSqlite(): void {
-     const { command, args } = buildRebuildInvocation(process.platform);
-     execFileSync(command, args, { cwd: ragRoot(), stdio: "inherit" });
-   }
+   function rebuildBetterSqlite(): void {}

[Survived] ObjectLiteral
rag/src/lib/vector-store.ts:30:31
-     execFileSync(command, args, { cwd: ragRoot(), stdio: "inherit" });
+     execFileSync(command, args, {});

[Survived] StringLiteral
rag/src/lib/vector-store.ts:30:56
-     execFileSync(command, args, { cwd: ragRoot(), stdio: "inherit" });
+     execFileSync(command, args, { cwd: ragRoot(), stdio: "" });

[Survived] ConditionalExpression
rag/src/lib/vector-store.ts:178:7
-     if (!db) {
+     if (true) {

[Survived] BlockStatement
rag/src/lib/vector-store.ts:438:35
-   export function listIndexedDocs() {
-     return listIndexedDocsIn(getDb());
-   }
+   export function listIndexedDocs() {}

[Survived] BlockStatement
rag/src/lib/vector-store.ts:497:33
-   export function closeDb(): void {
-     if (db) {
-       db.close();
-       db = null;
-     }
-   }
+   export function closeDb(): void {}

[Survived] ConditionalExpression
rag/src/lib/vector-store.ts:498:7
-     if (db) {
+     if (true) {

[Survived] ConditionalExpression
rag/src/lib/vector-store.ts:498:7
-     if (db) {
+     if (false) {

[Survived] BlockStatement
rag/src/lib/vector-store.ts:498:11
-     if (db) {
-       db.close();
-       db = null;
-     }
+     if (db) {}
