[Survived] ConditionalExpression
scripts/lib/health-probe.mjs:73:7
-     if (optionalBroken.length > 0) {
+     if (false) {

[Survived] EqualityOperator
scripts/lib/health-probe.mjs:73:7
-     if (optionalBroken.length > 0) {
+     if (optionalBroken.length <= 0) {

[Survived] BlockStatement
scripts/lib/health-probe.mjs:73:34
-     if (optionalBroken.length > 0) {
-       sections.push(
-         [
-           "ℹ️ A mirrored source is behind (your brain still answers):",
-           ...optionalBroken.flatMap(bulletsFor),
-         ].join("\n"),
-       );
-     }
+     if (optionalBroken.length > 0) {}

[Survived] ArrayDeclaration
scripts/lib/health-probe.mjs:75:7
-         [
-           "ℹ️ A mirrored source is behind (your brain still answers):",
-           ...optionalBroken.flatMap(bulletsFor),
-         ].join("\n"),
+         [].join("\n"),

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:112:10
-     return `@echo off
-   REM Self-heal launcher for the local-mirror server (Windows). Generated by the installer.
-   REM Prepends the usual node locations to PATH before starting the server, so that npx is found even
-   REM if the app has a minimal PATH. Pure JS server (no native deps) → no rebuild, just the PATH self-heal.
-   ${pathPrependCmd()}
-   npx tsx local-mirror/src/server.ts
-   `;
+     return ``;

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:177:23
-       return { command: "cmd", args: ["/c", `.\\${name}`], cleanup: () => io.removeScript(ragDir, name) };
+       return { command: "", args: ["/c", `.\\${name}`], cleanup: () => io.removeScript(ragDir, name) };

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:177:43
-       return { command: "cmd", args: ["/c", `.\\${name}`], cleanup: () => io.removeScript(ragDir, name) };
+       return { command: "cmd", args: ["/c", ``], cleanup: () => io.removeScript(ragDir, name) };

[Survived] ArrowFunction
scripts/lib/rag-launcher.mjs:177:67
-       return { command: "cmd", args: ["/c", `.\\${name}`], cleanup: () => io.removeScript(ragDir, name) };
+       return { command: "cmd", args: ["/c", `.\\${name}`], cleanup: () => undefined };

[Survived] ObjectLiteral
scripts/lib/rag-launcher.mjs:179:10
-     return {
-       command: "/bin/sh",
-       args: ["-c", `${pathPrependSh()}\nexec npm install --silent`],
-       cleanup: () => {},
-     };
+     return {};

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:180:14
-       command: "/bin/sh",
+       command: "",

[Survived] ArrayDeclaration
scripts/lib/rag-launcher.mjs:181:11
-       args: ["-c", `${pathPrependSh()}\nexec npm install --silent`],
+       args: [],

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:181:12
-       args: ["-c", `${pathPrependSh()}\nexec npm install --silent`],
+       args: ["", `${pathPrependSh()}\nexec npm install --silent`],

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:181:18
-       args: ["-c", `${pathPrependSh()}\nexec npm install --silent`],
+       args: ["-c", ``],

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:191:51
-   export function minimalPathEnv(platform, baseEnv) {
-     if (platform === "win32") {
-       // cmd.exe must stay findable (the smoke-test invokes it) → we keep just
-       // System32; node will come from run-node.cmd's self-heal.
-       const systemRoot = baseEnv.SystemRoot || "C:\\Windows";
-       return { ...baseEnv, PATH: `${systemRoot}\\System32` };
-     }
-     // posix: sh is launched by absolute path (/bin/sh) → empty PATH, node will come
-     // ONLY from the self-heal → proof that the wrapper is self-sufficient.
-     return { ...baseEnv, PATH: "" };
-   }
+   export function minimalPathEnv(platform, baseEnv) {}

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:192:7
-     if (platform === "win32") {
+     if (true) {

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:192:7
-     if (platform === "win32") {
+     if (false) {

[Survived] EqualityOperator
scripts/lib/rag-launcher.mjs:192:7
-     if (platform === "win32") {
+     if (platform !== "win32") {

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:192:20
-     if (platform === "win32") {
+     if (platform === "") {

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:192:29
-     if (platform === "win32") {
-       // cmd.exe must stay findable (the smoke-test invokes it) → we keep just
-       // System32; node will come from run-node.cmd's self-heal.
-       const systemRoot = baseEnv.SystemRoot || "C:\\Windows";
-       return { ...baseEnv, PATH: `${systemRoot}\\System32` };
-     }
+     if (platform === "win32") {}

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:195:24
-       const systemRoot = baseEnv.SystemRoot || "C:\\Windows";
+       const systemRoot = true;

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:195:24
-       const systemRoot = baseEnv.SystemRoot || "C:\\Windows";
+       const systemRoot = false;

[Survived] LogicalOperator
scripts/lib/rag-launcher.mjs:195:24
-       const systemRoot = baseEnv.SystemRoot || "C:\\Windows";
+       const systemRoot = baseEnv.SystemRoot && "C:\\Windows";

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:195:46
-       const systemRoot = baseEnv.SystemRoot || "C:\\Windows";
+       const systemRoot = baseEnv.SystemRoot || "";

[Survived] ObjectLiteral
scripts/lib/rag-launcher.mjs:196:12
-       return { ...baseEnv, PATH: `${systemRoot}\\System32` };
+       return {};

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:196:32
-       return { ...baseEnv, PATH: `${systemRoot}\\System32` };
+       return { ...baseEnv, PATH: `` };

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:200:30
-     return { ...baseEnv, PATH: "" };
+     return { ...baseEnv, PATH: "Stryker was here!" };

[Survived] ObjectLiteral
scripts/lib/rag-launcher.mjs:200:10
-     return { ...baseEnv, PATH: "" };
+     return {};

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:220:61
-   export function nodeHookCommand(platform, projectRootPosix) {
-     if (platform === "win32") {
-       return `${projectRootPosix}/scripts/run-node.cmd`;
-     }
-     return `/bin/sh \\"${projectRootPosix}/scripts/run-node.sh\\"`;
-   }
+   export function nodeHookCommand(platform, projectRootPosix) {}

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:221:7
-     if (platform === "win32") {
+     if (true) {

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:221:7
-     if (platform === "win32") {
+     if (false) {

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:221:20
-     if (platform === "win32") {
+     if (platform === "") {

[Survived] EqualityOperator
scripts/lib/rag-launcher.mjs:221:7
-     if (platform === "win32") {
+     if (platform !== "win32") {

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:221:29
-     if (platform === "win32") {
-       return `${projectRootPosix}/scripts/run-node.cmd`;
-     }
+     if (platform === "win32") {}

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:222:12
-       return `${projectRootPosix}/scripts/run-node.cmd`;
+       return ``;

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:224:10
-     return `/bin/sh \\"${projectRootPosix}/scripts/run-node.sh\\"`;
+     return ``;

[Survived] OptionalChaining
scripts/lib/rag-launcher.mjs:231:15
-     const srv = mcp?.mcpServers?.["vault-rag"];
+     const srv = mcp?.mcpServers["vault-rag"];

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:230:49
-   export function applyRagLauncher(mcp, platform) {
-     const srv = mcp?.mcpServers?.["vault-rag"];
-     if (!srv) return mcp;
-     if (platform === "win32") {
-       srv.command = "cmd";
-       srv.args = ["/c", "rag\\launch.cmd"];
-     } else {
-       srv.command = "/bin/sh";
-       srv.args = ["rag/launch.sh"];
-     }
-     return mcp;
-   }
+   export function applyRagLauncher(mcp, platform) {}

[Survived] OptionalChaining
scripts/lib/rag-launcher.mjs:231:15
-     const srv = mcp?.mcpServers?.["vault-rag"];
+     const srv = mcp.mcpServers?.["vault-rag"];

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:231:33
-     const srv = mcp?.mcpServers?.["vault-rag"];
+     const srv = mcp?.mcpServers?.[""];

[Survived] BooleanLiteral
scripts/lib/rag-launcher.mjs:232:7
-     if (!srv) return mcp;
+     if (srv) return mcp;

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:232:7
-     if (!srv) return mcp;
+     if (true) return mcp;

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:232:7
-     if (!srv) return mcp;
+     if (false) return mcp;

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:233:7
-     if (platform === "win32") {
+     if (true) {

[Survived] ConditionalExpression
scripts/lib/rag-launcher.mjs:233:7
-     if (platform === "win32") {
+     if (false) {

[Survived] EqualityOperator
scripts/lib/rag-launcher.mjs:233:7
-     if (platform === "win32") {
+     if (platform !== "win32") {

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:233:20
-     if (platform === "win32") {
+     if (platform === "") {

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:234:19
-       srv.command = "cmd";
+       srv.command = "";

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:233:29
-     if (platform === "win32") {
-       srv.command = "cmd";
-       srv.args = ["/c", "rag\\launch.cmd"];
-     } else {
+     if (platform === "win32") {} else {

[Survived] ArrayDeclaration
scripts/lib/rag-launcher.mjs:235:16
-       srv.args = ["/c", "rag\\launch.cmd"];
+       srv.args = [];

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:235:17
-       srv.args = ["/c", "rag\\launch.cmd"];
+       srv.args = ["", "rag\\launch.cmd"];

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:235:23
-       srv.args = ["/c", "rag\\launch.cmd"];
+       srv.args = ["/c", ""];

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:237:19
-       srv.command = "/bin/sh";
+       srv.command = "";

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:236:10
-     } else {
-       srv.command = "/bin/sh";
-       srv.args = ["rag/launch.sh"];
-     }
+     } else {}

[Survived] ArrayDeclaration
scripts/lib/rag-launcher.mjs:238:16
-       srv.args = ["rag/launch.sh"];
+       srv.args = [];

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:238:17
-       srv.args = ["rag/launch.sh"];
+       srv.args = [""];

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:247:47
-   export function applyLaunchers(mcp, platform) {
-     return applyLocalMirrorLauncher(applyRagLauncher(mcp, platform), platform);
-   }
+   export function applyLaunchers(mcp, platform) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:16:26
-   const PROFILE_FILENAME = "universe.md";
+   const PROFILE_FILENAME = "";

[Survived] ArrowFunction
scripts/lib/universe-profile.mjs:26:27
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = () => undefined;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:26:41
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = (universe) => true;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:26:41
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = (universe) => false;

[Survived] LogicalOperator
scripts/lib/universe-profile.mjs:26:41
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = (universe) => !universe && universe === DEFAULT_UNIVERSE;

[Survived] BooleanLiteral
scripts/lib/universe-profile.mjs:26:41
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = (universe) => universe || universe === DEFAULT_UNIVERSE;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:26:54
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = (universe) => !universe || false;

[Survived] EqualityOperator
scripts/lib/universe-profile.mjs:26:54
-   const isDefaultUniverse = (universe) => !universe || universe === DEFAULT_UNIVERSE;
+   const isDefaultUniverse = (universe) => !universe || universe !== DEFAULT_UNIVERSE;

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:33:47
-   export function universeProfilePath(universe) {
-     return isDefaultUniverse(universe) ? PROFILE_FILENAME : `${universe}/${PROFILE_FILENAME}`;
-   }
+   export function universeProfilePath(universe) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:34:59
-     return isDefaultUniverse(universe) ? PROFILE_FILENAME : `${universe}/${PROFILE_FILENAME}`;
+     return isDefaultUniverse(universe) ? PROFILE_FILENAME : ``;

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:42:61
-   export function readUniverseProfile(io, vaultDir, universe) {
-     const path = `${vaultDir}/${universeProfilePath(universe)}`;
-     return io.existsSync(path) ? io.readFileSync(path) : null;
-   }
+   export function readUniverseProfile(io, vaultDir, universe) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:43:16
-     const path = `${vaultDir}/${universeProfilePath(universe)}`;
+     const path = ``;

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:53:61
-   export function writeUniverseProfile(io, vaultDir, answers) {
-     const { path, content } = renderUniverseProfile(answers);
-     const absolute = `${vaultDir}/${path}`;
-     if (io.existsSync(absolute)) return { ok: false, reason: "exists", path };
-     io.mkdirSync(dirnamePosix(absolute), { recursive: true });
-     io.writeFileSync(absolute, content);
-     return { ok: true, path };
-   }
+   export function writeUniverseProfile(io, vaultDir, answers) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:55:20
-     const absolute = `${vaultDir}/${path}`;
+     const absolute = ``;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:56:7
-     if (io.existsSync(absolute)) return { ok: false, reason: "exists", path };
+     if (true) return { ok: false, reason: "exists", path };

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:56:7
-     if (io.existsSync(absolute)) return { ok: false, reason: "exists", path };
+     if (false) return { ok: false, reason: "exists", path };

[Survived] ObjectLiteral
scripts/lib/universe-profile.mjs:56:39
-     if (io.existsSync(absolute)) return { ok: false, reason: "exists", path };
+     if (io.existsSync(absolute)) return {};

[Survived] BooleanLiteral
scripts/lib/universe-profile.mjs:56:45
-     if (io.existsSync(absolute)) return { ok: false, reason: "exists", path };
+     if (io.existsSync(absolute)) return { ok: true, reason: "exists", path };

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:56:60
-     if (io.existsSync(absolute)) return { ok: false, reason: "exists", path };
+     if (io.existsSync(absolute)) return { ok: false, reason: "", path };

[Survived] ObjectLiteral
scripts/lib/universe-profile.mjs:59:10
-     return { ok: true, path };
+     return {};

[Survived] BooleanLiteral
scripts/lib/universe-profile.mjs:59:16
-     return { ok: true, path };
+     return { ok: false, path };

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:71:26
-   const NUDGE_STATE_FILE = "profile-nudges.json";
+   const NUDGE_STATE_FILE = "";

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:74:59
-   export function profileCaptureDeclined(io, dir, universe) {
-     return readDeclined(io, dir).includes(universe);
-   }
+   export function profileCaptureDeclined(io, dir, universe) {}

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:79:58
-   export function declineProfileCapture(io, dir, universe) {
-     const declined = [...new Set([...readDeclined(io, dir), universe])].sort();
-     io.mkdirSync(dir, { recursive: true });
-     io.writeFileSync(`${dir}/${NUDGE_STATE_FILE}`, JSON.stringify({ declined }, null, 2) + "\n");
-   }
+   export function declineProfileCapture(io, dir, universe) {}

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:80:32
-     const declined = [...new Set([...readDeclined(io, dir), universe])].sort();
+     const declined = [...new Set([])].sort();

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:80:20
-     const declined = [...new Set([...readDeclined(io, dir), universe])].sort();
+     const declined = [].sort();

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:82:20
-     io.writeFileSync(`${dir}/${NUDGE_STATE_FILE}`, JSON.stringify({ declined }, null, 2) + "\n");
+     io.writeFileSync(``, JSON.stringify({ declined }, null, 2) + "\n");

[Survived] ObjectLiteral
scripts/lib/universe-profile.mjs:82:65
-     io.writeFileSync(`${dir}/${NUDGE_STATE_FILE}`, JSON.stringify({ declined }, null, 2) + "\n");
+     io.writeFileSync(`${dir}/${NUDGE_STATE_FILE}`, JSON.stringify({}, null, 2) + "\n");

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:87:32
-   function readDeclined(io, dir) {
-     const path = `${dir}/${NUDGE_STATE_FILE}`;
-     if (!io.existsSync(path)) return [];
-     try {
-       const parsed = JSON.parse(io.readFileSync(path));
-       return Array.isArray(parsed?.declined) ? parsed.declined : [];
-     } catch {
-       return [];
-     }
-   }
+   function readDeclined(io, dir) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:88:16
-     const path = `${dir}/${NUDGE_STATE_FILE}`;
+     const path = ``;

[Survived] BooleanLiteral
scripts/lib/universe-profile.mjs:89:7
-     if (!io.existsSync(path)) return [];
+     if (io.existsSync(path)) return [];

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:89:7
-     if (!io.existsSync(path)) return [];
+     if (true) return [];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:89:36
-     if (!io.existsSync(path)) return [];
+     if (!io.existsSync(path)) return ["Stryker was here"];

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:90:7
-     try {
-       const parsed = JSON.parse(io.readFileSync(path));
-       return Array.isArray(parsed?.declined) ? parsed.declined : [];
-     } catch {
+     try {} catch {

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:93:11
-     } catch {
-       return [];
-     }
+     } catch {}

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:103:81
-   export function renderUniverseDigest(raw, { maxLines = DIGEST_MAX_LINES } = {}) {
-     const { frontmatter, body } = parseNote(raw);
-     const sections = bodySections(body);
-     const lines = [
-       identityLine(frontmatter),
-       ...sections.about,
-       ...listLine("People", sections.people),
-       ...listLine("Topics", sections.topics),
-       ...listLine("Connector accounts", sections.connectors),
-     ];
-     if (lines.length <= maxLines) return lines.join("\n");
-     // Truncation names the note, so the session can go read the rest on purpose
-     // instead of acting on a profile it does not know is partial.
-     return [
-       ...lines.slice(0, maxLines - 1),
-       `(profile truncated — the full page is ${vaultNotePath(frontmatter.universe)})`,
-     ].join("\n");
-   }
+   export function renderUniverseDigest(raw, { maxLines = DIGEST_MAX_LINES } = {}) {}

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:106:17
-     const lines = [
-       identityLine(frontmatter),
-       ...sections.about,
-       ...listLine("People", sections.people),
-       ...listLine("Topics", sections.topics),
-       ...listLine("Connector accounts", sections.connectors),
-     ];
+     const lines = [];

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:109:17
-       ...listLine("People", sections.people),
+       ...listLine("", sections.people),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:110:17
-       ...listLine("Topics", sections.topics),
+       ...listLine("", sections.topics),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:111:17
-       ...listLine("Connector accounts", sections.connectors),
+       ...listLine("", sections.connectors),

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:113:7
-     if (lines.length <= maxLines) return lines.join("\n");
+     if (true) return lines.join("\n");

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:113:7
-     if (lines.length <= maxLines) return lines.join("\n");
+     if (false) return lines.join("\n");

[Survived] EqualityOperator
scripts/lib/universe-profile.mjs:113:7
-     if (lines.length <= maxLines) return lines.join("\n");
+     if (lines.length < maxLines) return lines.join("\n");

[Survived] EqualityOperator
scripts/lib/universe-profile.mjs:113:7
-     if (lines.length <= maxLines) return lines.join("\n");
+     if (lines.length > maxLines) return lines.join("\n");

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:113:51
-     if (lines.length <= maxLines) return lines.join("\n");
+     if (lines.length <= maxLines) return lines.join("");

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:116:10
-     return [
-       ...lines.slice(0, maxLines - 1),
-       `(profile truncated — the full page is ${vaultNotePath(frontmatter.universe)})`,
-     ].join("\n");
+     return [].join("\n");

[Survived] MethodExpression
scripts/lib/universe-profile.mjs:117:8
-       ...lines.slice(0, maxLines - 1),
+       ...lines,

[Survived] ArithmeticOperator
scripts/lib/universe-profile.mjs:117:23
-       ...lines.slice(0, maxLines - 1),
+       ...lines.slice(0, maxLines + 1),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:118:5
-       `(profile truncated — the full page is ${vaultNotePath(frontmatter.universe)})`,
+       ``,

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:119:10
-     ].join("\n");
+     ].join("");

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:126:65
-   export function renderUniverseSynthesis(raw, { universe } = {}) {
-     const { frontmatter } = parseNote(raw);
-     // The path is stated by the caller when it knows it, because the caller LOCATED
-     // the file: that is a fact, where the frontmatter is a claim a hand-edit can lose.
-     // A pointer to a note that is not there would be worse than no pointer at all.
-     const at = universe === undefined ? frontmatter.universe : universe;
-     return [
-       identityLine(frontmatter),
-       `Full profile: ${vaultNotePath(at)} — read it when the answer depends ` +
-         `on the people, tools or scope here.`,
-       "(for the description itself, they can ask `/switch`)",
-     ].join("\n");
-   }
+   export function renderUniverseSynthesis(raw, { universe } = {}) {}

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:131:14
-     const at = universe === undefined ? frontmatter.universe : universe;
+     const at = true ? frontmatter.universe : universe;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:131:14
-     const at = universe === undefined ? frontmatter.universe : universe;
+     const at = false ? frontmatter.universe : universe;

[Survived] EqualityOperator
scripts/lib/universe-profile.mjs:131:14
-     const at = universe === undefined ? frontmatter.universe : universe;
+     const at = universe !== undefined ? frontmatter.universe : universe;

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:134:5
-       `Full profile: ${vaultNotePath(at)} — read it when the answer depends ` +
+       `` +

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:132:10
-     return [
-       identityLine(frontmatter),
-       `Full profile: ${vaultNotePath(at)} — read it when the answer depends ` +
-         `on the people, tools or scope here.`,
-       "(for the description itself, they can ask `/switch`)",
-     ].join("\n");
+     return [].join("\n");

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:135:7
-         `on the people, tools or scope here.`,
+         ``,

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:136:5
-       "(for the description itself, they can ask `/switch`)",
+       "",

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:137:10
-     ].join("\n");
+     ].join("");

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:143:36
-   function identityLine(frontmatter) {
-     const kind = frontmatter.kind ? ` (${frontmatter.kind})` : "";
-     const details = [
-       frontmatter.role ? `your role: ${frontmatter.role}` : null,
-       frontmatter.period ? `period: ${frontmatter.period}` : null,
-     ].filter(Boolean);
-     const tail = details.length ? ` — ${details.join(", ")}` : "";
-     return `${frontmatter.displayName}${kind}${tail}.`;
-   }
+   function identityLine(frontmatter) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:144:35
-     const kind = frontmatter.kind ? ` (${frontmatter.kind})` : "";
+     const kind = frontmatter.kind ? `` : "";

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:144:62
-     const kind = frontmatter.kind ? ` (${frontmatter.kind})` : "";
+     const kind = frontmatter.kind ? ` (${frontmatter.kind})` : "Stryker was here!";

[Survived] MethodExpression
scripts/lib/universe-profile.mjs:145:19
-     const details = [
-       frontmatter.role ? `your role: ${frontmatter.role}` : null,
-       frontmatter.period ? `period: ${frontmatter.period}` : null,
-     ].filter(Boolean);
+     const details = [frontmatter.role ? `your role: ${frontmatter.role}` : null, frontmatter.period ? `period: ${frontmatter.period}` : null];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:145:19
-     const details = [
-       frontmatter.role ? `your role: ${frontmatter.role}` : null,
-       frontmatter.period ? `period: ${frontmatter.period}` : null,
-     ].filter(Boolean);
+     const details = [].filter(Boolean);

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:146:24
-       frontmatter.role ? `your role: ${frontmatter.role}` : null,
+       frontmatter.role ? `` : null,

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:147:26
-       frontmatter.period ? `period: ${frontmatter.period}` : null,
+       frontmatter.period ? `` : null,

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:149:33
-     const tail = details.length ? ` — ${details.join(", ")}` : "";
+     const tail = details.length ? `` : "";

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:149:52
-     const tail = details.length ? ` — ${details.join(", ")}` : "";
+     const tail = details.length ? ` — ${details.join("")}` : "";

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:149:62
-     const tail = details.length ? ` — ${details.join(", ")}` : "";
+     const tail = details.length ? ` — ${details.join(", ")}` : "Stryker was here!";

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:150:10
-     return `${frontmatter.displayName}${kind}${tail}.`;
+     return ``;

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:155:34
-   function vaultNotePath(universe) {
-     return `vault/${universeProfilePath(universe)}`;
-   }
+   function vaultNotePath(universe) {}

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:160:33
-   function listLine(title, items) {
-     return items.length ? [`${title}: ${items.join(", ")}.`] : [];
-   }
+   function listLine(title, items) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:156:10
-     return `vault/${universeProfilePath(universe)}`;
+     return ``;

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:161:25
-     return items.length ? [`${title}: ${items.join(", ")}.`] : [];
+     return items.length ? [] : [];

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:161:26
-     return items.length ? [`${title}: ${items.join(", ")}.`] : [];
+     return items.length ? [``] : [];

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:161:50
-     return items.length ? [`${title}: ${items.join(", ")}.`] : [];
+     return items.length ? [`${title}: ${items.join("")}.`] : [];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:161:62
-     return items.length ? [`${title}: ${items.join(", ")}.`] : [];
+     return items.length ? [`${title}: ${items.join(", ")}.`] : ["Stryker was here"];

[Survived] ObjectLiteral
scripts/lib/universe-profile.mjs:167:18
-   const SECTIONS = { People: "people", Topics: "topics", "Connector accounts": "connectors" };
+   const SECTIONS = {};

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:167:78
-   const SECTIONS = { People: "people", Topics: "topics", "Connector accounts": "connectors" };
+   const SECTIONS = { People: "people", Topics: "topics", "Connector accounts": "" };

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:167:28
-   const SECTIONS = { People: "people", Topics: "topics", "Connector accounts": "connectors" };
+   const SECTIONS = { People: "", Topics: "topics", "Connector accounts": "connectors" };

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:167:46
-   const SECTIONS = { People: "people", Topics: "topics", "Connector accounts": "connectors" };
+   const SECTIONS = { People: "people", Topics: "", "Connector accounts": "connectors" };
