[Survived] BlockStatement
scripts/lib/universe-profile.mjs:173:29
-   function bodySections(body) {
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
-     let current = "about";
-     for (const line of body.split("\n")) {
-       const heading = line.match(/^##\s+(.*)$/);
-       if (heading) {
-         current = SECTIONS[heading[1].trim()] ?? "other";
-         continue;
-       }
-       if (line.startsWith("# ") || line.trim() === "") continue;
-       // The free text is quoted as written; list sections are quoted as values, so
-       // the digest can join them into one line instead of a bullet list.
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
-     }
-     return out;
-   }
+   function bodySections(body) {}

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:174:48
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
+     const out = { about: [], people: [], topics: ["Stryker was here"], connectors: [], other: [] };

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:174:24
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
+     const out = { about: ["Stryker was here"], people: [], topics: [], connectors: [], other: [] };

[Survived] ObjectLiteral
scripts/lib/universe-profile.mjs:174:15
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
+     const out = {};

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:174:36
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
+     const out = { about: [], people: ["Stryker was here"], topics: [], connectors: [], other: [] };

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:174:64
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
+     const out = { about: [], people: [], topics: [], connectors: ["Stryker was here"], other: [] };

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:175:17
-     let current = "about";
+     let current = "";

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:176:40
-     for (const line of body.split("\n")) {
-       const heading = line.match(/^##\s+(.*)$/);
-       if (heading) {
-         current = SECTIONS[heading[1].trim()] ?? "other";
-         continue;
-       }
-       if (line.startsWith("# ") || line.trim() === "") continue;
-       // The free text is quoted as written; list sections are quoted as values, so
-       // the digest can join them into one line instead of a bullet list.
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
-     }
+     for (const line of body.split("\n")) {}

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:176:33
-     for (const line of body.split("\n")) {
+     for (const line of body.split("")) {

[Survived] Regex
scripts/lib/universe-profile.mjs:177:32
-       const heading = line.match(/^##\s+(.*)$/);
+       const heading = line.match(/^##\S+(.*)$/);

[Survived] Regex
scripts/lib/universe-profile.mjs:177:32
-       const heading = line.match(/^##\s+(.*)$/);
+       const heading = line.match(/^##\s+(.)$/);

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:178:9
-       if (heading) {
+       if (true) {

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:178:9
-       if (heading) {
+       if (false) {

[Survived] LogicalOperator
scripts/lib/universe-profile.mjs:179:17
-         current = SECTIONS[heading[1].trim()] ?? "other";
+         current = SECTIONS[heading[1].trim()] && "other";

[Survived] BlockStatement
scripts/lib/universe-profile.mjs:178:18
-       if (heading) {
-         current = SECTIONS[heading[1].trim()] ?? "other";
-         continue;
-       }
+       if (heading) {}

[Survived] MethodExpression
scripts/lib/universe-profile.mjs:179:26
-         current = SECTIONS[heading[1].trim()] ?? "other";
+         current = SECTIONS[heading[1]] ?? "other";

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:182:9
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (true) continue;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:182:9
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (false) continue;

[Survived] LogicalOperator
scripts/lib/universe-profile.mjs:182:9
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (line.startsWith("# ") && line.trim() === "") continue;

[Survived] MethodExpression
scripts/lib/universe-profile.mjs:182:9
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (line.endsWith("# ") || line.trim() === "") continue;

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:182:25
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (line.startsWith("") || line.trim() === "") continue;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:182:34
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (line.startsWith("# ") || false) continue;

[Survived] EqualityOperator
scripts/lib/universe-profile.mjs:182:34
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (line.startsWith("# ") || line.trim() !== "") continue;

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:182:50
-       if (line.startsWith("# ") || line.trim() === "") continue;
+       if (line.startsWith("# ") || line.trim() === "Stryker was here!") continue;

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:185:23
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
+       out[current].push(true ? line : line.replace(/^[-*]\s*/, ""));

[Survived] EqualityOperator
scripts/lib/universe-profile.mjs:185:23
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
+       out[current].push(current !== "about" ? line : line.replace(/^[-*]\s*/, ""));

[Survived] Regex
scripts/lib/universe-profile.mjs:185:65
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
+       out[current].push(current === "about" ? line : line.replace(/^[^-*]\s*/, ""));

[Survived] Regex
scripts/lib/universe-profile.mjs:185:65
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
+       out[current].push(current === "about" ? line : line.replace(/^[-*]\S*/, ""));

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:185:77
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
+       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, "Stryker was here!"));

[Survived] BooleanLiteral
scripts/lib/universe-profile.mjs:198:7
-     if (!today) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");
+     if (today) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:198:7
-     if (!today) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");
+     if (true) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:198:7
-     if (!today) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");
+     if (false) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:198:31
-     if (!today) throw new Error("today (YYYY-MM-DD) is required to stamp created/updated");
+     if (!today) throw new Error("");

[Survived] BooleanLiteral
scripts/lib/universe-profile.mjs:199:7
-     if (!displayName) throw new Error("displayName is required: it is the profile note's title");
+     if (displayName) throw new Error("displayName is required: it is the profile note's title");

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:199:7
-     if (!displayName) throw new Error("displayName is required: it is the profile note's title");
+     if (true) throw new Error("displayName is required: it is the profile note's title");

[Survived] ConditionalExpression
scripts/lib/universe-profile.mjs:199:7
-     if (!displayName) throw new Error("displayName is required: it is the profile note's title");
+     if (false) throw new Error("displayName is required: it is the profile note's title");

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:199:37
-     if (!displayName) throw new Error("displayName is required: it is the profile note's title");
+     if (!displayName) throw new Error("");

[Survived] ArrowFunction
scripts/lib/universe-profile.mjs:202:20
-     const optional = (key, value) => (value ? [`${key}: ${value}`] : []);
+     const optional = () => undefined;

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:202:45
-     const optional = (key, value) => (value ? [`${key}: ${value}`] : []);
+     const optional = (key, value) => (value ? [] : []);

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:202:46
-     const optional = (key, value) => (value ? [`${key}: ${value}`] : []);
+     const optional = (key, value) => (value ? [``] : []);

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:203:23
-     const frontmatter = [
-       "---",
-       "type: universe",
-       `created: ${today}`,
-       `updated: ${today}`,
-       "tags: [universe]",
-       // Additive scope key, omitted at the root exactly like every other note: the
-       // ABSENCE of `universe:` is what "default" means (ADR 0034), so stamping it
-       // would make the default universe's own profile the one note that lies.
-       ...(isDefaultUniverse(universe) ? [] : [`universe: ${universe}`]),
-       `displayName: ${displayName}`,
-       ...optional("kind", kind),
-       ...optional("role", role),
-       ...optional("period", period),
-       "---",
-     ];
+     const frontmatter = [];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:202:68
-     const optional = (key, value) => (value ? [`${key}: ${value}`] : []);
+     const optional = (key, value) => (value ? [`${key}: ${value}`] : ["Stryker was here"]);

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:204:5
-       "---",
+       "",

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:205:5
-       "type: universe",
+       "",

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:206:5
-       `created: ${today}`,
+       ``,

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:207:5
-       `updated: ${today}`,
+       ``,

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:212:39
-       ...(isDefaultUniverse(universe) ? [] : [`universe: ${universe}`]),
+       ...(isDefaultUniverse(universe) ? ["Stryker was here"] : [`universe: ${universe}`]),

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:212:44
-       ...(isDefaultUniverse(universe) ? [] : [`universe: ${universe}`]),
+       ...(isDefaultUniverse(universe) ? [] : []),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:208:5
-       "tags: [universe]",
+       "",

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:212:45
-       ...(isDefaultUniverse(universe) ? [] : [`universe: ${universe}`]),
+       ...(isDefaultUniverse(universe) ? [] : [``]),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:213:5
-       `displayName: ${displayName}`,
+       ``,

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:214:17
-       ...optional("kind", kind),
+       ...optional("", kind),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:215:17
-       ...optional("role", role),
+       ...optional("", role),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:216:17
-       ...optional("period", period),
+       ...optional("", period),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:217:5
-       "---",
+       "",

[Survived] ArrowFunction
scripts/lib/universe-profile.mjs:221:19
-     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : []);
+     const section = () => undefined;

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:221:53
-     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : []);
+     const section = (title, lines) => (lines.length ? [] : []);

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:221:58
-     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : []);
+     const section = (title, lines) => (lines.length ? ["", ``, "", ...lines] : []);

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:221:54
-     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : []);
+     const section = (title, lines) => (lines.length ? ["Stryker was here!", `## ${title}`, "", ...lines] : []);

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:221:73
-     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : []);
+     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "Stryker was here!", ...lines] : []);

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:221:89
-     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : []);
+     const section = (title, lines) => (lines.length ? ["", `## ${title}`, "", ...lines] : ["Stryker was here"]);

[Survived] LogicalOperator
scripts/lib/universe-profile.mjs:224:18
-     const people = answers.people ?? [];
+     const people = answers.people && [];

[Survived] LogicalOperator
scripts/lib/universe-profile.mjs:228:18
-     const topics = answers.topics ?? [];
+     const topics = answers.topics && [];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:224:36
-     const people = answers.people ?? [];
+     const people = answers.people ?? ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:228:36
-     const topics = answers.topics ?? [];
+     const topics = answers.topics ?? ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:232:44
-     const connectors = answers.connectors ?? [];
+     const connectors = answers.connectors ?? ["Stryker was here"];

[Survived] LogicalOperator
scripts/lib/universe-profile.mjs:232:22
-     const connectors = answers.connectors ?? [];
+     const connectors = answers.connectors && [];

[Survived] ObjectLiteral
scripts/lib/universe-profile.mjs:233:10
-     return {
-       path: universeProfilePath(universe),
-       content: [
-         ...frontmatter,
-         "",
-         `# ${displayName}`,
-         ...(answers.about ? ["", answers.about] : []),
-         ...section("People", people.map((p) => `- ${p}`)),
-         ...section("Topics", topics.map((t) => `- ${t}`)),
-         ...section("Connector accounts", connectors.map((c) => `- ${c.tool}: ${c.account}`)),
-         "",
-       ].join("\n"),
-     };
+     return {};

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:235:14
-       content: [
-         ...frontmatter,
-         "",
-         `# ${displayName}`,
-         ...(answers.about ? ["", answers.about] : []),
-         ...section("People", people.map((p) => `- ${p}`)),
-         ...section("Topics", topics.map((t) => `- ${t}`)),
-         ...section("Connector accounts", connectors.map((c) => `- ${c.tool}: ${c.account}`)),
-         "",
-       ].join("\n"),
+       content: [].join("\n"),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:237:7
-         "",
+         "Stryker was here!",

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:238:7
-         `# ${displayName}`,
+         ``,

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:239:27
-         ...(answers.about ? ["", answers.about] : []),
+         ...(answers.about ? [] : []),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:239:28
-         ...(answers.about ? ["", answers.about] : []),
+         ...(answers.about ? ["Stryker was here!", answers.about] : []),

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:239:49
-         ...(answers.about ? ["", answers.about] : []),
+         ...(answers.about ? ["", answers.about] : ["Stryker was here"]),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:240:18
-         ...section("People", people.map((p) => `- ${p}`)),
+         ...section("", people.map((p) => `- ${p}`)),

[Survived] ArrowFunction
scripts/lib/universe-profile.mjs:240:39
-         ...section("People", people.map((p) => `- ${p}`)),
+         ...section("People", people.map(() => undefined)),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:240:46
-         ...section("People", people.map((p) => `- ${p}`)),
+         ...section("People", people.map((p) => ``)),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:241:18
-         ...section("Topics", topics.map((t) => `- ${t}`)),
+         ...section("", topics.map((t) => `- ${t}`)),

[Survived] ArrowFunction
scripts/lib/universe-profile.mjs:241:39
-         ...section("Topics", topics.map((t) => `- ${t}`)),
+         ...section("Topics", topics.map(() => undefined)),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:241:46
-         ...section("Topics", topics.map((t) => `- ${t}`)),
+         ...section("Topics", topics.map((t) => ``)),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:242:18
-         ...section("Connector accounts", connectors.map((c) => `- ${c.tool}: ${c.account}`)),
+         ...section("", connectors.map((c) => `- ${c.tool}: ${c.account}`)),

[Survived] ArrowFunction
scripts/lib/universe-profile.mjs:242:55
-         ...section("Connector accounts", connectors.map((c) => `- ${c.tool}: ${c.account}`)),
+         ...section("Connector accounts", connectors.map(() => undefined)),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:242:62
-         ...section("Connector accounts", connectors.map((c) => `- ${c.tool}: ${c.account}`)),
+         ...section("Connector accounts", connectors.map((c) => ``)),

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:243:7
-         "",
+         "Stryker was here!",

[Survived] StringLiteral
scripts/lib/universe-profile.mjs:244:12
-       ].join("\n"),
+       ].join(""),

[Survived] BlockStatement
scripts/lib/universe-reminder.mjs:19:56
-   export function universeReminder({ registry, active }) {
-     if (!isMultiverse(registry)) return null;
-     const current = active || DEFAULT_UNIVERSE;
-     const all = listAllUniverses(registry);
-     return `Active universe: '${current}' (of ${all.length}: ${all.join(", ")}).`;
-   }
+   export function universeReminder({ registry, active }) {}

[Survived] BooleanLiteral
scripts/lib/universe-reminder.mjs:20:7
-     if (!isMultiverse(registry)) return null;
+     if (isMultiverse(registry)) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:20:7
-     if (!isMultiverse(registry)) return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:20:7
-     if (!isMultiverse(registry)) return null;
+     if (false) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:21:19
-     const current = active || DEFAULT_UNIVERSE;
+     const current = true;

[Survived] LogicalOperator
scripts/lib/universe-reminder.mjs:21:19
-     const current = active || DEFAULT_UNIVERSE;
+     const current = active && DEFAULT_UNIVERSE;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:21:19
-     const current = active || DEFAULT_UNIVERSE;
+     const current = false;

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:23:10
-     return `Active universe: '${current}' (of ${all.length}: ${all.join(", ")}).`;
+     return ``;

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:23:71
-     return `Active universe: '${current}' (of ${all.length}: ${all.join(", ")}).`;
+     return `Active universe: '${current}' (of ${all.length}: ${all.join("")}).`;

[Survived] BlockStatement
scripts/lib/universe-reminder.mjs:35:61
-   export function pointerHealNotice({ healed, from, active }) {
-     if (!healed) return null;
-     return (
-       `The universe '${from}' this machine was working in no longer exists ` +
-       `(deleted or renamed elsewhere), so the scope is back to '${active}'.`
-     );
-   }
+   export function pointerHealNotice({ healed, from, active }) {}

[Survived] BooleanLiteral
scripts/lib/universe-reminder.mjs:36:7
-     if (!healed) return null;
+     if (healed) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:36:7
-     if (!healed) return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:36:7
-     if (!healed) return null;
+     if (false) return null;

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:38:5
-       `The universe '${from}' this machine was working in no longer exists ` +
+       `` +

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:39:5
-       `(deleted or renamed elsewhere), so the scope is back to '${active}'.`
+       ``

[Survived] BlockStatement
scripts/lib/universe-reminder.mjs:58:83
-   export function profileCaptureOffer({ hasProfile, declined, multiverse = false }) {
-     if (hasProfile || declined) return null;
-     // THE dichotomy (ADR 0034). Below the gate the machinery does not exist yet, so
-     // the word would name a thing this owner has never met; past it, the word IS the
-     // vocabulary they already switch with. The CORE decides which, because deciding
-     // requires counting universes, and counting is not the LLM's job (ADR 0009).
-     const vocabulary = multiverse
-       ? "say `universe` plainly — the active one"
-       : "never use the word `universe`: they have never met the notion, say their context";
-     // No mention of the refusal already checked above: the core gated on it, so saying
-     // so again is bookkeeping the agent cannot act on and the owner should not read.
-     return (
-       `No profile yet for this owner's context. Offer once, in their language, to ` +
-       `describe it, and say it is skippable (${vocabulary}).`
-     );
-   }
+   export function profileCaptureOffer({ hasProfile, declined, multiverse = false }) {}

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:59:7
-     if (hasProfile || declined) return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:59:7
-     if (hasProfile || declined) return null;
+     if (false) return null;

[Survived] LogicalOperator
scripts/lib/universe-reminder.mjs:59:7
-     if (hasProfile || declined) return null;
+     if (hasProfile && declined) return null;

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:65:7
-       ? "say `universe` plainly — the active one"
+       ? ""

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:66:7
-       : "never use the word `universe`: they have never met the notion, say their context";
+       : "";

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:70:5
-       `No profile yet for this owner's context. Offer once, in their language, to ` +
+       `` +

[Survived] BlockStatement
scripts/lib/universe-reminder.mjs:81:96
-   export function buildUniverseHookOutput({ nudge = null, synthesis = null, offer = null } = {}) {
-     if (!nudge && !synthesis && !offer) return null;
-     const parts = [];
-     if (nudge) {
-       parts.push(
-         `[universe] ${nudge} Searches are scoped to it plus their cross-cutting notes; ` +
-           `"search all universes" spans them, /switch changes it. Say so once, in their language.`,
-       );
-     }
-     if (synthesis) {
-       // Still says nothing about universes, for a reason F1 changed: it is no longer
-       // that a lone-universe brain might see this block (it never does now), it is
-       // that the `[universe]` line above owns the machinery vocabulary and this one is
-       // about THEIR world. Merged, the owner reads plumbing where they wanted context.
-       //
-       // The framing is one short sentence because the block it wraps now DIRECTS the
-       // agent itself (when to open the page, where to send the owner for the rest).
-       parts.push(
-         `[working context]\n${synthesis}\n` + `Ambient background: use it silently, do not recite it.`,
-       );
-     }
-     if (offer) parts.push(`[onboarding] ${offer}`);
-     return {
-       hookSpecificOutput: { hookEventName: "SessionStart", additionalContext: parts.join("\n\n") },
-       systemMessage: [nudge, synthesis, offer].filter(Boolean).join("\n"),
-     };
-   }
+   export function buildUnive

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:71:5
-       `describe it, and say it is skippable (${vocabulary}).`
+       ``

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:82:7
-     if (!nudge && !synthesis && !offer) return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:82:7
-     if (!nudge && !synthesis && !offer) return null;
+     if (false) return null;

[Survived] LogicalOperator
scripts/lib/universe-reminder.mjs:82:7
-     if (!nudge && !synthesis && !offer) return null;
+     if (!nudge && !synthesis || !offer) return null;

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:82:7
-     if (!nudge && !synthesis && !offer) return null;
+     if (true && !offer) return null;

[Survived] LogicalOperator
scripts/lib/universe-reminder.mjs:82:7
-     if (!nudge && !synthesis && !offer) return null;
+     if (!nudge || !synthesis && !offer) return null;

[Survived] BooleanLiteral
scripts/lib/universe-reminder.mjs:82:7
-     if (!nudge && !synthesis && !offer) return null;
+     if (nudge && !synthesis && !offer) return null;

[Survived] BooleanLiteral
scripts/lib/universe-reminder.mjs:82:17
-     if (!nudge && !synthesis && !offer) return null;
+     if (!nudge && synthesis && !offer) return null;

[Survived] BooleanLiteral
scripts/lib/universe-reminder.mjs:82:31
-     if (!nudge && !synthesis && !offer) return null;
+     if (!nudge && !synthesis && offer) return null;

[Survived] ArrayDeclaration
scripts/lib/universe-reminder.mjs:83:17
-     const parts = [];
+     const parts = ["Stryker was here"];

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:84:7
-     if (nudge) {
+     if (true) {

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:84:7
-     if (nudge) {
+     if (false) {

[Survived] BlockStatement
scripts/lib/universe-reminder.mjs:84:14
-     if (nudge) {
-       parts.push(
-         `[universe] ${nudge} Searches are scoped to it plus their cross-cutting notes; ` +
-           `"search all universes" spans them, /switch changes it. Say so once, in their language.`,
-       );
-     }
+     if (nudge) {}

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:86:7
-         `[universe] ${nudge} Searches are scoped to it plus their cross-cutting notes; ` +
+         `` +

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:87:9
-           `"search all universes" spans them, /switch changes it. Say so once, in their language.`,
+           ``,

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:90:7
-     if (synthesis) {
+     if (true) {

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:90:7
-     if (synthesis) {
+     if (false) {

[Survived] BlockStatement
scripts/lib/universe-reminder.mjs:90:18
-     if (synthesis) {
-       // Still says nothing about universes, for a reason F1 changed: it is no longer
-       // that a lone-universe brain might see this block (it never does now), it is
-       // that the `[universe]` line above owns the machinery vocabulary and this one is
-       // about THEIR world. Merged, the owner reads plumbing where they wanted context.
-       //
-       // The framing is one short sentence because the block it wraps now DIRECTS the
-       // agent itself (when to open the page, where to send the owner for the rest).
-       parts.push(
-         `[working context]\n${synthesis}\n` + `Ambient background: use it silently, do not recite it.`,
-       );
-     }
+     if (synthesis) {}

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:99:7
-         `[working context]\n${synthesis}\n` + `Ambient background: use it silently, do not recite it.`,
+         `` + `Ambient background: use it silently, do not recite it.`,

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:99:45
-         `[working context]\n${synthesis}\n` + `Ambient background: use it silently, do not recite it.`,
+         `[working context]\n${synthesis}\n` + ``,

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:102:7
-     if (offer) parts.push(`[onboarding] ${offer}`);
+     if (true) parts.push(`[onboarding] ${offer}`);

[Survived] ConditionalExpression
scripts/lib/universe-reminder.mjs:102:7
-     if (offer) parts.push(`[onboarding] ${offer}`);
+     if (false) parts.push(`[onboarding] ${offer}`);

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:102:25
-     if (offer) parts.push(`[onboarding] ${offer}`);
+     if (offer) parts.push(``);

[Survived] ObjectLiteral
scripts/lib/universe-reminder.mjs:103:10
-     return {
-       hookSpecificOutput: { hookEventName: "SessionStart", additionalContext: parts.join("\n\n") },
-       systemMessage: [nudge, synthesis, offer].filter(Boolean).join("\n"),
-     };
+     return {};
