[Survived] ObjectLiteral
scripts/lib/universe-reminder.mjs:104:25
-       hookSpecificOutput: { hookEventName: "SessionStart", additionalContext: parts.join("\n\n") },
+       hookSpecificOutput: {},

[Survived] StringLiteral
scripts/lib/universe-reminder.mjs:104:42
-       hookSpecificOutput: { hookEventName: "SessionStart", additionalContext: parts.join("\n\n") },
+       hookSpecificOutput: { hookEventName: "", additionalContext: parts.join("\n\n") },

[Survived] MethodExpression
scripts/lib/universe-reminder.mjs:105:20
-       systemMessage: [nudge, synthesis, offer].filter(Boolean).join("\n"),
+       systemMessage: [nudge, synthesis, offer].join("\n"),

[Survived] ArrayDeclaration
scripts/lib/universe-reminder.mjs:105:20
-       systemMessage: [nudge, synthesis, offer].filter(Boolean).join("\n"),
+       systemMessage: [].filter(Boolean).join("\n"),

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:26:44
-   export function engineParser({ brainDir }) {
-     try {
-       const require = createRequire(join(brainDir, "rag", "package.json"));
-       const matter = require("gray-matter");
-       const { load } = require("js-yaml");
-       // The same composition as frontmatter-parser.ts: gray-matter 4.x defaults to
-       // js-yaml 3's removed `safeLoad`, so the yaml engine is forced onto `load`.
-       return (raw) => matter(raw, { engines: { yaml: (input) => load(input) } });
-     } catch {
-       return null;
-     }
-   }
+   export function engineParser({ brainDir }) {}

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:28:50
-       const require = createRequire(join(brainDir, "rag", "package.json"));
+       const require = createRequire(join(brainDir, "", "package.json"));

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:27:7
-     try {
-       const require = createRequire(join(brainDir, "rag", "package.json"));
-       const matter = require("gray-matter");
-       const { load } = require("js-yaml");
-       // The same composition as frontmatter-parser.ts: gray-matter 4.x defaults to
-       // js-yaml 3's removed `safeLoad`, so the yaml engine is forced onto `load`.
-       return (raw) => matter(raw, { engines: { yaml: (input) => load(input) } });
-     } catch {
+     try {} catch {

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:28:57
-       const require = createRequire(join(brainDir, "rag", "package.json"));
+       const require = createRequire(join(brainDir, "rag", ""));

[Survived] ArrowFunction
scripts/lib/vault-write-guard.mjs:33:12
-       return (raw) => matter(raw, { engines: { yaml: (input) => load(input) } });
+       return () => undefined;

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:33:33
-       return (raw) => matter(raw, { engines: { yaml: (input) => load(input) } });
+       return (raw) => matter(raw, {});

[Survived] ArrowFunction
scripts/lib/vault-write-guard.mjs:33:52
-       return (raw) => matter(raw, { engines: { yaml: (input) => load(input) } });
+       return (raw) => matter(raw, { engines: { yaml: () => undefined } });

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:33:44
-       return (raw) => matter(raw, { engines: { yaml: (input) => load(input) } });
+       return (raw) => matter(raw, { engines: {} });

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:34:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:54:41
-   export function duplicateKeyDetail(raw) {
-     const lines = raw.split("\n");
-     if (lines[0].trim() !== "---") return null;
-     const seenAtLine = new Map();
-     for (let i = 1; i < lines.length; i++) {
-       if (lines[i].trim() === "---") break;
-       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)?.[1];
-       if (key === undefined) continue;
-       const first = seenAtLine.get(key);
-       if (first !== undefined) return { key, first, second: i + 1 };
-       seenAtLine.set(key, i + 1);
-     }
-     return null;
-   }
+   export function duplicateKeyDetail(raw) {}

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:55:27
-     const lines = raw.split("\n");
+     const lines = raw.split("");

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:56:7
-     if (lines[0].trim() !== "---") return null;
+     if (lines[0].trim() === "---") return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:56:7
-     if (lines[0].trim() !== "---") return null;
+     if (false) return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:56:7
-     if (lines[0].trim() !== "---") return null;
+     if (true) return null;

[Survived] MethodExpression
scripts/lib/vault-write-guard.mjs:56:7
-     if (lines[0].trim() !== "---") return null;
+     if (lines[0] !== "---") return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:56:27
-     if (lines[0].trim() !== "---") return null;
+     if (lines[0].trim() !== "") return null;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:58:19
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; i <= lines.length; i++) {

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:58:19
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; false; i++) {

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:58:19
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; i >= lines.length; i++) {

[Survived] UpdateOperator
scripts/lib/vault-write-guard.mjs:58:37
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; i < lines.length; i--) {

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:58:42
-     for (let i = 1; i < lines.length; i++) {
-       if (lines[i].trim() === "---") break;
-       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)?.[1];
-       if (key === undefined) continue;
-       const first = seenAtLine.get(key);
-       if (first !== undefined) return { key, first, second: i + 1 };
-       seenAtLine.set(key, i + 1);
-     }
+     for (let i = 1; i < lines.length; i++) {}

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:59:9
-       if (lines[i].trim() === "---") break;
+       if (true) break;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:59:9
-       if (lines[i].trim() === "---") break;
+       if (false) break;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:59:9
-       if (lines[i].trim() === "---") break;
+       if (lines[i].trim() !== "---") break;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:59:29
-       if (lines[i].trim() === "---") break;
+       if (lines[i].trim() === "") break;

[Survived] MethodExpression
scripts/lib/vault-write-guard.mjs:59:9
-       if (lines[i].trim() === "---") break;
+       if (lines[i] === "---") break;

[Survived] OptionalChaining
scripts/lib/vault-write-guard.mjs:60:17
-       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)?.[1];
+       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)[1];

[Survived] Regex
scripts/lib/vault-write-guard.mjs:60:32
-       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)?.[1];
+       const key = lines[i].match(/([A-Za-z0-9_-]+):/)?.[1];

[Survived] Regex
scripts/lib/vault-write-guard.mjs:60:32
-       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)?.[1];
+       const key = lines[i].match(/^([A-Za-z0-9_-]):/)?.[1];

[Survived] Regex
scripts/lib/vault-write-guard.mjs:60:32
-       const key = lines[i].match(/^([A-Za-z0-9_-]+):/)?.[1];
+       const key = lines[i].match(/^([^A-Za-z0-9_-]+):/)?.[1];

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:61:9
-       if (key === undefined) continue;
+       if (true) continue;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:61:9
-       if (key === undefined) continue;
+       if (false) continue;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:61:9
-       if (key === undefined) continue;
+       if (key !== undefined) continue;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:63:9
-       if (first !== undefined) return { key, first, second: i + 1 };
+       if (true) return { key, first, second: i + 1 };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:63:9
-       if (first !== undefined) return { key, first, second: i + 1 };
+       if (false) return { key, first, second: i + 1 };

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:63:9
-       if (first !== undefined) return { key, first, second: i + 1 };
+       if (first === undefined) return { key, first, second: i + 1 };

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:63:37
-       if (first !== undefined) return { key, first, second: i + 1 };
+       if (first !== undefined) return {};

[Survived] ArithmeticOperator
scripts/lib/vault-write-guard.mjs:63:59
-       if (first !== undefined) return { key, first, second: i + 1 };
+       if (first !== undefined) return { key, first, second: i - 1 };

[Survived] ArithmeticOperator
scripts/lib/vault-write-guard.mjs:64:25
-       seenAtLine.set(key, i + 1);
+       seenAtLine.set(key, i - 1);

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:74:67
-   export function guardedNotePath({ toolName, filePath, brainDir }) {
-     if (toolName !== "Write" && toolName !== "Edit") return null;
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
-     const rel = relative(brainDir, filePath).split(sep).join("/");
-     return rel.startsWith("vault/") ? rel : null;
-   }
+   export function guardedNotePath({ toolName, filePath, brainDir }) {}

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:75:7
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:75:7
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (false) return null;

[Survived] LogicalOperator
scripts/lib/vault-write-guard.mjs:75:7
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (toolName !== "Write" || toolName !== "Edit") return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:75:7
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (true && toolName !== "Edit") return null;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:75:7
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (toolName === "Write" && toolName !== "Edit") return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:75:20
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (toolName !== "" && toolName !== "Edit") return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:75:31
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (toolName !== "Write" && true) return null;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:75:31
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (toolName !== "Write" && toolName === "Edit") return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:75:44
-     if (toolName !== "Write" && toolName !== "Edit") return null;
+     if (toolName !== "Write" && toolName !== "") return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:76:7
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:76:7
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (false) return null;

[Survived] LogicalOperator
scripts/lib/vault-write-guard.mjs:76:7
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath !== "string" && !filePath.toLowerCase().endsWith(".md")) return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:76:7
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (false || !filePath.toLowerCase().endsWith(".md")) return null;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:76:7
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath === "string" || !filePath.toLowerCase().endsWith(".md")) return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:76:27
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath !== "" || !filePath.toLowerCase().endsWith(".md")) return null;

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:76:39
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath !== "string" || filePath.toLowerCase().endsWith(".md")) return null;

[Survived] MethodExpression
scripts/lib/vault-write-guard.mjs:76:40
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath !== "string" || !filePath.toLowerCase().startsWith(".md")) return null;

[Survived] MethodExpression
scripts/lib/vault-write-guard.mjs:76:40
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath !== "string" || !filePath.toUpperCase().endsWith(".md")) return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:76:72
-     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith(".md")) return null;
+     if (typeof filePath !== "string" || !filePath.toLowerCase().endsWith("")) return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:77:60
-     const rel = relative(brainDir, filePath).split(sep).join("/");
+     const rel = relative(brainDir, filePath).split(sep).join("");

[Survived] MethodExpression
scripts/lib/vault-write-guard.mjs:78:10
-     return rel.startsWith("vault/") ? rel : null;
+     return rel.endsWith("vault/") ? rel : null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:78:25
-     return rel.startsWith("vault/") ? rel : null;
+     return rel.startsWith("") ? rel : null;

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:82:52
-   export function frontmatterVerdict({ raw, parse }) {
-     try {
-       parse(raw);
-       return { ok: true };
-     } catch (err) {
-       // Only ever consulted once the parser has ALREADY refused: this upgrades a
-       // message, it never adds a verdict of its own.
-       const duplicate = duplicateKeyDetail(raw);
-       if (duplicate) {
-         return {
-           ok: false,
-           reason:
-             `damaged front-matter key "${duplicate.key}": declared twice, on lines ` +
-             `${duplicate.first} and ${duplicate.second}. A note can only carry one — ` +
-             `the engine's parser refuses the file, so the note would never be indexed.`,
-         };
-       }
-       return { ok: false, reason: err instanceof Error ? err.message : String(err) };
-     }
-   }
+   export function frontmatterVerdict({ raw, parse }) {}

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:83:7
-     try {
-       parse(raw);
-       return { ok: true };
-     } catch (err) {
+     try {} catch (err) {

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:85:12
-       return { ok: true };
+       return {};

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:85:18
-       return { ok: true };
+       return { ok: false };

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:86:17
-     } catch (err) {
-       // Only ever consulted once the parser has ALREADY refused: this upgrades a
-       // message, it never adds a verdict of its own.
-       const duplicate = duplicateKeyDetail(raw);
-       if (duplicate) {
-         return {
-           ok: false,
-           reason:
-             `damaged front-matter key "${duplicate.key}": declared twice, on lines ` +
-             `${duplicate.first} and ${duplicate.second}. A note can only carry one — ` +
-             `the engine's parser refuses the file, so the note would never be indexed.`,
-         };
-       }
-       return { ok: false, reason: err instanceof Error ? err.message : String(err) };
-     }
+     } catch (err) {}

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:90:9
-       if (duplicate) {
+       if (true) {

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:90:9
-       if (duplicate) {
+       if (false) {

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:90:20
-       if (duplicate) {
-         return {
-           ok: false,
-           reason:
-             `damaged front-matter key "${duplicate.key}": declared twice, on lines ` +
-             `${duplicate.first} and ${duplicate.second}. A note can only carry one — ` +
-             `the engine's parser refuses the file, so the note would never be indexed.`,
-         };
-       }
+       if (duplicate) {}

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:91:14
-         return {
-           ok: false,
-           reason:
-             `damaged front-matter key "${duplicate.key}": declared twice, on lines ` +
-             `${duplicate.first} and ${duplicate.second}. A note can only carry one — ` +
-             `the engine's parser refuses the file, so the note would never be indexed.`,
-         };
+         return {};

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:92:13
-           ok: false,
+           ok: true,

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:94:11
-             `damaged front-matter key "${duplicate.key}": declared twice, on lines ` +
+             `` +

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:96:11
-             `the engine's parser refuses the file, so the note would never be indexed.`,
+             ``,

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:95:11
-             `${duplicate.first} and ${duplicate.second}. A note can only carry one — ` +
+             `` +

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:99:12
-       return { ok: false, reason: err instanceof Error ? err.message : String(err) };
+       return {};

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:99:18
-       return { ok: false, reason: err instanceof Error ? err.message : String(err) };
+       return { ok: true, reason: err instanceof Error ? err.message : String(err) };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:112:7
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (true) return null;

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:110:46
-   function editedNote({ toolInput, readFile }) {
-     const { file_path: filePath, old_string: oldString, new_string: newString, replace_all: replaceAll } = toolInput ?? {};
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
-     let current;
-     try {
-       current = readFile(filePath);
-     } catch {
-       return null;
-     }
-     if (!current.includes(oldString)) return null;
-     return replaceAll ? current.split(oldString).join(newString) : current.replace(oldString, newString);
-   }
+   function editedNote({ toolInput, readFile }) {}

[Survived] LogicalOperator
scripts/lib/vault-write-guard.mjs:111:106
-     const { file_path: filePath, old_string: oldString, new_string: newString, replace_all: replaceAll } = toolInput ?? {};
+     const { file_path: filePath, old_string: oldString, new_string: newString, replace_all: replaceAll } = toolInput && {};

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:112:7
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (false) return null;

[Survived] LogicalOperator
scripts/lib/vault-write-guard.mjs:112:7
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (typeof oldString !== "string" && typeof newString !== "string") return null;

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:112:28
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (typeof oldString !== "" || typeof newString !== "string") return null;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:112:7
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (typeof oldString === "string" || typeof newString !== "string") return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:112:7
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (false || typeof newString !== "string") return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:112:40
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (typeof oldString !== "string" || false) return null;

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:112:40
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (typeof oldString !== "string" || typeof newString === "string") return null;

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:116:11
-     } catch {
-       return null;
-     }
+     } catch {}

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:114:7
-     try {
-       current = readFile(filePath);
-     } catch {
+     try {} catch {

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:112:61
-     if (typeof oldString !== "string" || typeof newString !== "string") return null;
+     if (typeof oldString !== "string" || typeof newString !== "") return null;

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:119:7
-     if (!current.includes(oldString)) return null;
+     if (current.includes(oldString)) return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:119:7
-     if (!current.includes(oldString)) return null;
+     if (true) return null;

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:119:7
-     if (!current.includes(oldString)) return null;
+     if (false) return null;

[Survived] BlockStatement
scripts/lib/vault-write-guard.mjs:131:83
-   export function guardDecision({ toolName, toolInput, brainDir, parse, readFile }) {
-     const relPath = guardedNotePath({ toolName, filePath: toolInput?.file_path, brainDir });
-     if (relPath === null || parse === null) return { allow: true };
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
-     if (typeof raw !== "string") return { allow: true };
-     const verdict = frontmatterVerdict({ raw, parse });
-     if (verdict.ok) return { allow: true };
-     return {
-       allow: false,
-       reason:
-         `${relPath} — the engine's own YAML parser refuses this note's frontmatter: ` +
-         `${verdict.reason} Written as is, the note would be committed like any other and ` +
-         `never be indexed: invisible to every search, with nothing to recover it. ` +
-         `Fix the frontmatter (quote any value containing ": ") and write again.`,
-     };
-   }
+   export function guardDecision({ toolName, toolInput, brainDir, parse, readFile }) {}

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:132:35
-     const relPath = guardedNotePath({ toolName, filePath: toolInput?.file_path, brainDir });
+     const relPath = guardedNotePath({});

[Survived] OptionalChaining
scripts/lib/vault-write-guard.mjs:132:57
-     const relPath = guardedNotePath({ toolName, filePath: toolInput?.file_path, brainDir });
+     const relPath = guardedNotePath({ toolName, filePath: toolInput.file_path, brainDir });

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:133:7
-     if (relPath === null || parse === null) return { allow: true };
+     if (true) return { allow: true };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:133:7
-     if (relPath === null || parse === null) return { allow: true };
+     if (false) return { allow: true };

[Survived] LogicalOperator
scripts/lib/vault-write-guard.mjs:133:7
-     if (relPath === null || parse === null) return { allow: true };
+     if (relPath === null && parse === null) return { allow: true };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:133:7
-     if (relPath === null || parse === null) return { allow: true };
+     if (false || parse === null) return { allow: true };

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:133:7
-     if (relPath === null || parse === null) return { allow: true };
+     if (relPath !== null || parse === null) return { allow: true };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:133:27
-     if (relPath === null || parse === null) return { allow: true };
+     if (relPath === null || false) return { allow: true };

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:133:27
-     if (relPath === null || parse === null) return { allow: true };
+     if (relPath === null || parse !== null) return { allow: true };

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:133:50
-     if (relPath === null || parse === null) return { allow: true };
+     if (relPath === null || parse === null) return {};

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:133:59
-     if (relPath === null || parse === null) return { allow: true };
+     if (relPath === null || parse === null) return { allow: false };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:135:15
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
+     const raw = true ? toolInput?.content : editedNote({ toolInput, readFile });

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:135:15
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
+     const raw = false ? toolInput?.content : editedNote({ toolInput, readFile });

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:135:15
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
+     const raw = toolName !== "Write" ? toolInput?.content : editedNote({ toolInput, readFile });

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:135:28
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
+     const raw = toolName === "" ? toolInput?.content : editedNote({ toolInput, readFile });

[Survived] OptionalChaining
scripts/lib/vault-write-guard.mjs:135:38
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
+     const raw = toolName === "Write" ? toolInput.content : editedNote({ toolInput, readFile });

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:135:70
-     const raw = toolName === "Write" ? toolInput?.content : editedNote({ toolInput, readFile });
+     const raw = toolName === "Write" ? toolInput?.content : editedNote({});

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:136:7
-     if (typeof raw !== "string") return { allow: true };
+     if (true) return { allow: true };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:136:7
-     if (typeof raw !== "string") return { allow: true };
+     if (false) return { allow: true };

[Survived] EqualityOperator
scripts/lib/vault-write-guard.mjs:136:7
-     if (typeof raw !== "string") return { allow: true };
+     if (typeof raw === "string") return { allow: true };

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:136:22
-     if (typeof raw !== "string") return { allow: true };
+     if (typeof raw !== "") return { allow: true };

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:136:39
-     if (typeof raw !== "string") return { allow: true };
+     if (typeof raw !== "string") return {};

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:136:48
-     if (typeof raw !== "string") return { allow: true };
+     if (typeof raw !== "string") return { allow: false };

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:138:38
-     const verdict = frontmatterVerdict({ raw, parse });
+     const verdict = frontmatterVerdict({});

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:139:26
-     if (verdict.ok) return { allow: true };
+     if (verdict.ok) return {};

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:139:7
-     if (verdict.ok) return { allow: true };
+     if (true) return { allow: true };

[Survived] ConditionalExpression
scripts/lib/vault-write-guard.mjs:139:7
-     if (verdict.ok) return { allow: true };
+     if (false) return { allow: true };

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:139:35
-     if (verdict.ok) return { allow: true };
+     if (verdict.ok) return { allow: false };

[Survived] ObjectLiteral
scripts/lib/vault-write-guard.mjs:141:10
-     return {
-       allow: false,
-       reason:
-         `${relPath} — the engine's own YAML parser refuses this note's frontmatter: ` +
-         `${verdict.reason} Written as is, the note would be committed like any other and ` +
-         `never be indexed: invisible to every search, with nothing to recover it. ` +
-         `Fix the frontmatter (quote any value containing ": ") and write again.`,
-     };
+     return {};
