[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:144:7
-         `${relPath} — the engine's own YAML parser refuses this note's frontmatter: ` +
+         `` +

[Survived] BooleanLiteral
scripts/lib/vault-write-guard.mjs:142:12
-       allow: false,
+       allow: true,

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:145:7
-         `${verdict.reason} Written as is, the note would be committed like any other and ` +
+         `` +

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:146:7
-         `never be indexed: invisible to every search, with nothing to recover it. ` +
+         `` +

[Survived] StringLiteral
scripts/lib/vault-write-guard.mjs:147:7
-         `Fix the frontmatter (quote any value containing ": ") and write again.`,
+         ``,
