[Survived] OptionalChaining
scripts/lib/rag-launcher.mjs:126:15
-     const srv = mcp?.mcpServers?.["local-mirror"];
+     const srv = mcp?.mcpServers["local-mirror"];

[Survived] OptionalChaining
scripts/lib/rag-launcher.mjs:126:15
-     const srv = mcp?.mcpServers?.["local-mirror"];
+     const srv = mcp.mcpServers?.["local-mirror"];

[Survived] StringLiteral
scripts/lib/rag-launcher.mjs:141:28
-   const WIN_INSTALL_SCRIPT = "sbg-rag-install.cmd";
+   const WIN_INSTALL_SCRIPT = "";

[Survived] ObjectLiteral
scripts/lib/rag-launcher.mjs:146:23
-   const realInstallIo = {
-     writeScript(ragDir, content) {
-       writeFileSync(join(ragDir, WIN_INSTALL_SCRIPT), content);
-       return WIN_INSTALL_SCRIPT;
-     },
-     removeScript(ragDir, name) {
-       rmSync(join(ragDir, name), { force: true });
-     },
-   };
+   const realInstallIo = {};

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:147:32
-     writeScript(ragDir, content) {
-       writeFileSync(join(ragDir, WIN_INSTALL_SCRIPT), content);
-       return WIN_INSTALL_SCRIPT;
-     },
+     writeScript(ragDir, content) {},

[Survived] BlockStatement
scripts/lib/rag-launcher.mjs:151:30
-     removeScript(ragDir, name) {
-       rmSync(join(ragDir, name), { force: true });
-     },
+     removeScript(ragDir, name) {},

[Survived] ObjectLiteral
scripts/lib/rag-launcher.mjs:152:32
-       rmSync(join(ragDir, name), { force: true });
+       rmSync(join(ragDir, name), {});

[Survived] BooleanLiteral
scripts/lib/rag-launcher.mjs:152:41
-       rmSync(join(ragDir, name), { force: true });
+       rmSync(join(ragDir, name), { force: false });
