[Survived] BlockStatement
scripts/session-status.mjs:90:28
-     for (const e of entries) {
-       const p = join(dir, e.name);
-       if (e.isDirectory()) n += countMarkdown(p);
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
-     }
+     for (const e of entries) {}

[Survived] ConditionalExpression
scripts/session-status.mjs:92:9
-       if (e.isDirectory()) n += countMarkdown(p);
+       if (true) n += countMarkdown(p);

[Survived] ConditionalExpression
scripts/session-status.mjs:92:9
-       if (e.isDirectory()) n += countMarkdown(p);
+       if (false) n += countMarkdown(p);

[Survived] AssignmentOperator
scripts/session-status.mjs:92:26
-       if (e.isDirectory()) n += countMarkdown(p);
+       if (e.isDirectory()) n -= countMarkdown(p);

[Survived] ConditionalExpression
scripts/session-status.mjs:93:14
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (true) n++;

[Survived] ConditionalExpression
scripts/session-status.mjs:93:14
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (false) n++;

[Survived] LogicalOperator
scripts/session-status.mjs:93:14
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (e.isFile() || e.name.toLowerCase().endsWith(".md")) n++;

[Survived] MethodExpression
scripts/session-status.mjs:93:28
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (e.isFile() && e.name.toLowerCase().startsWith(".md")) n++;

[Survived] MethodExpression
scripts/session-status.mjs:93:28
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (e.isFile() && e.name.toUpperCase().endsWith(".md")) n++;

[Survived] StringLiteral
scripts/session-status.mjs:93:58
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (e.isFile() && e.name.toLowerCase().endsWith("")) n++;

[Survived] UpdateOperator
scripts/session-status.mjs:93:66
-       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n++;
+       else if (e.isFile() && e.name.toLowerCase().endsWith(".md")) n--;

[Survived] ConditionalExpression
scripts/session-status.mjs:100:5
-   if (existsSync(DB_PATH)) {
+   if (true) {

[Survived] ConditionalExpression
scripts/session-status.mjs:100:5
-   if (existsSync(DB_PATH)) {
+   if (false) {

[Survived] BlockStatement
scripts/session-status.mjs:100:26
-   if (existsSync(DB_PATH)) {
-     try {
-       // better-sqlite3 lives in rag/node_modules → require resolved from rag/.
-       const require = createRequire(join(REPO, "rag", "package.json"));
-       const Database = require("better-sqlite3");
-       const db = new Database(DB_PATH, { readonly: true, fileMustExist: true });
-       docs = db.prepare("SELECT COUNT(*) AS n FROM documents").get().n;
-       db.close();
-     } catch {
-       docs = null; // degrades: module absent, DB being written, etc.
-     }
-   }
+   if (existsSync(DB_PATH)) {}

[Survived] BlockStatement
scripts/session-status.mjs:101:7
-     try {
-       // better-sqlite3 lives in rag/node_modules → require resolved from rag/.
-       const require = createRequire(join(REPO, "rag", "package.json"));
-       const Database = require("better-sqlite3");
-       const db = new Database(DB_PATH, { readonly: true, fileMustExist: true });
-       docs = db.prepare("SELECT COUNT(*) AS n FROM documents").get().n;
-       db.close();
-     } catch {
+     try {} catch {

[Survived] StringLiteral
scripts/session-status.mjs:103:46
-       const require = createRequire(join(REPO, "rag", "package.json"));
+       const require = createRequire(join(REPO, "", "package.json"));

[Survived] StringLiteral
scripts/session-status.mjs:103:53
-       const require = createRequire(join(REPO, "rag", "package.json"));
+       const require = createRequire(join(REPO, "rag", ""));

[Survived] ObjectLiteral
scripts/session-status.mjs:105:38
-       const db = new Database(DB_PATH, { readonly: true, fileMustExist: true });
+       const db = new Database(DB_PATH, {});

[Survived] BooleanLiteral
scripts/session-status.mjs:105:50
-       const db = new Database(DB_PATH, { readonly: true, fileMustExist: true });
+       const db = new Database(DB_PATH, { readonly: false, fileMustExist: true });

[Survived] BooleanLiteral
scripts/session-status.mjs:105:71
-       const db = new Database(DB_PATH, { readonly: true, fileMustExist: true });
+       const db = new Database(DB_PATH, { readonly: true, fileMustExist: false });

[Survived] StringLiteral
scripts/session-status.mjs:106:23
-       docs = db.prepare("SELECT COUNT(*) AS n FROM documents").get().n;
+       docs = db.prepare("").get().n;

[Survived] BlockStatement
scripts/session-status.mjs:108:11
-     } catch {
-       docs = null; // degrades: module absent, DB being written, etc.
-     }
+     } catch {}

[Survived] BlockStatement
scripts/session-status.mjs:118:5
-   try {
-     const lastRunPath = join(REPO, LAST_RUN_REL);
-     if (existsSync(lastRunPath)) lastRun = JSON.parse(readFileSync(lastRunPath, "utf8"));
-   } catch {
+   try {} catch {

[Survived] ConditionalExpression
scripts/session-status.mjs:120:7
-     if (existsSync(lastRunPath)) lastRun = JSON.parse(readFileSync(lastRunPath, "utf8"));
+     if (true) lastRun = JSON.parse(readFileSync(lastRunPath, "utf8"));

[Survived] ConditionalExpression
scripts/session-status.mjs:120:7
-     if (existsSync(lastRunPath)) lastRun = JSON.parse(readFileSync(lastRunPath, "utf8"));
+     if (false) lastRun = JSON.parse(readFileSync(lastRunPath, "utf8"));

[Survived] StringLiteral
scripts/session-status.mjs:120:79
-     if (existsSync(lastRunPath)) lastRun = JSON.parse(readFileSync(lastRunPath, "utf8"));
+     if (existsSync(lastRunPath)) lastRun = JSON.parse(readFileSync(lastRunPath, ""));

[Survived] BlockStatement
scripts/session-status.mjs:121:9
-   } catch {
-     lastRun = null;
-   }
+   } catch {}

[Survived] ObjectLiteral
scripts/session-status.mjs:124:31
-   const ragLine = ragStatusLine({ docs, scanned, lastRun });
+   const ragLine = ragStatusLine({});

[Survived] StringLiteral
scripts/session-status.mjs:133:66
-   const envContent = existsSync(ENV_PATH) ? readFileSync(ENV_PATH, "utf8") : null;
+   const envContent = existsSync(ENV_PATH) ? readFileSync(ENV_PATH, "") : null;

[Survived] ConditionalExpression
scripts/session-status.mjs:134:5
-   if (geminiKeyRequired(envContent) && !hasGeminiKey(envContent)) {
+   if (false) {

[Survived] ConditionalExpression
scripts/session-status.mjs:134:5
-   if (geminiKeyRequired(envContent) && !hasGeminiKey(envContent)) {
+   if (true) {

[Survived] LogicalOperator
scripts/session-status.mjs:134:5
-   if (geminiKeyRequired(envContent) && !hasGeminiKey(envContent)) {
+   if (geminiKeyRequired(envContent) || !hasGeminiKey(envContent)) {

[Survived] BlockStatement
scripts/session-status.mjs:134:65
-   if (geminiKeyRequired(envContent) && !hasGeminiKey(envContent)) {
-     keyLine =
-       "⚠️ Gemini key missing from .env → the RAG can't answer. Paste it into " +
-       ".env (GOOGLE_GEMINI_API_KEY=…) then re-ask your question (the server re-reads " +
-       "it on its own). If it persists, reconnect the MCP (/mcp) or restart Claude Code.";
-   }
+   if (geminiKeyRequired(envContent) && !hasGeminiKey(envContent)) {}

[Survived] BooleanLiteral
scripts/session-status.mjs:134:38
-   if (geminiKeyRequired(envContent) && !hasGeminiKey(envContent)) {
+   if (geminiKeyRequired(envContent) && hasGeminiKey(envContent)) {

[Survived] StringLiteral
scripts/session-status.mjs:136:5
-       "⚠️ Gemini key missing from .env → the RAG can't answer. Paste it into " +
+       "" +

[Survived] StringLiteral
scripts/session-status.mjs:137:5
-       ".env (GOOGLE_GEMINI_API_KEY=…) then re-ask your question (the server re-reads " +
+       "" +

[Survived] StringLiteral
scripts/session-status.mjs:138:5
-       "it on its own). If it persists, reconnect the MCP (/mcp) or restart Claude Code.";
+       "";

[Survived] BlockStatement
scripts/session-status.mjs:150:5
-   try {
-     const settingsPath = join(REPO, ".claude", "settings.json");
-     const templatePath = join(REPO, ".claude", "settings.json.template");
-     if (existsSync(settingsPath) && existsSync(templatePath)) {
-       const brainHooks = JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {};
-       const templateHooks = JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {};
-       const reconcileCli = join(__dirname, "lib", "reconcile-brain.mjs");
-       const r = bootstrapSessionHooks({
-         brainHooks,
-         templateHooks,
-         brainDir: REPO,
-         message: bootstrapReassuranceMessage(),
-         spawnReconcile: ({ brainDir }) => {
-           const child = spawn(
-             process.execPath,
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
-             // detached + unref → outlives the hook; windowsHide → no console flash (ADR 0015).
-             { detached: true, stdio: "ignore", windowsHide: true },
-           );
-           child.unref();
-         },
-         emit: (msg) => (bootstrapLine = msg),
-       });
-       void r;
-     }
-   } catch {
+   try {} catch {

[Survived] StringLiteral
scripts/session-status.mjs:151:35
-     const settingsPath = join(REPO, ".claude", "settings.json");
+     const settingsPath = join(REPO, "", "settings.json");

[Survived] StringLiteral
scripts/session-status.mjs:151:46
-     const settingsPath = join(REPO, ".claude", "settings.json");
+     const settingsPath = join(REPO, ".claude", "");

[Survived] StringLiteral
scripts/session-status.mjs:152:35
-     const templatePath = join(REPO, ".claude", "settings.json.template");
+     const templatePath = join(REPO, "", "settings.json.template");

[Survived] StringLiteral
scripts/session-status.mjs:152:46
-     const templatePath = join(REPO, ".claude", "settings.json.template");
+     const templatePath = join(REPO, ".claude", "");

[Survived] ConditionalExpression
scripts/session-status.mjs:153:7
-     if (existsSync(settingsPath) && existsSync(templatePath)) {
+     if (true) {

[Survived] ConditionalExpression
scripts/session-status.mjs:153:7
-     if (existsSync(settingsPath) && existsSync(templatePath)) {
+     if (false) {

[Survived] LogicalOperator
scripts/session-status.mjs:153:7
-     if (existsSync(settingsPath) && existsSync(templatePath)) {
+     if (existsSync(settingsPath) || existsSync(templatePath)) {

[Survived] BlockStatement
scripts/session-status.mjs:153:61
-     if (existsSync(settingsPath) && existsSync(templatePath)) {
-       const brainHooks = JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {};
-       const templateHooks = JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {};
-       const reconcileCli = join(__dirname, "lib", "reconcile-brain.mjs");
-       const r = bootstrapSessionHooks({
-         brainHooks,
-         templateHooks,
-         brainDir: REPO,
-         message: bootstrapReassuranceMessage(),
-         spawnReconcile: ({ brainDir }) => {
-           const child = spawn(
-             process.execPath,
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
-             // detached + unref → outlives the hook; windowsHide → no console flash (ADR 0015).
-             { detached: true, stdio: "ignore", windowsHide: true },
-           );
-           child.unref();
-         },
-         emit: (msg) => (bootstrapLine = msg),
-       });
-       void r;
-     }
+     if (existsSync(settingsPath) && existsSync(templatePath)) {}

[Survived] LogicalOperator
scripts/session-status.mjs:154:24
-       const brainHooks = JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {};
+       const brainHooks = JSON.parse(readFileSync(settingsPath, "utf8")).hooks && {};

[Survived] StringLiteral
scripts/session-status.mjs:154:62
-       const brainHooks = JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {};
+       const brainHooks = JSON.parse(readFileSync(settingsPath, "")).hooks ?? {};

[Survived] LogicalOperator
scripts/session-status.mjs:155:27
-       const templateHooks = JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {};
+       const templateHooks = JSON.parse(readFileSync(templatePath, "utf8")).hooks && {};

[Survived] StringLiteral
scripts/session-status.mjs:155:65
-       const templateHooks = JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {};
+       const templateHooks = JSON.parse(readFileSync(templatePath, "")).hooks ?? {};

[Survived] StringLiteral
scripts/session-status.mjs:156:42
-       const reconcileCli = join(__dirname, "lib", "reconcile-brain.mjs");
+       const reconcileCli = join(__dirname, "", "reconcile-brain.mjs");

[Survived] StringLiteral
scripts/session-status.mjs:156:49
-       const reconcileCli = join(__dirname, "lib", "reconcile-brain.mjs");
+       const reconcileCli = join(__dirname, "lib", "");

[Survived] ObjectLiteral
scripts/session-status.mjs:157:37
-       const r = bootstrapSessionHooks({
-         brainHooks,
-         templateHooks,
-         brainDir: REPO,
-         message: bootstrapReassuranceMessage(),
-         spawnReconcile: ({ brainDir }) => {
-           const child = spawn(
-             process.execPath,
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
-             // detached + unref → outlives the hook; windowsHide → no console flash (ADR 0015).
-             { detached: true, stdio: "ignore", windowsHide: true },
-           );
-           child.unref();
-         },
-         emit: (msg) => (bootstrapLine = msg),
-       });
+       const r = bootstrapSessionHooks({});

[Survived] BlockStatement
scripts/session-status.mjs:162:41
-         spawnReconcile: ({ brainDir }) => {
-           const child = spawn(
-             process.execPath,
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
-             // detached + unref → outlives the hook; windowsHide → no console flash (ADR 0015).
-             { detached: true, stdio: "ignore", windowsHide: true },
-           );
-           child.unref();
-         },
+         spawnReconcile: ({ brainDir }) => {},

[Survived] ArrayDeclaration
scripts/session-status.mjs:165:11
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
+             [],

[Survived] StringLiteral
scripts/session-status.mjs:165:26
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
+             [reconcileCli, "", brainDir, "--sourceDir", brainDir, "--platform", process.platform],

[Survived] StringLiteral
scripts/session-status.mjs:165:50
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
+             [reconcileCli, "--brainDir", brainDir, "", brainDir, "--platform", process.platform],

[Survived] StringLiteral
scripts/session-status.mjs:165:75
-             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "--platform", process.platform],
+             [reconcileCli, "--brainDir", brainDir, "--sourceDir", brainDir, "", process.platform],

[Survived] ObjectLiteral
scripts/session-status.mjs:167:11
-             { detached: true, stdio: "ignore", windowsHide: true },
+             {},

[Survived] BooleanLiteral
scripts/session-status.mjs:167:23
-             { detached: true, stdio: "ignore", windowsHide: true },
+             { detached: false, stdio: "ignore", windowsHide: true },

[Survived] StringLiteral
scripts/session-status.mjs:167:36
-             { detached: true, stdio: "ignore", windowsHide: true },
+             { detached: true, stdio: "", windowsHide: true },

[Survived] BooleanLiteral
scripts/session-status.mjs:167:59
-             { detached: true, stdio: "ignore", windowsHide: true },
+             { detached: true, stdio: "ignore", windowsHide: false },

[Survived] ArrowFunction
scripts/session-status.mjs:171:13
-         emit: (msg) => (bootstrapLine = msg),
+         emit: () => undefined,

[Survived] BlockStatement
scripts/session-status.mjs:175:9
-   } catch {
-     bootstrapLine = null; // fail-soft: never block session start over a bootstrap hiccup
-   }
+   } catch {}

[Survived] ObjectLiteral
scripts/session-status.mjs:187:24
-     restartPendingOnDisk({ repo: REPO, deriveWanted, existsSync, readFileSync }),
+     restartPendingOnDisk({}),

[Survived] MethodExpression
scripts/session-status.mjs:191:23
-   const systemMessage = [restartLine, bootstrapLine, keyLine, repoLine, ragLine]
-     .filter(Boolean)
+   const systemMessage = [restartLine, bootstrapLine, keyLine, repoLine, ragLine]

[Survived] ArrayDeclaration
scripts/session-status.mjs:191:23
-   const systemMessage = [restartLine, bootstrapLine, keyLine, repoLine, ragLine]
+   const systemMessage = []

[Survived] StringLiteral
scripts/session-status.mjs:193:9
-     .join("\n");
+     .join("");

[Survived] ObjectLiteral
scripts/session-status.mjs:195:18
-     JSON.stringify({
-       hookSpecificOutput: { hookEventName: "SessionStart" },
-       systemMessage,
-     }) + "\n"
+     JSON.stringify({}) + "\n"

[Survived] ObjectLiteral
scripts/session-status.mjs:196:25
-       hookSpecificOutput: { hookEventName: "SessionStart" },
+       hookSpecificOutput: {},

[Survived] StringLiteral
scripts/session-status.mjs:196:42
-       hookSpecificOutput: { hookEventName: "SessionStart" },
+       hookSpecificOutput: { hookEventName: "" },

[Survived] StringLiteral
scripts/session-status.mjs:198:8
-     }) + "\n"
+     }) + ""

[Survived] ArrowFunction
scripts/session-universe.mjs:61:17
-   const toPosix = (p) => p.split("\\").join("/");
+   const toPosix = () => undefined;

[Survived] StringLiteral
scripts/session-universe.mjs:61:32
-   const toPosix = (p) => p.split("\\").join("/");
+   const toPosix = (p) => p.split("").join("/");

[Survived] StringLiteral
scripts/session-universe.mjs:61:43
-   const toPosix = (p) => p.split("\\").join("/");
+   const toPosix = (p) => p.split("\\").join("");

[Survived] ArrowFunction
scripts/session-universe.mjs:69:17
-     healPointer = () => ({ healed: false }),
+     healPointer = () => undefined,

[Survived] ObjectLiteral
scripts/session-universe.mjs:69:24
-     healPointer = () => ({ healed: false }),
+     healPointer = () => ({}),

[Survived] ArrowFunction
scripts/session-universe.mjs:70:19
-     readSynthesis = () => null,
+     readSynthesis = () => undefined,

[Survived] BooleanLiteral
scripts/session-universe.mjs:69:34
-     healPointer = () => ({ healed: false }),
+     healPointer = () => ({ healed: true }),

[Survived] ArrowFunction
scripts/session-universe.mjs:71:18
-     readDeclined = () => false,
+     readDeclined = () => undefined,

[Survived] BooleanLiteral
scripts/session-universe.mjs:71:24
-     readDeclined = () => false,
+     readDeclined = () => true,

[Survived] BooleanLiteral
scripts/session-universe.mjs:87:20
-     let multiverse = false;
+     let multiverse = true;

[Survived] BooleanLiteral
scripts/session-universe.mjs:101:18
-         reported = true;
+         reported = false;

[Survived] ConditionalExpression
scripts/session-universe.mjs:129:5
-   if (process.argv[1] && resolve(process.argv[1]) === fileURLToPath(import.meta.url)) {
+   if (true) {

[Survived] ConditionalExpression
scripts/session-universe.mjs:129:5
-   if (process.argv[1] && resolve(process.argv[1]) === fileURLToPath(import.meta.url)) {
+   if (false) {

[Survived] LogicalOperator
scripts/session-universe.mjs:129:5
-   if (process.argv[1] && resolve(process.argv[1]) === fileURLToPath(import.meta.url)) {
+   if (process.argv[1] || resolve(process.argv[1]) === fileURLToPath(import.meta.url)) {

[Survived] ConditionalExpression
scripts/session-universe.mjs:129:24
-   if (process.argv[1] && resolve(process.argv[1]) === fileURLToPath(import.meta.url)) {
+   if (process.argv[1] && true) {

[Survived] EqualityOperator
scripts/session-universe.mjs:129:24
-   if (process.argv[1] && resolve(process.argv[1]) === fileURLToPath(import.meta.url)) {
+   if (process.argv[1] && resolve(process.argv[1]) !== fileURLToPath(import.meta.url)) {

[Survived] ObjectLiteral
scripts/session-universe.mjs:130:14
-     const io = {
-       existsSync,
-       readFileSync: (p) => readFileSync(p, "utf-8"),
-       writeFileSync,
-       mkdirSync,
-     };
+     const io = {};

[Survived] ArrowFunction
scripts/session-universe.mjs:132:19
-       readFileSync: (p) => readFileSync(p, "utf-8"),
+       readFileSync: () => undefined,

[Survived] StringLiteral
scripts/session-universe.mjs:132:42
-       readFileSync: (p) => readFileSync(p, "utf-8"),
+       readFileSync: (p) => readFileSync(p, ""),

[Survived] StringLiteral
scripts/session-universe.mjs:136:69
-     const brainDir = resolve(dirname(fileURLToPath(import.meta.url)), "..");
+     const brainDir = resolve(dirname(fileURLToPath(import.meta.url)), "");

[Survived] StringLiteral
scripts/session-universe.mjs:137:20
-     const vaultDir = `${toPosix(brainDir)}/vault`;
+     const vaultDir = ``;

[Survived] ArrayDeclaration
scripts/session-universe.mjs:138:17
-     const lines = [];
+     const lines = ["Stryker was here"];

[Survived] ObjectLiteral
scripts/session-universe.mjs:140:56
-     const { synthesis, offer } = sessionUniverseReminder({
-       dir: vaultRagDir(brainDir),
-       // The profile of the universe actually in force. Read through
-       // readActiveUniverse, which VALIDATES against the registry, so a machine whose
-       // pointer is a ghost injects the default universe's profile — no dependency on
-       // whether the repair below has run yet.
-       readSynthesis: (dir) =>
-         readActiveProfileSynthesis(io, vaultDir, () => readActiveUniverse(io, dir)),
-       // A refusal is remembered PER UNIVERSE: saying no to describing Acme must not
-       // silence the question for a universe created later, which is a different world.
-       readDeclined: (dir) => profileCaptureDeclined(io, dir, readActiveUniverse(io, dir)),
-       // The only write this hook performs: repairing a pointer left aimed at a
-       // universe that is gone. A healthy pointer is never rewritten.
-       healPointer: (dir) => healActiveUniversePointer(io, dir),
-       readState: (dir) => ({
-         registry: readRegistry(io, dir),
-         active: readActiveUniverse(io, dir),
-       }),
-       emit: (msg) => lines.push(msg),
-     });
+     const { synthesis, offer } = sessionUniverseReminder({});

[Survived] ArrowFunction
scripts/session-universe.mjs:146:20
-       readSynthesis: (dir) =>
-         readActiveProfileSynthesis(io, vaultDir, () => readActiveUniverse(io, dir)),
+       readSynthesis: () => undefined,

[Survived] ArrowFunction
scripts/session-universe.mjs:147:48
-         readActiveProfileSynthesis(io, vaultDir, () => readActiveUniverse(io, dir)),
+         readActiveProfileSynthesis(io, vaultDir, () => undefined),

[Survived] ArrowFunction
scripts/session-universe.mjs:150:19
-       readDeclined: (dir) => profileCaptureDeclined(io, dir, readActiveUniverse(io, dir)),
+       readDeclined: () => undefined,

[Survived] ArrowFunction
scripts/session-universe.mjs:153:18
-       healPointer: (dir) => healActiveUniversePointer(io, dir),
+       healPointer: () => undefined,

[Survived] ArrowFunction
scripts/session-universe.mjs:154:16
-       readState: (dir) => ({
-         registry: readRegistry(io, dir),
-         active: readActiveUniverse(io, dir),
-       }),
+       readState: () => undefined,

[Survived] ObjectLiteral
scripts/session-universe.mjs:154:26
-       readState: (dir) => ({
-         registry: readRegistry(io, dir),
-         active: readActiveUniverse(io, dir),
-       }),
+       readState: (dir) => ({}),

[Survived] ArrowFunction
scripts/session-universe.mjs:158:11
-       emit: (msg) => lines.push(msg),
+       emit: () => undefined,

[Survived] ObjectLiteral
scripts/session-universe.mjs:161:42
-     const output = buildUniverseHookOutput({ nudge: lines.join(" ") || null, synthesis, offer });
+     const output = buildUniverseHookOutput({});

[Survived] ConditionalExpression
scripts/session-universe.mjs:161:51
-     const output = buildUniverseHookOutput({ nudge: lines.join(" ") || null, synthesis, offer });
+     const output = buildUniverseHookOutput({ nudge: true, synthesis, offer });

[Survived] ConditionalExpression
scripts/session-universe.mjs:161:51
-     const output = buildUniverseHookOutput({ nudge: lines.join(" ") || null, synthesis, offer });
+     const output = buildUniverseHookOutput({ nudge: false, synthesis, offer });

[Survived] LogicalOperator
scripts/session-universe.mjs:161:51
-     const output = buildUniverseHookOutput({ nudge: lines.join(" ") || null, synthesis, offer });
+     const output = buildUniverseHookOutput({ nudge: lines.join(" ") && null, synthesis, offer });

[Survived] StringLiteral
scripts/session-universe.mjs:161:62
-     const output = buildUniverseHookOutput({ nudge: lines.join(" ") || null, synthesis, offer });
+     const output = buildUniverseHookOutput({ nudge: lines.join("") || null, synthesis, offer });

[Survived] ConditionalExpression
scripts/session-universe.mjs:162:7
-     if (output) {
+     if (true) {

[Survived] ConditionalExpression
scripts/session-universe.mjs:162:7
-     if (output) {
+     if (false) {

[Survived] BlockStatement
scripts/session-universe.mjs:162:15
-     if (output) {
-       // additionalContext is the ONLY Desktop-visible channel (chat) — see buildUniverseHookOutput.
-       process.stdout.write(JSON.stringify(output) + "\n");
-     }
+     if (output) {}

[Survived] StringLiteral
scripts/session-universe.mjs:164:51
-       process.stdout.write(JSON.stringify(output) + "\n");
+       process.stdout.write(JSON.stringify(output) + "");
