[Survived] Regex
scripts/lib/filed-note.mjs:29:14
-       .replace(/^-+|-+$/g, ""); // trim leading/trailing hyphens
+       .replace(/^-|-+$/g, ""); // trim leading/trailing hyphens

[Survived] Regex
scripts/lib/filed-note.mjs:29:14
-       .replace(/^-+|-+$/g, ""); // trim leading/trailing hyphens
+       .replace(/^-+|-$/g, ""); // trim leading/trailing hyphens

[Survived] Regex
scripts/lib/filed-note.mjs:138:44
-     return cardPath.split("/").pop().replace(/\.md$/, "").split("-")[0];
+     return cardPath.split("/").pop().replace(/\.md/, "").split("-")[0];

[Survived] StringLiteral
scripts/file-back-note.mjs:81:58
-         { existsSync, readFileSync: (p) => readFileSync(p, "utf-8") },
+         { existsSync, readFileSync: (p) => readFileSync(p, "") },

[Survived] StringLiteral
scripts/file-back-note.mjs:84:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] Regex
scripts/file-back-note.mjs:148:57
-         const firstName = String(spec.title).trim().split(/\s+/)[0];
+         const firstName = String(spec.title).trim().split(/\s/)[0];

[Survived] MethodExpression
scripts/file-back-note.mjs:167:28
-     process.exit(runFileBack(process.argv.slice(2)));
+     process.exit(runFileBack(process.argv));
