[Survived] Regex
scripts/lib/note-refresh.mjs:16:24
-   const FRONTMATTER_RE = /^(---\r?\n)([\s\S]*?)(\r?\n---\r?\n?)([\s\S]*)$/;
+   const FRONTMATTER_RE = /^(---\r?\n)([\s\S]*?)(\r?\n---\r?\n?)([\s\S]*)/;

[Survived] Regex
scripts/lib/note-refresh.mjs:56:26
-   const CONFIDENCE_BLOCK = /^> \*\*Confidence\*\* — .*$/m;
+   const CONFIDENCE_BLOCK = /^> \*\*Confidence\*\* — .*/m;

[Survived] Regex
scripts/lib/note-refresh.mjs:68:37
-     const h1 = lines.findIndex((l) => /^# /.test(l));
+     const h1 = lines.findIndex((l) => /# /.test(l));

[Survived] ConditionalExpression
scripts/lib/note-refresh.mjs:69:7
-     if (h1 === -1) return `${line}\n\n${body}`;
+     if (false) return `${line}\n\n${body}`;

[Survived] StringLiteral
scripts/lib/note-refresh.mjs:69:25
-     if (h1 === -1) return `${line}\n\n${body}`;
+     if (h1 === -1) return ``;

[Survived] ConditionalExpression
scripts/lib/note-refresh.mjs:75:10
-     while (at < lines.length && lines[at].trim() === "") at += 1;
+     while (true && lines[at].trim() === "") at += 1;

[Survived] EqualityOperator
scripts/lib/note-refresh.mjs:75:10
-     while (at < lines.length && lines[at].trim() === "") at += 1;
+     while (at <= lines.length && lines[at].trim() === "") at += 1;

[Survived] MethodExpression
scripts/lib/note-refresh.mjs:75:31
-     while (at < lines.length && lines[at].trim() === "") at += 1;
+     while (at < lines.length && lines[at] === "") at += 1;

[Survived] ConditionalExpression
scripts/lib/note-refresh.mjs:76:7
-     if (at < lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {
+     if (true && /^> \*\*Which one\*\* — /.test(lines[at])) {

[Survived] EqualityOperator
scripts/lib/note-refresh.mjs:76:7
-     if (at < lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {
+     if (at <= lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {

[Survived] Regex
scripts/lib/note-refresh.mjs:76:28
-     if (at < lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {
+     if (at < lines.length && /> \*\*Which one\*\* — /.test(lines[at])) {

[Survived] EqualityOperator
scripts/lib/note-refresh.mjs:78:12
-       while (at < lines.length && lines[at].trim() === "") at += 1;
+       while (at <= lines.length && lines[at].trim() === "") at += 1;

[Survived] ConditionalExpression
scripts/lib/note-refresh.mjs:78:12
-       while (at < lines.length && lines[at].trim() === "") at += 1;
+       while (true && lines[at].trim() === "") at += 1;

[Survived] MethodExpression
scripts/lib/note-refresh.mjs:78:33
-       while (at < lines.length && lines[at].trim() === "") at += 1;
+       while (at < lines.length && lines[at] === "") at += 1;

[Survived] StringLiteral
scripts/refresh-note.mjs:31:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] MethodExpression
scripts/refresh-note.mjs:109:27
-     process.exit(runRefresh(process.argv.slice(2)));
+     process.exit(runRefresh(process.argv));
