[Survived] ConditionalExpression
scripts/lib/note-refresh.mjs:79:7
-     if (at < lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {
+     if (true && /^> \*\*Which one\*\* — /.test(lines[at])) {

[Survived] EqualityOperator
scripts/lib/note-refresh.mjs:79:7
-     if (at < lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {
+     if (at <= lines.length && /^> \*\*Which one\*\* — /.test(lines[at])) {

[Survived] EqualityOperator
scripts/lib/note-refresh.mjs:81:12
-       while (at < lines.length && lines[at].trim() === "") at += 1;
+       while (at <= lines.length && lines[at].trim() === "") at += 1;

[Survived] ConditionalExpression
scripts/lib/note-refresh.mjs:81:12
-       while (at < lines.length && lines[at].trim() === "") at += 1;
+       while (true && lines[at].trim() === "") at += 1;

[Survived] MethodExpression
scripts/lib/note-refresh.mjs:81:33
-       while (at < lines.length && lines[at].trim() === "") at += 1;
+       while (at < lines.length && lines[at] === "") at += 1;
