[Survived] Regex
scripts/lib/hooks-reconcile.mjs:90:31
-   const BROKEN_WIN32_RUN_NODE = /^cmd \/c "[^"]*\\run-node\.cmd"/;
+   const BROKEN_WIN32_RUN_NODE = /cmd \/c "[^"]*\\run-node\.cmd"/;

[Survived] ConditionalExpression
scripts/lib/hooks-reconcile.mjs:95:7
-     if (typeof command !== "string" || !BROKEN_WIN32_RUN_NODE.test(command)) return command;
+     if (false) return command;
