[Survived] ConditionalExpression
rag/src/lib/index-shortfall.ts:61:25
-     if (asked !== null && asked !== undefined && remaining >= asked) return "stalled";
+     if (asked !== null && true && remaining >= asked) return "stalled";

[Survived] ConditionalExpression
rag/src/lib/status-report.ts:78:21
-       const waiting = shortfall.queued > 0 ? `, ${shortfall.queued} pending` : "";
+       const waiting = true ? `, ${shortfall.queued} pending` : "";

[Survived] EqualityOperator
rag/src/lib/status-report.ts:78:21
-       const waiting = shortfall.queued > 0 ? `, ${shortfall.queued} pending` : "";
+       const waiting = shortfall.queued >= 0 ? `, ${shortfall.queued} pending` : "";

[Survived] StringLiteral
rag/src/lib/status-report.ts:78:78
-       const waiting = shortfall.queued > 0 ? `, ${shortfall.queued} pending` : "";
+       const waiting = shortfall.queued > 0 ? `, ${shortfall.queued} pending` : "Stryker was here!";

[Survived] MethodExpression
rag/src/lib/status-report.ts:105:17
-     const shown = errors.slice(0, max).join("; ");
+     const shown = errors.join("; ");

[Survived] StringLiteral
rag/src/lib/status-report.ts:105:43
-     const shown = errors.slice(0, max).join("; ");
+     const shown = errors.slice(0, max).join("");

[Survived] EqualityOperator
rag/src/lib/status-report.ts:107:10
-     return rest > 0 ? `${shown} (+${rest} other(s))` : shown;
+     return rest >= 0 ? `${shown} (+${rest} other(s))` : shown;

[Survived] ConditionalExpression
rag/src/lib/status-report.ts:107:10
-     return rest > 0 ? `${shown} (+${rest} other(s))` : shown;
+     return false ? `${shown} (+${rest} other(s))` : shown;

[Survived] StringLiteral
rag/src/lib/status-report.ts:107:21
-     return rest > 0 ? `${shown} (+${rest} other(s))` : shown;
+     return rest > 0 ? `` : shown;
