[Survived] Regex
scripts/lib/frozen-wiring.mjs:33:24
-     return diffOut.split(/\r?\n/).filter((line) => line.trim().length > 0);
+     return diffOut.split(/\r\n/).filter((line) => line.trim().length > 0);

[Survived] MethodExpression
scripts/lib/frozen-wiring.mjs:33:50
-     return diffOut.split(/\r?\n/).filter((line) => line.trim().length > 0);
+     return diffOut.split(/\r?\n/).filter((line) => line.length > 0);

[Survived] StringLiteral
scripts/lib/restart-nudge.mjs:59:5
-       "loads its hooks, skills and servers only at start. Open your reply by telling the " +
+       "" +

[Survived] BooleanLiteral
scripts/lib/restart-signal.mjs:26:19
-     let gapNeeded = false;
+     let gapNeeded = true;

[Survived] StringLiteral
scripts/lib/restart-signal.mjs:29:32
-       const mcpPath = join(repo, ".mcp.json");
+       const mcpPath = join(repo, "");

[Survived] StringLiteral
scripts/lib/restart-signal.mjs:31:62
-         ? new Set(Object.keys(JSON.parse(readFileSync(mcpPath, "utf8")).mcpServers ?? {}))
+         ? new Set(Object.keys(JSON.parse(readFileSync(mcpPath, "")).mcpServers ?? {}))

[Survived] LogicalOperator
scripts/lib/restart-signal.mjs:31:29
-         ? new Set(Object.keys(JSON.parse(readFileSync(mcpPath, "utf8")).mcpServers ?? {}))
+         ? new Set(Object.keys(JSON.parse(readFileSync(mcpPath, "utf8")).mcpServers && {}))

[Survived] ArrowFunction
scripts/lib/restart-signal.mjs:36:23
-         skillDirExists: (dir) => existsSync(join(repo, dir)),
+         skillDirExists: () => undefined,

[Survived] ArrowFunction
scripts/lib/restart-signal.mjs:37:28
-         mcpServerRegistered: (id) => registered.has(id),
+         mcpServerRegistered: () => undefined,

[Survived] BlockStatement
scripts/lib/restart-signal.mjs:39:11
-     } catch {
-       gapNeeded = false;
-     }
+     } catch {}

[Survived] BooleanLiteral
scripts/lib/restart-signal.mjs:43:20
-     let flagExists = false;
+     let flagExists = true;

[Survived] BlockStatement
scripts/lib/restart-signal.mjs:46:11
-     } catch {
-       flagExists = false;
-     }
+     } catch {}

[Survived] BooleanLiteral
scripts/lib/restart-signal.mjs:47:18
-       flagExists = false;
+       flagExists = true;
