[Survived] BlockStatement
scripts/lib/restart-signal.mjs:51:11
-     } catch {
-       return false;
-     }
+     } catch {}

[Survived] ConditionalExpression
scripts/prompt-restart-nudge.mjs:55:5
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
+   if (true) {
