[Survived] OptionalChaining
scripts/lib/engine-update-check.mjs:99:53
-     const byTag = new Map(published.map((release) => [release?.tag_name, release]));
+     const byTag = new Map(published.map((release) => [release.tag_name, release]));

[Survived] ConditionalExpression
scripts/lib/engine-update-check.mjs:111:39
-     return typeof value === "string" && value.trim() !== "" ? value : null;
+     return typeof value === "string" && true ? value : null;

[Survived] MethodExpression
scripts/lib/engine-update-check.mjs:111:39
-     return typeof value === "string" && value.trim() !== "" ? value : null;
+     return typeof value === "string" && value !== "" ? value : null;

[Survived] StringLiteral
scripts/lib/engine-update-check.mjs:111:56
-     return typeof value === "string" && value.trim() !== "" ? value : null;
+     return typeof value === "string" && value.trim() !== "Stryker was here!" ? value : null;

[Survived] ConditionalExpression
scripts/lib/engine-update-check.mjs:123:7
-     if (!repo) return null;
+     if (false) return null;

[Survived] Regex
scripts/lib/engine-update-check.mjs:135:13
-     const m = /^(?:git@github\.com:|(?:https?|ssh):\/\/(?:git@)?github\.com\/)([^/]+)\/(.+?)(?:\.git)?$/.exec(
+     const m = /(?:git@github\.com:|(?:https?|ssh):\/\/(?:git@)?github\.com\/)([^/]+)\/(.+?)(?:\.git)?$/.exec(

[Survived] Regex
scripts/lib/engine-update-check.mjs:135:13
-     const m = /^(?:git@github\.com:|(?:https?|ssh):\/\/(?:git@)?github\.com\/)([^/]+)\/(.+?)(?:\.git)?$/.exec(
+     const m = /^(?:git@github\.com:|(?:https|ssh):\/\/(?:git@)?github\.com\/)([^/]+)\/(.+?)(?:\.git)?$/.exec(

[Survived] Regex
scripts/lib/engine-update-check.mjs:148:43
-     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*$/i.test(line.trim()));
+     const start = lines.findIndex((line) => /#{1,6}\s+What you get\s*$/i.test(line.trim()));

[Survived] Regex
scripts/lib/engine-update-check.mjs:148:43
-     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*$/i.test(line.trim()));
+     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*/i.test(line.trim()));

[Survived] Regex
scripts/lib/engine-update-check.mjs:148:43
-     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*$/i.test(line.trim()));
+     const start = lines.findIndex((line) => /^#{1,6}\sWhat you get\s*$/i.test(line.trim()));

[Survived] Regex
scripts/lib/engine-update-check.mjs:148:43
-     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*$/i.test(line.trim()));
+     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\S*$/i.test(line.trim()));

[Survived] MethodExpression
scripts/lib/engine-update-check.mjs:148:78
-     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*$/i.test(line.trim()));
+     const start = lines.findIndex((line) => /^#{1,6}\s+What you get\s*$/i.test(line));

[Survived] ConditionalExpression
scripts/lib/engine-update-check.mjs:149:7
-     if (start === -1) return null;
+     if (false) return null;

[Survived] UnaryOperator
scripts/lib/engine-update-check.mjs:149:17
-     if (start === -1) return null;
+     if (start === +1) return null;

[Survived] Regex
scripts/lib/engine-update-check.mjs:151:40
-     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line.trim()));
+     const end = rest.findIndex((line) => /(#{1,6}\s|---\s*$)/.test(line.trim()));

[Survived] Regex
scripts/lib/engine-update-check.mjs:151:40
-     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line.trim()));
+     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s$)/.test(line.trim()));

[Survived] MethodExpression
scripts/lib/engine-update-check.mjs:151:67
-     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line.trim()));
+     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line));

[Survived] ConditionalExpression
scripts/lib/engine-update-check.mjs:152:20
-     const section = (end === -1 ? rest : rest.slice(0, end)).join("\n").trim();
+     const section = (false ? rest : rest.slice(0, end)).join("\n").trim();

[Survived] UnaryOperator
scripts/lib/engine-update-check.mjs:152:28
-     const section = (end === -1 ? rest : rest.slice(0, end)).join("\n").trim();
+     const section = (end === +1 ? rest : rest.slice(0, end)).join("\n").trim();

[Survived] BlockStatement
scripts/lib/engine-update-check.mjs:174:13
-     } finally {
-       clearTimeout(timer);
-     }
+     } finally {}
