[Survived] ArrayDeclaration
scripts/update-engine.mjs:85:167
-     const { ref, engineVersion, copied, regenerated, reindexed, reindexReason, vaultNoteCount, committed, installedSkills = [], skillsRefreshed = [], skillsPreserved = [], mcpServersAdded = [], hooksAdded = [], hooksRepaired = [], statusLineRemoved = false } = report;
+     const { ref, engineVersion, copied, regenerated, reindexed, reindexReason, vaultNoteCount, committed, installedSkills = [], skillsRefreshed = [], skillsPreserved = ["Stryker was here"], mcpServersAdded = [], hooksAdded = [], hooksRepaired = [], statusLineRemoved = false } = report;

[Survived] StringLiteral
scripts/update-engine.mjs:161:7
-         `   repo, and committing would have buried the <<<<<<< markers in it. Resolve that`,
+         ``,

[Survived] StringLiteral
scripts/update-engine.mjs:162:7
-         `   conflict, then commit — your engine is updated on disk either way.`,
+         ``,

[Survived] StringLiteral
scripts/update-engine.mjs:170:7
-         `   git config --global user.email "you@example.com"). They are staged and waiting;`,
+         ``,

[Survived] StringLiteral
scripts/update-engine.mjs:171:7
-         `   commit them once git is happy, or your brain's startup pull stays blocked.`,
+         ``,

[Survived] StringLiteral
scripts/update-engine.mjs:238:55
-     const local = JSON.parse(readFileSync(manifestPath, "utf8"));
+     const local = JSON.parse(readFileSync(manifestPath, ""));

[Survived] StringLiteral
scripts/update-engine.mjs:300:87
-       ...Object.fromEntries(copied.map((rel) => [rel, readFileSync(join(brainDir, rel), "utf8")])),
+       ...Object.fromEntries(copied.map((rel) => [rel, readFileSync(join(brainDir, rel), "")])),

[Survived] BlockStatement
scripts/update-engine.mjs:408:54
-   export function defaultReadInstalledSource(brainDir) {
-     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
-     return { repo: source?.repo ?? null, ref: source?.ref ?? null };
-   }
+   export function defaultReadInstalledSource(brainDir) {}

[Survived] StringLiteral
scripts/update-engine.mjs:409:61
-     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
+     const { source } = JSON.parse(readFileSync(join(brainDir, ""), "utf8"));

[Survived] StringLiteral
scripts/update-engine.mjs:409:86
-     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), "utf8"));
+     const { source } = JSON.parse(readFileSync(join(brainDir, "engine-manifest.json"), ""));

[Survived] ObjectLiteral
scripts/update-engine.mjs:410:10
-     return { repo: source?.repo ?? null, ref: source?.ref ?? null };
+     return {};

[Survived] LogicalOperator
scripts/update-engine.mjs:410:18
-     return { repo: source?.repo ?? null, ref: source?.ref ?? null };
+     return { repo: source?.repo && null, ref: source?.ref ?? null };

[Survived] OptionalChaining
scripts/update-engine.mjs:410:18
-     return { repo: source?.repo ?? null, ref: source?.ref ?? null };
+     return { repo: source.repo ?? null, ref: source?.ref ?? null };

[Survived] LogicalOperator
scripts/update-engine.mjs:410:45
-     return { repo: source?.repo ?? null, ref: source?.ref ?? null };
+     return { repo: source?.repo ?? null, ref: source?.ref && null };

[Survived] OptionalChaining
scripts/update-engine.mjs:410:45
-     return { repo: source?.repo ?? null, ref: source?.ref ?? null };
+     return { repo: source?.repo ?? null, ref: source.ref ?? null };

[Survived] ArrayDeclaration
scripts/update-engine.mjs:433:21
-             releases: [],
+             releases: ["Stryker was here"],

[Survived] MethodExpression
scripts/update-engine.mjs:444:66
-   export async function runUpdateCli(deps = realUpdateDeps, argv = process.argv.slice(2)) {
+   export async function runUpdateCli(deps = realUpdateDeps, argv = process.argv) {
