[Survived] ArrowFunction
scripts/session-status.mjs:220:20
-     const readJson = (p) => (existsSync(p) ? JSON.parse(readFileSync(p, "utf8")) : null);
+     const readJson = () => undefined;

[Survived] StringLiteral
scripts/session-status.mjs:220:71
-     const readJson = (p) => (existsSync(p) ? JSON.parse(readFileSync(p, "utf8")) : null);
+     const readJson = (p) => (existsSync(p) ? JSON.parse(readFileSync(p, "")) : null);

[Survived] ConditionalExpression
scripts/session-status.mjs:221:7
-     if (shouldReprobe({
-       cached: readJson(upstreamPath),
-       installedRef: readJson(manifestPath)?.source?.ref ?? null,
-       now: Date.now(),
-     })) {
+     if (true) {

[Survived] ConditionalExpression
scripts/session-status.mjs:221:7
-     if (shouldReprobe({
-       cached: readJson(upstreamPath),
-       installedRef: readJson(manifestPath)?.source?.ref ?? null,
-       now: Date.now(),
-     })) {
+     if (false) {

[Survived] ObjectLiteral
scripts/session-status.mjs:221:21
-     if (shouldReprobe({
-       cached: readJson(upstreamPath),
-       installedRef: readJson(manifestPath)?.source?.ref ?? null,
-       now: Date.now(),
-     })) {
+     if (shouldReprobe({})) {

[Survived] LogicalOperator
scripts/session-status.mjs:223:19
-       installedRef: readJson(manifestPath)?.source?.ref ?? null,
+       installedRef: readJson(manifestPath)?.source?.ref && null,

[Survived] OptionalChaining
scripts/session-status.mjs:223:19
-       installedRef: readJson(manifestPath)?.source?.ref ?? null,
+       installedRef: readJson(manifestPath).source?.ref ?? null,

[Survived] OptionalChaining
scripts/session-status.mjs:223:19
-       installedRef: readJson(manifestPath)?.source?.ref ?? null,
+       installedRef: readJson(manifestPath)?.source.ref ?? null,

[Survived] ArrayDeclaration
scripts/session-status.mjs:228:7
-         [join(__dirname, "upstream-check-run.mjs"), "--brainDir", REPO],
+         [],

[Survived] BlockStatement
scripts/session-status.mjs:225:7
-     })) {
-       const child = spawn(
-         process.execPath,
-         [join(__dirname, "upstream-check-run.mjs"), "--brainDir", REPO],
-         { detached: true, stdio: "ignore", windowsHide: true },
-       );
-       child.unref();
-     }
+     })) {}

[Survived] StringLiteral
scripts/session-status.mjs:228:24
-         [join(__dirname, "upstream-check-run.mjs"), "--brainDir", REPO],
+         [join(__dirname, ""), "--brainDir", REPO],

[Survived] StringLiteral
scripts/session-status.mjs:228:51
-         [join(__dirname, "upstream-check-run.mjs"), "--brainDir", REPO],
+         [join(__dirname, "upstream-check-run.mjs"), "", REPO],

[Survived] ObjectLiteral
scripts/session-status.mjs:229:7
-         { detached: true, stdio: "ignore", windowsHide: true },
+         {},

[Survived] BooleanLiteral
scripts/session-status.mjs:229:19
-         { detached: true, stdio: "ignore", windowsHide: true },
+         { detached: false, stdio: "ignore", windowsHide: true },

[Survived] StringLiteral
scripts/session-status.mjs:229:32
-         { detached: true, stdio: "ignore", windowsHide: true },
+         { detached: true, stdio: "", windowsHide: true },

[Survived] BooleanLiteral
scripts/session-status.mjs:229:55
-         { detached: true, stdio: "ignore", windowsHide: true },
+         { detached: true, stdio: "ignore", windowsHide: false },

[Survived] ObjectLiteral
scripts/session-status.mjs:241:27
-       buildStatusHookOutput({
-         leadLine: restartLine,
-         versionLine,
-         statusLines: [bootstrapLine, keyLine, repoLine, ragLine],
-       }),
+       buildStatusHookOutput({}),

[Survived] ArrayDeclaration
scripts/session-status.mjs:244:20
-         statusLines: [bootstrapLine, keyLine, repoLine, ragLine],
+         statusLines: [],

[Survived] StringLiteral
scripts/session-status.mjs:246:7
-     ) + "\n"
+     ) + ""
