[Survived] ArrayDeclaration
scripts/lib/ai-summary-guard.mjs:52:54
-     return TURN_SHAPES.some((re) => (text.match(re) ?? []).length >= MIN_TURNS);
+     return TURN_SHAPES.some((re) => (text.match(re) ?? ["Stryker was here"]).length >= MIN_TURNS);

[Survived] ConditionalExpression
scripts/lib/ai-summary-guard.mjs:76:9
-       if (Array.isArray(value)) {
+       if (false) {

[Survived] BlockStatement
scripts/lib/ai-summary-guard.mjs:76:31
-       if (Array.isArray(value)) {
-         for (const item of value) walk(item);
-         return;
-       }
+       if (Array.isArray(value)) {}

[Survived] ConditionalExpression
scripts/lib/ai-summary-guard.mjs:80:18
-       if (value && typeof value === "object") {
+       if (value && true) {

[Survived] EqualityOperator
scripts/lib/filed-note.mjs:101:31
-       .reduce((worst, tier) => (rank.indexOf(tier) > rank.indexOf(worst) ? tier : worst));
+       .reduce((worst, tier) => (rank.indexOf(tier) >= rank.indexOf(worst) ? tier : worst));

[Survived] Regex
scripts/lib/filed-note.mjs:217:44
-     return cardPath.split("/").pop().replace(/\.md$/, "").split("-")[0];
+     return cardPath.split("/").pop().replace(/\.md/, "").split("-")[0];

[Survived] StringLiteral
scripts/ai-summary-guard.mjs:26:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] OptionalChaining
scripts/ai-summary-guard.mjs:46:25
-         text: payloadText(input?.tool_response),
+         text: payloadText(input.tool_response),

[Survived] OptionalChaining
scripts/ai-summary-guard.mjs:47:32
-         fromSearch: isSearchTool(input?.tool_name),
+         fromSearch: isSearchTool(input.tool_name),
