[Survived] Regex
scripts/lib/ai-summary-guard.mjs:30:3
-     /\bnotes\s+de\s+Gemini\b/i,
+     /\bnotes\sde\s+Gemini\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:30:3
-     /\bnotes\s+de\s+Gemini\b/i,
+     /\bnotes\S+de\s+Gemini\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:30:3
-     /\bnotes\s+de\s+Gemini\b/i,
+     /\bnotes\s+de\sGemini\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:30:3
-     /\bnotes\s+de\s+Gemini\b/i,
+     /\bnotes\s+de\S+Gemini\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:31:3
-     /\bGemini['’]s\s+notes\b/i,
+     /\bGemini['’]s\snotes\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:31:3
-     /\bGemini['’]s\s+notes\b/i,
+     /\bGemini[^'’]s\s+notes\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:31:3
-     /\bGemini['’]s\s+notes\b/i,
+     /\bGemini['’]s\S+notes\b/i,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:28
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:28
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*/im, /^\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:28
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:28
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\S*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:28
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\S*$/im, /^\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:28
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s$/im, /^\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /\s*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\S*#*\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#\s*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\S*(Transcript)\s*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:35:57
-   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\s*$/im];
+   const VERBATIM_HEADINGS = [/^\s*(Transcription)\s*$/im, /^\s*#*\s*(Transcript)\S*$/im];

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[^\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[\P{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[\p{Lu}][\p{L}'’. -]{0,30}\s\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d)?\s*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\D{2})?\s*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:41:3
-     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\s*$/gmu,
+     /^[\p{Lu}][\p{L}'’. -]{0,30}\s{2,}\d{1,2}:\d{2}(?::\d{2})?\S*$/gmu,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:42:3
-     /^\*\*[^*\n]{1,40}\*\*\s*:/gm,
+     /\*\*[^*\n]{1,40}\*\*\s*:/gm,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:42:3
-     /^\*\*[^*\n]{1,40}\*\*\s*:/gm,
+     /^\*\*[^*\n]\*\*\s*:/gm,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:42:3
-     /^\*\*[^*\n]{1,40}\*\*\s*:/gm,
+     /^\*\*[*\n]{1,40}\*\*\s*:/gm,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:42:3
-     /^\*\*[^*\n]{1,40}\*\*\s*:/gm,
+     /^\*\*[^*\n]{1,40}\*\*\s:/gm,

[Survived] Regex
scripts/lib/ai-summary-guard.mjs:42:3
-     /^\*\*[^*\n]{1,40}\*\*\s*:/gm,
+     /^\*\*[^*\n]{1,40}\*\*\S*:/gm,

[Survived] ArrayDeclaration
scripts/lib/ai-summary-guard.mjs:47:54
-     return TURN_SHAPES.some((re) => (text.match(re) ?? []).length >= MIN_TURNS);
+     return TURN_SHAPES.some((re) => (text.match(re) ?? ["Stryker was here"]).length >= MIN_TURNS);

[Survived] ConditionalExpression
scripts/lib/ai-summary-guard.mjs:65:9
-       if (size >= MAX_TEXT) return;
+       if (false) return;

[Survived] EqualityOperator
scripts/lib/ai-summary-guard.mjs:65:9
-       if (size >= MAX_TEXT) return;
+       if (size > MAX_TEXT) return;

[Survived] AssignmentOperator
scripts/lib/ai-summary-guard.mjs:68:7
-         size += value.length;
+         size -= value.length;

[Survived] ConditionalExpression
scripts/lib/ai-summary-guard.mjs:71:9
-       if (Array.isArray(value)) {
+       if (false) {

[Survived] BlockStatement
scripts/lib/ai-summary-guard.mjs:71:31
-       if (Array.isArray(value)) {
-         for (const item of value) walk(item);
-         return;
-       }
+       if (Array.isArray(value)) {}

[Survived] LogicalOperator
scripts/lib/ai-summary-guard.mjs:75:9
-       if (value && typeof value === "object") {
+       if (value || typeof value === "object") {

[Survived] ConditionalExpression
scripts/lib/ai-summary-guard.mjs:75:18
-       if (value && typeof value === "object") {
+       if (value && true) {

[Survived] StringLiteral
scripts/lib/ai-summary-guard.mjs:96:7
-         `Do not lift the summary's own list of actions out of the snippet.`
+         ``

[Survived] StringLiteral
scripts/lib/ai-summary-guard.mjs:109:7
-         `and do not take the actions from the summary's own list.`
+         ``

[Survived] StringLiteral
scripts/lib/ai-summary-guard.mjs:117:5
-       `before you write anything from this: in these exports it usually sits BELOW the summary, ` +
+       `` +

[Survived] StringLiteral
scripts/lib/ai-summary-guard.mjs:119:5
-       `declare the tier you actually read.`
+       ``

[Survived] StringLiteral
scripts/lib/filed-note.mjs:113:11
-             `and declare the tier you actually read (${Object.keys(SOURCE_TIERS).join(", ")}).`,
+             ``,

[Survived] StringLiteral
scripts/lib/filed-note.mjs:113:85
-             `and declare the tier you actually read (${Object.keys(SOURCE_TIERS).join(", ")}).`,
+             `and declare the tier you actually read (${Object.keys(SOURCE_TIERS).join("")}).`,

[Survived] StringLiteral
scripts/lib/filed-note.mjs:124:11
-             `so the reading can be gone back to.`,
+             ``,

[Survived] StringLiteral
scripts/lib/filed-note.mjs:129:39
-     return `> **Sources**\n${lines.join("\n")}`;
+     return `> **Sources**\n${lines.join("")}`;

[Survived] StringLiteral
scripts/lib/filed-note.mjs:168:9
-           `"sources": [{ "tier": …, "ref": … }] — tier is one of ` +
+           `` +

[Survived] StringLiteral
scripts/lib/filed-note.mjs:178:70
-     const built = spec.sources ? `${sourcesBlock(spec.sources)}\n\n` : "";
+     const built = spec.sources ? `${sourcesBlock(spec.sources)}\n\n` : "Stryker was here!";

[Survived] ArrayDeclaration
scripts/lib/filed-note.mjs:191:78
-       ...(spec.sources ? [`source_tier: ${weakestSourceTier(spec.sources)}`] : []),
+       ...(spec.sources ? [`source_tier: ${weakestSourceTier(spec.sources)}`] : ["Stryker was here"]),

[Survived] Regex
scripts/lib/filed-note.mjs:212:44
-     return cardPath.split("/").pop().replace(/\.md$/, "").split("-")[0];
+     return cardPath.split("/").pop().replace(/\.md/, "").split("-")[0];

[Survived] ConditionalExpression
scripts/ai-summary-guard.mjs:35:10
-     return typeof toolName === "string" && /search/i.test(toolName);
+     return true && /search/i.test(toolName);
