[Survived] MethodExpression
scripts/lib/connector-accounts.mjs:30:8
-     if (!entries.some((entry) => isVerifiable(toolOf(entry)))) return declared;
+     if (!entries.every(entry => isVerifiable(toolOf(entry)))) return declared;

[Survived] StringLiteral
scripts/lib/connector-accounts.mjs:55:15
-         status: "undeclared",
+         status: "",

[Survived] StringLiteral
scripts/lib/connector-accounts.mjs:58:61
-           `against. Slack is on '${slackWorkspace(observed ?? "")}'. ` +
+           `against. Slack is on '${slackWorkspace(observed ?? "Stryker was here!")}'. ` +

[Survived] StringLiteral
scripts/lib/connector-accounts.mjs:66:50
-       const workspace = slackWorkspace(observed ?? "");
+       const workspace = slackWorkspace(observed ?? "Stryker was here!");

[Survived] StringLiteral
scripts/lib/connector-accounts.mjs:68:15
-         status: "undeclared",
+         status: "",

[Survived] MethodExpression
scripts/lib/connector-accounts.mjs:83:18
-     const wanted = String(tool).trim().toLowerCase();
+     const wanted = String(tool).toLowerCase();

[Survived] ConditionalExpression
scripts/lib/connector-accounts.mjs:84:39
-     const hit = entries.find((entry) => toolOf(entry).trim().toLowerCase() === wanted);
+     const hit = entries.find((entry) => true);

[Survived] MethodExpression
scripts/lib/connector-accounts.mjs:84:39
-     const hit = entries.find((entry) => toolOf(entry).trim().toLowerCase() === wanted);
+     const hit = entries.find((entry) => toolOf(entry).toLowerCase() === wanted);

[Survived] MethodExpression
scripts/lib/connector-accounts.mjs:85:37
-     return hit === undefined ? null : hit.slice(hit.indexOf(":") + 1).trim();
+     return hit === undefined ? null : hit.slice(hit.indexOf(":") + 1);

[Survived] Regex
scripts/lib/connector-accounts.mjs:146:14
-       .replace(/^[a-z][a-z0-9+.-]*:\/\//, "")
+       .replace(/[a-z][a-z0-9+.-]*:\/\//, "")

[Survived] Regex
scripts/lib/connector-accounts.mjs:147:14
-       .replace(/\.slack\.com.*$/, "");
+       .replace(/\.slack\.com.*/, "");

[Survived] StringLiteral
scripts/lib/consolidation-candidates.mjs:27:50
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "topic", "", "project", "concept"];

[Survived] StringLiteral
scripts/lib/consolidation-candidates.mjs:27:61
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "", "concept"];

[Survived] StringLiteral
scripts/lib/consolidation-candidates.mjs:27:72
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", ""];

[Survived] ConditionalExpression
scripts/lib/consolidation-candidates.mjs:103:9
-       if (items.length === 0) return;
+       if (false) return;

[Survived] StringLiteral
scripts/lib/consolidation-candidates.mjs:119:17
-             .join(", ")}`,
+             .join("")}`,

[Survived] MethodExpression
scripts/lib/wiki-lint.mjs:28:17
-       .map((m) => m[1].split(/[|#]/)[0].trim())
+       .map((m) => m[1].split(/[|#]/)[0])

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:50:9
-       if (!byKey.has(key)) byKey.set(key, path);
+       if (true) byKey.set(key, path);

[Survived] LogicalOperator
scripts/lib/wiki-lint.mjs:59:22
-     return (target) => byKey.get(target) ?? byKey.get(target.replace(/\.md$/, "")) ?? null;
+     return (target) => byKey.get(target) && byKey.get(target.replace(/\.md$/, "")) ?? null;

[Survived] Regex
scripts/lib/wiki-lint.mjs:59:68
-     return (target) => byKey.get(target) ?? byKey.get(target.replace(/\.md$/, "")) ?? null;
+     return (target) => byKey.get(target) ?? byKey.get(target.replace(/\.md/, "")) ?? null;

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:59:77
-     return (target) => byKey.get(target) ?? byKey.get(target.replace(/\.md$/, "")) ?? null;
+     return (target) => byKey.get(target) ?? byKey.get(target.replace(/\.md$/, "Stryker was here!")) ?? null;

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:72:10
-     return firstSlash !== -1 && path.slice(firstSlash + 1).startsWith(prefix);
+     return true && path.slice(firstSlash + 1).startsWith(prefix);

[Survived] UnaryOperator
scripts/lib/wiki-lint.mjs:72:25
-     return firstSlash !== -1 && path.slice(firstSlash + 1).startsWith(prefix);
+     return firstSlash !== +1 && path.slice(firstSlash + 1).startsWith(prefix);

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:116:41
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "", "company", "project", "concept"];

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:116:50
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "topic", "", "project", "concept"];

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:116:61
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "", "concept"];

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:116:72
-   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", "concept"];
+   const DEFAULT_ENTITY_TYPES = ["person", "topic", "company", "project", ""];

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:127:7
-     if (Array.isArray(value)) return value.length > 0;
+     if (true) return value.length > 0;

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:161:21
-           const key = `${note.path}\0${target}`;
+           const key = ``;

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:171:11
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (true) {

[Survived] LogicalOperator
scripts/lib/wiki-lint.mjs:171:11
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (when || !seen || Date.parse(when) > Date.parse(seen)) {

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:171:20
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (when && (true)) {

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:171:29
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (when && (!seen || false)) {

[Survived] EqualityOperator
scripts/lib/wiki-lint.mjs:171:29
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (when && (!seen || Date.parse(when) >= Date.parse(seen))) {

[Survived] EqualityOperator
scripts/lib/wiki-lint.mjs:171:29
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (when && (!seen || Date.parse(when) <= Date.parse(seen))) {

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:187:9
-       if (freshest && updated && daysBetween(freshest, updated) > staleDays) {
+       if (true && daysBetween(freshest, updated) > staleDays) {

[Survived] LogicalOperator
scripts/lib/wiki-lint.mjs:187:9
-       if (freshest && updated && daysBetween(freshest, updated) > staleDays) {
+       if (freshest || updated && daysBetween(freshest, updated) > staleDays) {
