[Survived] OptionalChaining
scripts/lib/universe-profile.mjs:93:26
-       return Array.isArray(parsed?.declined) ? parsed.declined : [];
+       return Array.isArray(parsed.declined) ? parsed.declined : [];

[Survived] ArrayDeclaration
scripts/lib/universe-profile.mjs:188:75
-     const out = { about: [], people: [], topics: [], connectors: [], other: [] };
+     const out = { about: [], people: [], topics: [], connectors: [], other: ["Stryker was here"] };

[Survived] Regex
scripts/lib/universe-profile.mjs:191:32
-       const heading = line.match(/^##\s+(.*)$/);
+       const heading = line.match(/^##\s+(.*)/);

[Survived] Regex
scripts/lib/universe-profile.mjs:191:32
-       const heading = line.match(/^##\s+(.*)$/);
+       const heading = line.match(/^##\s(.*)$/);

[Survived] Regex
scripts/lib/universe-profile.mjs:199:65
-       out[current].push(current === "about" ? line : line.replace(/^[-*]\s*/, ""));
+       out[current].push(current === "about" ? line : line.replace(/^[-*]\s/, ""));

[Survived] ObjectLiteral
scripts/set-universe-profile.mjs:49:16
-   const realIo = {
-     existsSync,
-     readFileSync: (p) => readFileSync(p, "utf-8"),
-     writeFileSync,
-     mkdirSync,
-   };
+   const realIo = {};

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:51:17
-     readFileSync: (p) => readFileSync(p, "utf-8"),
+     readFileSync: () => undefined,

[Survived] StringLiteral
scripts/set-universe-profile.mjs:51:40
-     readFileSync: (p) => readFileSync(p, "utf-8"),
+     readFileSync: (p) => readFileSync(p, ""),

[Survived] ObjectLiteral
scripts/set-universe-profile.mjs:56:32
-   export const realProfileDeps = {
-     cwd: () => process.cwd(),
-     today: () => new Date().toISOString().slice(0, 10),
-     activeUniverse: () => readActiveUniverse(realIo, vaultRagDir(process.cwd())),
-     readInput: () => readFileSync(0, "utf8"),
-     io: realIo,
-     spawnSync,
-     platform: process.platform,
-     log: (...a) => console.log(...a),
-     error: (...a) => console.error(...a),
-   };
+   export const realProfileDeps = {};

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:58:10
-     today: () => new Date().toISOString().slice(0, 10),
+     today: () => undefined,

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:57:8
-     cwd: () => process.cwd(),
+     cwd: () => undefined,

[Survived] MethodExpression
scripts/set-universe-profile.mjs:58:16
-     today: () => new Date().toISOString().slice(0, 10),
+     today: () => new Date().toISOString(),

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:59:19
-     activeUniverse: () => readActiveUniverse(realIo, vaultRagDir(process.cwd())),
+     activeUniverse: () => undefined,

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:60:14
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => undefined,

[Survived] StringLiteral
scripts/set-universe-profile.mjs:60:36
-     readInput: () => readFileSync(0, "utf8"),
+     readInput: () => readFileSync(0, ""),

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:64:8
-     log: (...a) => console.log(...a),
+     log: () => undefined,

[Survived] ArrowFunction
scripts/set-universe-profile.mjs:65:10
-     error: (...a) => console.error(...a),
+     error: () => undefined,

[Survived] BlockStatement
scripts/set-universe-profile.mjs:134:17
-     } catch (err) {
-       deps.error(`✗ Invalid JSON answers on stdin: ${err.message}`);
-       return 1;
-     }
+     } catch (err) {}

[Survived] StringLiteral
scripts/set-universe-profile.mjs:135:16
-       deps.error(`✗ Invalid JSON answers on stdin: ${err.message}`);
+       deps.error(``);

[Survived] ConditionalExpression
scripts/set-universe-profile.mjs:160:15
-     const NPM = deps.platform === "win32" ? "npm.cmd" : "npm";
+     const NPM = false ? "npm.cmd" : "npm";

[Survived] StringLiteral
scripts/set-universe-profile.mjs:160:33
-     const NPM = deps.platform === "win32" ? "npm.cmd" : "npm";
+     const NPM = deps.platform === "" ? "npm.cmd" : "npm";

[Survived] StringLiteral
scripts/set-universe-profile.mjs:160:43
-     const NPM = deps.platform === "win32" ? "npm.cmd" : "npm";
+     const NPM = deps.platform === "win32" ? "" : "npm";

[Survived] ConditionalExpression
scripts/set-universe-profile.mjs:175:5
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
+   if (false) {

[Survived] BlockStatement
scripts/set-universe-profile.mjs:175:53
-   if (isEntrypoint(import.meta.url, process.argv[1])) {
-     process.exit(runSetUniverseProfile(process.argv.slice(2)));
-   }
+   if (isEntrypoint(import.meta.url, process.argv[1])) {}

[Survived] MethodExpression
scripts/set-universe-profile.mjs:176:38
-     process.exit(runSetUniverseProfile(process.argv.slice(2)));
+     process.exit(runSetUniverseProfile(process.argv));
