[Survived] ArrayDeclaration
scripts/lib/engine-update-check.mjs:24:19
-     return (tags ?? [])
+     return (tags ?? ["Stryker was here"])

[Survived] ArrayDeclaration
scripts/lib/engine-update-check.mjs:43:46
-     const latest = pickLatestSemverTag(tags ?? []);
+     const latest = pickLatestSemverTag(tags ?? ["Stryker was here"]);

[Survived] ConditionalExpression
scripts/lib/engine-update-check.mjs:80:13
-       target: ahead.length > 0 ? ahead[ahead.length - 1] : latest,
+       target: false ? ahead[ahead.length - 1] : latest,

[Survived] StringLiteral
scripts/lib/engine-update-check.mjs:136:13
-       repo ?? "",
+       repo ?? "Stryker was here!",

[Survived] StringLiteral
scripts/lib/engine-update-check.mjs:147:26
-     const lines = (body ?? "").split("\n");
+     const lines = (body ?? "Stryker was here!").split("\n");

[Survived] Regex
scripts/lib/engine-update-check.mjs:151:40
-     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line.trim()));
+     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*)/.test(line.trim()));

[Survived] Regex
scripts/lib/engine-update-check.mjs:151:40
-     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line.trim()));
+     const end = rest.findIndex((line) => /^(#{1,6}\S|---\s*$)/.test(line.trim()));

[Survived] Regex
scripts/lib/engine-update-check.mjs:151:40
-     const end = rest.findIndex((line) => /^(#{1,6}\s|---\s*$)/.test(line.trim()));
+     const end = rest.findIndex((line) => /^(#{1,6}\s|---\S*$)/.test(line.trim()));
