[Survived] Regex
scripts/lib/connector-accounts.mjs:158:14
-       .replace(/^[a-z][a-z0-9+.-]*:\/\//, "")
+       .replace(/[a-z][a-z0-9+.-]*:\/\//, "")

[Survived] Regex
scripts/lib/connector-accounts.mjs:159:14
-       .replace(/\.slack\.com.*$/, "");
+       .replace(/\.slack\.com.*/, "");

[Survived] ArrowFunction
scripts/lib/wiki-lint.mjs:16:33
-       .replace(/```[\s\S]*?```/g, (m) => " ".repeat(m.length))
+       .replace(/```[\s\S]*?```/g, () => undefined)

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:16:40
-       .replace(/```[\s\S]*?```/g, (m) => " ".repeat(m.length))
+       .replace(/```[\s\S]*?```/g, (m) => "".repeat(m.length))

[Survived] ArrowFunction
scripts/lib/wiki-lint.mjs:17:28
-       .replace(/`[^`\n]*`/g, (m) => " ".repeat(m.length));
+       .replace(/`[^`\n]*`/g, () => undefined);

[Survived] StringLiteral
scripts/lib/wiki-lint.mjs:17:35
-       .replace(/`[^`\n]*`/g, (m) => " ".repeat(m.length));
+       .replace(/`[^`\n]*`/g, (m) => "".repeat(m.length));

[Survived] Regex
scripts/lib/wiki-lint.mjs:55:31
-         register(suffix.replace(/\.md$/, ""), note.path); // folder/note, note
+         register(suffix.replace(/\.md/, ""), note.path); // folder/note, note

[Survived] EqualityOperator
scripts/lib/wiki-lint.mjs:178:29
-         if (when && (!seen || Date.parse(when) > Date.parse(seen))) {
+         if (when && (!seen || Date.parse(when) >= Date.parse(seen))) {

[Survived] ConditionalExpression
scripts/lib/wiki-lint.mjs:194:9
-       if (freshest && updated && daysBetween(freshest, updated) > staleDays) {
+       if (true && daysBetween(freshest, updated) > staleDays) {

[Survived] LogicalOperator
scripts/lib/wiki-lint.mjs:194:9
-       if (freshest && updated && daysBetween(freshest, updated) > staleDays) {
+       if (freshest || updated && daysBetween(freshest, updated) > staleDays) {
