[Survived] ConditionalExpression
scripts/auto-commit.mjs:87:5
-   if (isEntryPoint(process.argv[1], import.meta.url)) {
+   if (true) {

[Survived] MethodExpression
scripts/auto-push.mjs:34:16
-         ? Number(git(["rev-list", "--count", "@{u}..HEAD"]).out.trim()) || 0
+         ? Number(git(["rev-list", "--count", "@{u}..HEAD"]).out) || 0

[Survived] StringLiteral
scripts/auto-push.mjs:89:3
-     ".git/index.lock or a missing git identity are the usual causes).\n";
+     "";

[Survived] ConditionalExpression
scripts/auto-push.mjs:135:5
-   if (isEntryPoint(process.argv[1], import.meta.url)) {
+   if (true) {

[Survived] ConditionalExpression
scripts/auto-push.mjs:135:5
-   if (isEntryPoint(process.argv[1], import.meta.url)) {
+   if (false) {

[Survived] BlockStatement
scripts/auto-push.mjs:135:53
-   if (isEntryPoint(process.argv[1], import.meta.url)) {
-     process.exit(runHook(realHookDeps(import.meta.url)));
-   }
+   if (isEntryPoint(process.argv[1], import.meta.url)) {}
