[Survived] MethodExpression
scripts/lib/author-identities.mjs:49:3
-     [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])].map(nameSlug).filter((s) => s !== null);
+     [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])].map(nameSlug);

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:49:61
-     [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])].map(nameSlug).filter((s) => s !== null);
+     [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"])].map(nameSlug).filter((s) => s !== null);

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:49:94
-     [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])].map(nameSlug).filter((s) => s !== null);
+     [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])].map(nameSlug).filter((s) => true);

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:64:7
-     if (!io.existsSync(path)) return emptyState();
+     if (false) return emptyState();

[Survived] OptionalChaining
scripts/lib/author-identities.mjs:68:33
-         identities: Array.isArray(parsed?.identities) ? parsed.identities : [],
+         identities: Array.isArray(parsed.identities) ? parsed.identities : [],

[Survived] OptionalChaining
scripts/lib/author-identities.mjs:69:31
-         distinct: Array.isArray(parsed?.distinct) ? parsed.distinct.filter((n) => typeof n === "string") : [],
+         distinct: Array.isArray(parsed.distinct) ? parsed.distinct.filter((n) => typeof n === "string") : [],

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:90:7
-     if (slug === null || !Array.isArray(state?.distinct)) return false;
+     if (false || !Array.isArray(state?.distinct)) return false;

[Survived] OptionalChaining
scripts/lib/author-identities.mjs:115:36
-     const identities = Array.isArray(state?.identities) ? state.identities : [];
+     const identities = Array.isArray(state.identities) ? state.identities : [];

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:115:76
-     const identities = Array.isArray(state?.identities) ? state.identities : [];
+     const identities = Array.isArray(state?.identities) ? state.identities : ["Stryker was here"];

[Survived] LogicalOperator
scripts/lib/author-identities.mjs:127:91
-         state: { ...state, identities: [...identities, { name: canonical, aka }], distinct: state.distinct ?? [] },
+         state: { ...state, identities: [...identities, { name: canonical, aka }], distinct: state.distinct && [] },

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:127:109
-         state: { ...state, identities: [...identities, { name: canonical, aka }], distinct: state.distinct ?? [] },
+         state: { ...state, identities: [...identities, { name: canonical, aka }], distinct: state.distinct ?? ["Stryker was here"] },

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:134:16
-     const kept = typeof entry.name === "string" ? entry.name : canonical;
+     const kept = true ? entry.name : canonical;

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:141:9
-       if (slug === null || known.has(slug)) return false;
+       if (false || known.has(slug)) return false;

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:147:91
-     const merged = { ...entry, name: kept, aka: [...(Array.isArray(entry.aka) ? entry.aka : []), ...additions] };
+     const merged = { ...entry, name: kept, aka: [...(Array.isArray(entry.aka) ? entry.aka : ["Stryker was here"]), ...additions] };

[Survived] BooleanLiteral
scripts/lib/author-identities.mjs:149:9
-       ok: true,
+       ok: false,

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:150:62
-       state: { ...state, identities: identities.map((e, i) => (i === found ? merged : e)) },
+       state: { ...state, identities: identities.map((e, i) => (true ? merged : e)) },

[Survived] BooleanLiteral
scripts/lib/author-identities.mjs:151:14
-       changed: true,
+       changed: false,

[Survived] BooleanLiteral
scripts/lib/author-identities.mjs:168:78
-     if (slug === null) return { ok: false, reason: "unusable", state, changed: false };
+     if (slug === null) return { ok: false, reason: "unusable", state, changed: true };

[Survived] OptionalChaining
scripts/lib/author-identities.mjs:170:36
-     const identities = Array.isArray(state?.identities) ? state.identities : [];
+     const identities = Array.isArray(state.identities) ? state.identities : [];

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:170:76
-     const identities = Array.isArray(state?.identities) ? state.identities : [];
+     const identities = Array.isArray(state?.identities) ? state.identities : ["Stryker was here"];

[Survived] OptionalChaining
scripts/lib/author-identities.mjs:172:31
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry.aka) ? entry.aka : [];

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:172:57
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"];

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:174:12
-       return kept.length === aka.length ? entry : { ...entry, aka: kept };
+       return false ? entry : { ...entry, aka: kept };

[Survived] ArrowFunction
scripts/lib/author-identities.mjs:176:37
-     const fusionUndone = unfused.some((entry, i) => entry !== identities[i]);
+     const fusionUndone = unfused.some(() => undefined);

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:176:51
-     const fusionUndone = unfused.some((entry, i) => entry !== identities[i]);
+     const fusionUndone = unfused.some((entry, i) => true);

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:176:51
-     const fusionUndone = unfused.some((entry, i) => entry !== identities[i]);
+     const fusionUndone = unfused.some((entry, i) => false);

[Survived] OptionalChaining
scripts/lib/author-identities.mjs:178:34
-     const distinct = Array.isArray(state?.distinct) ? state.distinct : [];
+     const distinct = Array.isArray(state.distinct) ? state.distinct : [];

[Survived] EqualityOperator
scripts/lib/author-identities.mjs:176:51
-     const fusionUndone = unfused.some((entry, i) => entry !== identities[i]);
+     const fusionUndone = unfused.some((entry, i) => entry === identities[i]);

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:178:70
-     const distinct = Array.isArray(state?.distinct) ? state.distinct : [];
+     const distinct = Array.isArray(state?.distinct) ? state.distinct : ["Stryker was here"];

[Survived] ConditionalExpression
scripts/lib/author-identities.mjs:179:44
-     const already = distinct.some((known) => nameSlug(known) === slug);
+     const already = distinct.some((known) => true);

[Survived] BooleanLiteral
scripts/lib/author-identities.mjs:180:46
-     if (already && !fusionUndone) return { ok: true, state, changed: false };
+     if (already && !fusionUndone) return { ok: false, state, changed: false };

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:61:7
-     if (slug === null || !Array.isArray(identities)) return name;
+     if (false || !Array.isArray(identities)) return name;

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:68:9
-       if (slugSafe(canonical) === slug) return canonical;
+       if (false) return canonical;

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:70:29
-       if (aka.some((alias) => typeof alias === "string" && slugSafe(alias) === slug)) return canonical;
+       if (aka.some((alias) => true && slugSafe(alias) === slug)) return canonical;

[Survived] StringLiteral
scripts/lib/brain-author.mjs:153:60
-     const mine = slugSafe(canonicalAuthor(me, identities) ?? "");
+     const mine = slugSafe(canonicalAuthor(me, identities) ?? "Stryker was here!");

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:155:43
-       (Array.isArray(distinct) ? distinct : []).map((name) => (typeof name === "string" ? slugSafe(name) : null)),
+       (Array.isArray(distinct) ? distinct : ["Stryker was here"]).map((name) => (typeof name === "string" ? slugSafe(name) : null)),

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:155:62
-       (Array.isArray(distinct) ? distinct : []).map((name) => (typeof name === "string" ? slugSafe(name) : null)),
+       (Array.isArray(distinct) ? distinct : []).map((name) => (true ? slugSafe(name) : null)),

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:159:12
-       return slug !== null && slug !== mine && !confirmed.has(slug);
+       return true && slug !== mine && !confirmed.has(slug);

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:180:14
-     if (!me || slugSafe(me) === null) return null;
+     if (!me || false) return null;

[Survived] ConditionalExpression
scripts/lib/brain-author.mjs:188:38
-     const list = `${named.join(", ")}${rest > 0 ? ` +${rest}` : ""}`;
+     const list = `${named.join(", ")}${true ? ` +${rest}` : ""}`;

[Survived] EqualityOperator
scripts/lib/brain-author.mjs:188:38
-     const list = `${named.join(", ")}${rest > 0 ? ` +${rest}` : ""}`;
+     const list = `${named.join(", ")}${rest >= 0 ? ` +${rest}` : ""}`;

[Survived] StringLiteral
scripts/lib/brain-author.mjs:188:63
-     const list = `${named.join(", ")}${rest > 0 ? ` +${rest}` : ""}`;
+     const list = `${named.join(", ")}${rest > 0 ? ` +${rest}` : "Stryker was here!"}`;

[Survived] StringLiteral
scripts/lib/brain-author.mjs:190:57
-       `This brain cannot place ${countOf(unplaced.length, "name")} writing here: ${list}. ASK before ` +
+       `This brain cannot place ${countOf(unplaced.length, "")} writing here: ${list}. ASK before ` +

[Survived] StringLiteral
scripts/author-identity.mjs:44:3
-     "reach the other one. Run `git status` in your brain to see what stopped the commit.";
+     "";

[Survived] StringLiteral
scripts/author-identity.mjs:37:3
-     `       --same-person: that spelling is YOU, on another machine (the two are fused).\n` +
+     `` +

[Survived] StringLiteral
scripts/author-identity.mjs:36:3
-     `usage: author-identity.mjs --same-person "<name>" | --different "<name>" | --list\n` +
+     `` +

[Survived] StringLiteral
scripts/author-identity.mjs:43:3
-     "\n⚠️  ANSWER NOT COMMITTED — it is recorded on THIS machine only and will not " +
+     "" +

[Survived] StringLiteral
scripts/author-identity.mjs:38:3
-     `       --different:   that really is a second person (asked about once, never again).`;
+     ``;

[Survived] StringLiteral
scripts/author-identity.mjs:49:3
-     "\nNote: a merge/rebase is in progress here, so the answer will be committed with " +
+     "" +

[Survived] StringLiteral
scripts/author-identity.mjs:50:3
-     "it at the end of the turn.";
+     "";

[Survived] ArrowFunction
scripts/author-identity.mjs:55:19
-       readFileSync: (p) => readFileSync(p, "utf-8"),
+       readFileSync: () => undefined,

[Survived] ConditionalExpression
scripts/author-identity.mjs:74:7
-     if (argv.length === 1 && argv[0] === "--list") return { action: "list" };
+     if (true && argv[0] === "--list") return { action: "list" };

[Survived] StringLiteral
scripts/author-identity.mjs:78:48
-     if (flag === "--different") return { action: "distinct", name };
+     if (flag === "--different") return { action: "", name };

[Survived] OptionalChaining
scripts/author-identity.mjs:86:31
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry.aka) ? entry.aka : [];

[Survived] ArrayDeclaration
scripts/author-identity.mjs:86:57
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"];

[Survived] ConditionalExpression
scripts/author-identity.mjs:87:9
-       if (typeof entry?.name !== "string") continue;
+       if (false) continue;

[Survived] OptionalChaining
scripts/author-identity.mjs:87:16
-       if (typeof entry?.name !== "string") continue;
+       if (typeof entry.name !== "string") continue;

[Survived] ConditionalExpression
scripts/author-identity.mjs:88:16
-       lines.push(aka.length === 0 ? `${entry.name}` : `${entry.name} — also writes as ${aka.join(", ")}`);
+       lines.push(false ? `${entry.name}` : `${entry.name} — also writes as ${aka.join(", ")}`);

[Survived] StringLiteral
scripts/author-identity.mjs:88:35
-       lines.push(aka.length === 0 ? `${entry.name}` : `${entry.name} — also writes as ${aka.join(", ")}`);
+       lines.push(aka.length === 0 ? `` : `${entry.name} — also writes as ${aka.join(", ")}`);

[Survived] StringLiteral
scripts/author-identity.mjs:88:96
-       lines.push(aka.length === 0 ? `${entry.name}` : `${entry.name} — also writes as ${aka.join(", ")}`);
+       lines.push(aka.length === 0 ? `${entry.name}` : `${entry.name} — also writes as ${aka.join("")}`);

[Survived] StringLiteral
scripts/author-identity.mjs:91:107
-     return lines.length === 0 ? "Nothing recorded yet: no name in this brain has been placed." : lines.join("\n");
+     return lines.length === 0 ? "Nothing recorded yet: no name in this brain has been placed." : lines.join("");

[Survived] StringLiteral
scripts/author-identity.mjs:96:14
-     let note = "";
+     let note = "Stryker was here!";

[Survived] ConditionalExpression
scripts/author-identity.mjs:97:30
-     if (commit === "failed" || commit === "conflicted") note += ANSWER_NOT_COMMITTED_WARNING;
+     if (commit === "failed" || false) note += ANSWER_NOT_COMMITTED_WARNING;

[Survived] StringLiteral
scripts/author-identity.mjs:97:41
-     if (commit === "failed" || commit === "conflicted") note += ANSWER_NOT_COMMITTED_WARNING;
+     if (commit === "failed" || commit === "") note += ANSWER_NOT_COMMITTED_WARNING;

[Survived] ConditionalExpression
scripts/author-identity.mjs:98:7
-     if (commit === "deferred") note += ANSWER_DEFERRED_NOTE;
+     if (true) note += ANSWER_DEFERRED_NOTE;

[Survived] ConditionalExpression
scripts/author-identity.mjs:99:7
-     if (push === "failed") note += PUSH_FAILED_WARNING;
+     if (true) note += PUSH_FAILED_WARNING;

[Survived] StringLiteral
scripts/author-identity.mjs:127:9
-           `✗ this machine's git has no user.name, so there is nobody to fuse "${intent.name}" with. ` +
+           `` +

[Survived] StringLiteral
scripts/author-identity.mjs:128:11
-             `Set it first: git config user.name "<your name>".`,
+             ``,

[Survived] LogicalOperator
scripts/author-identity.mjs:133:42
-       message = `auto: ${intent.name} is ${result.canonical ?? me} on another machine`;
+       message = `auto: ${intent.name} is ${result.canonical && me} on another machine`;

[Survived] StringLiteral
scripts/author-identity.mjs:145:7
-         `✗ "${intent.name}" is not a name this brain can file under (it has no letters or digits), ` +
+         `` +

[Survived] StringLiteral
scripts/author-identity.mjs:146:9
-           `so it cannot be recorded. Use the spelling git shows in the question.`,
+           ``,
