[Survived] OptionalChaining
scripts/lib/author-identities.mjs:190:31
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry.aka) ? entry.aka : [];

[Survived] StringLiteral
scripts/lib/brain-author.mjs:85:59
-     const left = slugSafe(canonicalAuthor(a, identities) ?? "");
+     const left = slugSafe(canonicalAuthor(a, identities) ?? "Stryker was here!");

[Survived] StringLiteral
scripts/lib/brain-author.mjs:86:60
-     const right = slugSafe(canonicalAuthor(b, identities) ?? "");
+     const right = slugSafe(canonicalAuthor(b, identities) ?? "Stryker was here!");

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:157:43
-       (Array.isArray(distinct) ? distinct : []).map((name) => (typeof name === "string" ? slugSafe(name) : null)),
+       (Array.isArray(distinct) ? distinct : ["Stryker was here"]).map((name) => (typeof name === "string" ? slugSafe(name) : null)),
