[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:52:89
-   const entrySlugs = (entry) => [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : [])].map(nameSlug);
+   const entrySlugs = (entry) => [entry?.name, ...(Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"])].map(nameSlug);

[Survived] ArrayDeclaration
scripts/lib/author-identities.mjs:190:57
-       const aka = Array.isArray(entry?.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry?.aka) ? entry.aka : ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:69:56
-       const aka = Array.isArray(entry.aka) ? entry.aka : [];
+       const aka = Array.isArray(entry.aka) ? entry.aka : ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/brain-author.mjs:171:43
-       (Array.isArray(distinct) ? distinct : []).map((name) => (typeof name === "string" ? slugSafe(name) : null)),
+       (Array.isArray(distinct) ? distinct : ["Stryker was here"]).map((name) => (typeof name === "string" ? slugSafe(name) : null)),

[Survived] StringLiteral
scripts/author-identity.mjs:55:42
-       readFileSync: (p) => readFileSync(p, "utf-8"),
+       readFileSync: (p) => readFileSync(p, ""),
