[Survived] ConditionalExpression
scripts/lib/dated-note-path.mjs:61:17
-     const owner = base.author == null ? null : slugSafe(canonicalAuthor(base.author, identities) ?? "");
+     const owner = false ? null : slugSafe(canonicalAuthor(base.author, identities) ?? "");

[Survived] StringLiteral
scripts/lib/dated-note-path.mjs:61:99
-     const owner = base.author == null ? null : slugSafe(canonicalAuthor(base.author, identities) ?? "");
+     const owner = base.author == null ? null : slugSafe(canonicalAuthor(base.author, identities) ?? "Stryker was here!");

[Survived] StringLiteral
scripts/lib/dated-note-path.mjs:62:70
-     const mine = slugSafe(canonicalAuthor(author ?? "", identities) ?? "");
+     const mine = slugSafe(canonicalAuthor(author ?? "", identities) ?? "Stryker was here!");

[Survived] ArrayDeclaration
scripts/lib/remote-sync.mjs:161:19
-     let confirmed = [];
+     let confirmed = ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/lib/remote-sync.mjs:167:17
-       confirmed = [];
+       confirmed = ["Stryker was here"];

[Survived] BlockStatement
scripts/lib/remote-sync.mjs:164:11
-     } catch {
-       // A registry that cannot be read costs the fusion, never the tick: one banner too
-       // many is a nuisance, a sync that stops is a brain out of step.
-       confirmed = [];
-     }
+     } catch {}

[Survived] StringLiteral
scripts/dated-note-path.mjs:53:73
-       readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(process.cwd()))
+       readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "") }, vaultRagDir(process.cwd()))

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:88:20
-     let identities = [];
+     let identities = ["Stryker was here"];

[Survived] BlockStatement
scripts/dated-note-path.mjs:91:11
-     } catch {
-       identities = [];
-     }
+     } catch {}

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:92:18
-       identities = [];
+       identities = ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:106:13
-       notes = [];
+       notes = ["Stryker was here"];

[Survived] ArrowFunction
scripts/remote-sync.mjs:187:17
-       identities: () =>
-         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(brainDir))
-           .identities,
+       identities: () => undefined,

[Survived] ArrowFunction
scripts/remote-sync.mjs:188:52
-         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(brainDir))
+         readAuthorsState({ existsSync, readFileSync: () => undefined }, vaultRagDir(brainDir))

[Survived] ObjectLiteral
scripts/remote-sync.mjs:188:24
-         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(brainDir))
+         readAuthorsState({}, vaultRagDir(brainDir))

[Survived] StringLiteral
scripts/remote-sync.mjs:188:75
-         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(brainDir))
+         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "") }, vaultRagDir(brainDir))

[Survived] StringLiteral
scripts/session-authors.mjs:98:36
-         if (!log.ok) throw new Error("no git history");
+         if (!log.ok) throw new Error("");

[Survived] StringLiteral
scripts/session-authors.mjs:105:75
-         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "utf-8") }, vaultRagDir(brainDir)),
+         readAuthorsState({ existsSync, readFileSync: (p) => readFileSync(p, "") }, vaultRagDir(brainDir)),
