[Survived] BlockStatement
scripts/lib/remote-sync.mjs:165:11
-     } catch {
-       // A registry that cannot be read costs the fusion, never the tick: one banner too
-       // many is a nuisance, a sync that stops is a brain out of step.
-       confirmed = [];
-     }
+     } catch {}

[Survived] ArrayDeclaration
scripts/lib/remote-sync.mjs:168:17
-       confirmed = [];
+       confirmed = ["Stryker was here"];

[Survived] BlockStatement
scripts/dated-note-path.mjs:93:11
-     } catch {
-       identities = [];
-     }
+     } catch {}

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:94:18
-       identities = [];
+       identities = ["Stryker was here"];

[Survived] ArrayDeclaration
scripts/dated-note-path.mjs:108:13
-       notes = [];
+       notes = ["Stryker was here"];
