[Survived] ConditionalExpression
rag/src/lib/remote-sync-interval.ts:25:7
-     if (!trimmed) return DEFAULT_REMOTE_SYNC_INTERVAL_SECONDS;
+     if (false) return DEFAULT_REMOTE_SYNC_INTERVAL_SECONDS;

[Survived] BooleanLiteral
rag/src/lib/remote-sync-scheduler.ts:59:21
-     private stopped = false;
+     private stopped = true;
