[Survived] StringLiteral
rag/src/lib/campaign-persist.ts:54:35
-   export const REMOTE_SYNC_SCRIPT = "remote-sync.mjs";
+   export const REMOTE_SYNC_SCRIPT = "";

[Survived] ConditionalExpression
rag/src/lib/frontmatter-parser.ts:153:45
-       .filter((v) => typeof v === "string" && v.trim() !== "")
+       .filter((v) => typeof v === "string" && true)

[Survived] MethodExpression
rag/src/lib/frontmatter-parser.ts:153:45
-       .filter((v) => typeof v === "string" && v.trim() !== "")
+       .filter((v) => typeof v === "string" && v !== "")

[Survived] MethodExpression
rag/src/lib/frontmatter-parser.ts:154:17
-       .map((v) => (v as string).trim());
+       .map((v) => v as string);

[Survived] StringLiteral
rag/src/lib/frontmatter-parser.ts:153:58
-       .filter((v) => typeof v === "string" && v.trim() !== "")
+       .filter((v) => typeof v === "string" && v.trim() !== "Stryker was here!")

[Survived] ArrowFunction
rag/src/lib/remote-sync-scheduler.ts:65:29
-       this.log = opts.log ?? ((message) => console.error(message));
+       this.log = opts.log ?? (() => undefined);

[Survived] ArrowFunction
rag/src/lib/remote-sync-scheduler.ts:66:35
-       this.random = opts.random ?? (() => Math.random());
+       this.random = opts.random ?? (() => undefined);

[Survived] ArrowFunction
rag/src/lib/remote-sync-scheduler.ts:68:43
-       this.clearTimer = opts.clearTimer ?? ((h) => clearTimeout(h));
+       this.clearTimer = opts.clearTimer ?? (() => undefined);

[Survived] ArrowFunction
rag/src/lib/remote-sync-scheduler.ts:67:39
-       this.setTimer = opts.setTimer ?? ((fn, ms) => setTimeout(fn, ms));
+       this.setTimer = opts.setTimer ?? (() => undefined);

[Survived] StringLiteral
rag/src/lib/shutdown-plan.ts:32:37
-         stopQuietly(deps.stopWatcher, "the live watcher", deps.trace);
+         stopQuietly(deps.stopWatcher, "", deps.trace);

[Survived] StringLiteral
rag/src/lib/shutdown-plan.ts:33:40
-         stopQuietly(deps.stopRemoteSync, "the live-sync clock", deps.trace);
+         stopQuietly(deps.stopRemoteSync, "", deps.trace);
