[Survived] LogicalOperator
scripts/lib/reconcile-brain.mjs:502:9
-       if (unignored.changed || ignored.changed || arrivals.changed) writeFileSync(gitignorePath, arrivals.text);
+       if ((unignored.changed || ignored.changed) && arrivals.changed) writeFileSync(gitignorePath, arrivals.text);

[Survived] ConditionalExpression
scripts/lib/reconcile-brain.mjs:502:9
-       if (unignored.changed || ignored.changed || arrivals.changed) writeFileSync(gitignorePath, arrivals.text);
+       if (true) writeFileSync(gitignorePath, arrivals.text);

[Survived] ConditionalExpression
scripts/lib/reconcile-brain.mjs:502:9
-       if (unignored.changed || ignored.changed || arrivals.changed) writeFileSync(gitignorePath, arrivals.text);
+       if (false || arrivals.changed) writeFileSync(gitignorePath, arrivals.text);

[Survived] LogicalOperator
scripts/lib/reconcile-brain.mjs:502:9
-       if (unignored.changed || ignored.changed || arrivals.changed) writeFileSync(gitignorePath, arrivals.text);
+       if (unignored.changed && ignored.changed || arrivals.changed) writeFileSync(gitignorePath, arrivals.text);

[Survived] StringLiteral
scripts/prompt-restart-nudge.mjs:70:64
-       const directive = [restart, arrivals].filter(Boolean).join("\n\n");
+       const directive = [restart, arrivals].filter(Boolean).join("");
