[Survived] ArrayDeclaration
scripts/lib/self-heal-detect.mjs:40:21
-     wantedSkillDirs = [],
+     wantedSkillDirs = ["Stryker was here"],

[Survived] ArrayDeclaration
scripts/lib/self-heal-detect.mjs:41:21
-     wantedServerIds = [],
+     wantedServerIds = ["Stryker was here"],

[Survived] ArrayDeclaration
scripts/lib/self-heal-detect.mjs:74:59
-   export function missingInstalledDependencies({ declared = [], isInstalled }) {
+   export function missingInstalledDependencies({ declared = ["Stryker was here"], isInstalled }) {

[Survived] StringLiteral
scripts/session-self-heal.mjs:99:84
-           ? `hooks: ${gap.unwiredHooks.map((script) => script.split("/").pop()).join(", ")}`
+           ? `hooks: ${gap.unwiredHooks.map((script) => script.split("/").pop()).join("")}`

[Survived] StringLiteral
scripts/session-self-heal.mjs:101:86
-         gap.missingDependencies.length ? `dependencies: ${gap.missingDependencies.join(", ")}` : null,
+         gap.missingDependencies.length ? `dependencies: ${gap.missingDependencies.join("")}` : null,

[Survived] BlockStatement
scripts/session-self-heal.mjs:213:39
-   function deriveUnwiredHooks(brainDir) {
-     const templatePath = join(brainDir, ".claude", "settings.json.template");
-     const settingsPath = join(brainDir, ".claude", "settings.json");
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
-     const { hooksAdded } = reconcileHooks({
-       brainHooks: JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {},
-       templateHooks: JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {},
-       projectRoot: brainDir,
-     });
-     return hooksAdded;
-   }
+   function deriveUnwiredHooks(brainDir) {}

[Survived] StringLiteral
scripts/session-self-heal.mjs:214:39
-     const templatePath = join(brainDir, ".claude", "settings.json.template");
+     const templatePath = join(brainDir, "", "settings.json.template");

[Survived] StringLiteral
scripts/session-self-heal.mjs:215:39
-     const settingsPath = join(brainDir, ".claude", "settings.json");
+     const settingsPath = join(brainDir, "", "settings.json");

[Survived] ConditionalExpression
scripts/session-self-heal.mjs:216:7
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
+     if (true) return [];

[Survived] ConditionalExpression
scripts/session-self-heal.mjs:216:7
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
+     if (false) return [];

[Survived] LogicalOperator
scripts/session-self-heal.mjs:216:7
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
+     if (!existsSync(templatePath) && !existsSync(settingsPath)) return [];

[Survived] BooleanLiteral
scripts/session-self-heal.mjs:216:7
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
+     if (existsSync(templatePath) || !existsSync(settingsPath)) return [];

[Survived] BooleanLiteral
scripts/session-self-heal.mjs:216:36
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
+     if (!existsSync(templatePath) || existsSync(settingsPath)) return [];

[Survived] ArrayDeclaration
scripts/session-self-heal.mjs:216:70
-     if (!existsSync(templatePath) || !existsSync(settingsPath)) return [];
+     if (!existsSync(templatePath) || !existsSync(settingsPath)) return ["Stryker was here"];

[Survived] ObjectLiteral
scripts/session-self-heal.mjs:217:41
-     const { hooksAdded } = reconcileHooks({
-       brainHooks: JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {},
-       templateHooks: JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {},
-       projectRoot: brainDir,
-     });
+     const { hooksAdded } = reconcileHooks({});

[Survived] LogicalOperator
scripts/session-self-heal.mjs:218:17
-       brainHooks: JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {},
+       brainHooks: JSON.parse(readFileSync(settingsPath, "utf8")).hooks && {},

[Survived] StringLiteral
scripts/session-self-heal.mjs:218:55
-       brainHooks: JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {},
+       brainHooks: JSON.parse(readFileSync(settingsPath, "")).hooks ?? {},

[Survived] StringLiteral
scripts/session-self-heal.mjs:219:58
-       templateHooks: JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {},
+       templateHooks: JSON.parse(readFileSync(templatePath, "")).hooks ?? {},

[Survived] LogicalOperator
scripts/session-self-heal.mjs:219:20
-       templateHooks: JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {},
+       templateHooks: JSON.parse(readFileSync(templatePath, "utf8")).hooks && {},

[Survived] BlockStatement
scripts/session-self-heal.mjs:230:46
-   function deriveMissingDependencies(brainDir) {
-     const ragDir = join(brainDir, "rag");
-     const pkgPath = join(ragDir, "package.json");
-     if (!existsSync(pkgPath)) return [];
-     return missingInstalledDependencies({
-       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "utf8")).dependencies ?? {}),
-       isInstalled: (name) => existsSync(join(ragDir, "node_modules", name)),
-     });
-   }
+   function deriveMissingDependencies(brainDir) {}

[Survived] StringLiteral
scripts/session-self-heal.mjs:231:33
-     const ragDir = join(brainDir, "rag");
+     const ragDir = join(brainDir, "");

[Survived] ConditionalExpression
scripts/session-self-heal.mjs:233:7
-     if (!existsSync(pkgPath)) return [];
+     if (true) return [];

[Survived] BooleanLiteral
scripts/session-self-heal.mjs:233:7
-     if (!existsSync(pkgPath)) return [];
+     if (existsSync(pkgPath)) return [];

[Survived] ConditionalExpression
scripts/session-self-heal.mjs:233:7
-     if (!existsSync(pkgPath)) return [];
+     if (false) return [];

[Survived] ObjectLiteral
scripts/session-self-heal.mjs:234:39
-     return missingInstalledDependencies({
-       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "utf8")).dependencies ?? {}),
-       isInstalled: (name) => existsSync(join(ragDir, "node_modules", name)),
-     });
+     return missingInstalledDependencies({});

[Survived] ArrayDeclaration
scripts/session-self-heal.mjs:233:36
-     if (!existsSync(pkgPath)) return [];
+     if (!existsSync(pkgPath)) return ["Stryker was here"];

[Survived] LogicalOperator
scripts/session-self-heal.mjs:235:27
-       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "utf8")).dependencies ?? {}),
+       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "utf8")).dependencies && {}),

[Survived] StringLiteral
scripts/session-self-heal.mjs:235:60
-       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "utf8")).dependencies ?? {}),
+       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "")).dependencies ?? {}),

[Survived] ArrowFunction
scripts/session-self-heal.mjs:236:18
-       isInstalled: (name) => existsSync(join(ragDir, "node_modules", name)),
+       isInstalled: () => undefined,

[Survived] StringLiteral
scripts/session-self-heal.mjs:236:52
-       isInstalled: (name) => existsSync(join(ragDir, "node_modules", name)),
+       isInstalled: (name) => existsSync(join(ragDir, "", name)),
