[Survived] Regex
scripts/session-self-heal.mjs:102:86
-           ? `hooks: ${gap.unwiredHooks.map((script) => script.split("/").pop().replace(/\.mjs$/, "")).join(", ")}`
+           ? `hooks: ${gap.unwiredHooks.map((script) => script.split("/").pop().replace(/\.mjs/, "")).join(", ")}`

[Survived] ArrayDeclaration
scripts/session-self-heal.mjs:199:22
-       wantedSkillDirs: [...new Set([...mergeSkillDirs, ...stagedSkillDirs])],
+       wantedSkillDirs: [],

[Survived] ArrayDeclaration
scripts/session-self-heal.mjs:199:34
-       wantedSkillDirs: [...new Set([...mergeSkillDirs, ...stagedSkillDirs])],
+       wantedSkillDirs: [...new Set([])],

[Survived] StringLiteral
scripts/session-self-heal.mjs:221:55
-       brainHooks: JSON.parse(readFileSync(settingsPath, "utf8")).hooks ?? {},
+       brainHooks: JSON.parse(readFileSync(settingsPath, "")).hooks ?? {},

[Survived] StringLiteral
scripts/session-self-heal.mjs:222:58
-       templateHooks: JSON.parse(readFileSync(templatePath, "utf8")).hooks ?? {},
+       templateHooks: JSON.parse(readFileSync(templatePath, "")).hooks ?? {},

[Survived] StringLiteral
scripts/session-self-heal.mjs:238:60
-       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "utf8")).dependencies ?? {}),
+       declared: Object.keys(JSON.parse(readFileSync(pkgPath, "")).dependencies ?? {}),
