[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)/i;

[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;

[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\S*:?\s+(.+)$/i;

[Survived] Regex
scripts/lib/declared-spellings.mjs:36:15
-   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s+(.+)$/i;
+   const ENTRY = /^(.+?)\s+[—–-]\s+(?:never|not)\s*:?\s(.+)$/i;

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:104:46
-     return (Array.isArray(entries) ? entries : [])
+     return (Array.isArray(entries) ? entries : ["Stryker was here"])

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:105:50
-       .flatMap(({ canonical, wrong }) => (wrong ?? []).map((from) => ({ from, to: canonical })))
+       .flatMap(({ canonical, wrong }) => (wrong ?? ["Stryker was here"]).map((from) => ({ from, to: canonical })))

[Survived] ConditionalExpression
scripts/lib/declared-spellings.mjs:106:78
-       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && typeof to === "string")
+       .filter(({ from, to }) => typeof from === "string" && from.length > 0 && true)

[Survived] Regex
scripts/lib/declared-spellings.mjs:123:3
-     /^>.*$/gm, //                      a blockquote is someone else's words
+     /^>.*/gm, //                      a blockquote is someone else's words

[Survived] ArrayDeclaration
scripts/lib/declared-spellings.mjs:130:17
-     const spans = [];
+     const spans = ["Stryker was here"];

[Survived] StringLiteral
scripts/lib/update-offer.mjs:93:45
-     const due = Date.parse(state.nextAskAt ?? "");
+     const due = Date.parse(state.nextAskAt ?? "Stryker was here!");

[Survived] ArrayDeclaration
scripts/lib/update-offer.mjs:186:40
-     const release = (verdict.releases ?? []).find((entry) => entry?.version === version);
+     const release = (verdict.releases ?? ["Stryker was here"]).find((entry) => entry?.version === version);

[Survived] StringLiteral
scripts/lib/update-offer.mjs:221:78
-   export function readOfferState({ brainDir, readFile = (p) => readFileSync(p, "utf8") }) {
+   export function readOfferState({ brainDir, readFile = (p) => readFileSync(p, "") }) {

[Survived] ConditionalExpression
scripts/lib/update-offer.mjs:224:12
-       return parsed !== null && typeof parsed === "object" ? parsed : null;
+       return true && typeof parsed === "object" ? parsed : null;
